[
    {
        "author": "ivo-cobra8",
        "review_date": "10 October 2015",
        "title": " Science Fiction/Action Classic and the best Original Batman film from the 80's.",
        "rating": "10",
        "review": "The 1989 Batman is the original Dark Knight and Tim Burton's Classic Dark Knight film. This is my number 1 personal favorite Batman of all Batman movies this is my movie and I love this film to death! Jack Nicholson was well-cast as The Joker he was a wonderful in his lead role performance. Michael Keaton was just great as Bruce Wayne/Batman, he acted like the role of Batman was written on his skin. Kim Bassinger did a wonderful performance as her role Vicki Vale. I think Vicky Vale is very underrated character from all other female lead characters in all Batman films. Michael Gough did a wonderful job as the butler Alfred Pennyworth Batman's helper. Seriously Alfred for me will be always Michael Gough not only that he acted much better than Michael Caine did he even showed more heart and caring in the whole Batman franchise than Michael Caine did. The acting in this film is awesome, the character developments and the story plot are TERRIFIC! Michael Keaton caused an uproar when he was casted as Batman as fans boycotted the idea yet in Christmas 1988 when the trailer hit theaters the silence was shut as it was a nice teaser. This movie was the most hyped movie of 1989 as months audiences including fans had waited even with a second trailer that showed up in the spring of 1989 and merchandise was everywhere as it was the year of the Batman, hell even TV stations had reruns of the 60's Batman show to cash-in on the phenomenon. This movie opened on June 21st 1989 and became one of the highest grossing movies of all time and the biggest movie of the year earning acclaim and making Batman cool again just like Frank Miller and Alan Moore did. The Action and fights sequences were great and awesome. At least so much better than they were in Batman Begins (2005). It was my first Batman film I ever saw and this movie just absolutely Kick Ass. The Batwing that appears by the end of this movie is awesome by using to combat the Joker. When the Joker launches a deadly Smilex gas attack through balloons, Batman came in the Batwing and destroyed the balloons, angering Joker. Awesome! Batman then fired off several missiles and two mini guns, killing many henchmen but missing Joker, who in turn shot it down with one bullet from his long barreled revolver. The Joker Thugs are amazing. The main theme score by Danny Elfman was just amazing and really beautiful. I absolutely love this movie. I would never compare all other Nolan batman films with this masterpiece. Except The Dark Knight that it is the best Batman film. I will say it again this movie is AWESOME! The Batsuit designed by Costume designer Bob Ringwood who turned down the chance to work on Licence to Kill in favor of Batman was AWESOME! Ringwood found it difficult designing the Batsuit because \"the image of Batman in the comics is this huge, big six-foot-four hunk with a dimpled chin. Gotham City, a big city where crime has been occurring lately and a mysterious caped crusader named Batman (Michael Keaton) is wiping streets clean of criminals, it leaves the police especially commissioner Gordon (Pat Hingle) baffled. A gangster named Jack Napier (Jack Nicholson) was dropped into a vat of chemicals which leaves him disfigures with paint-like white bleached skin and ruby-red lips plus green hair which makes him clown-like as he now calls himself Joker, he begins to terrorize the city of Gotham and stalk a sexy photographer named Vickie Vale (Kim Bassinger). Bruce Wayne who is Gotham's richest man falls in love with Vickie yet she doesn't know his true secret that he's Batman, but can Bruce deal with romance and battling with Joker at the same time?Batman is a 1989 American superhero film directed by Tim Burton and produced by Jon Peters, based on the DC Comics character of the same name. It is the first installment of Warner Bros.' initial Batman film series. The film stars Jack Nicholson, Michael Keaton in the title role, Kim Basinger, Robert Wuhl, Pat Hingle, Billy Dee Williams, Michael Gough, and Jack Palance.The Dark Knight of Gotham City begins his war on crime with his first major enemy being the clownishly homicidal Joker.This is definitely my favorite classic Action film from the 80's it was always my favorite childhood movie and it will always be. The action scenes are just fantastic and how Batman saves Gotham City from the Joker balloons of a deadly Smilex gas attack was amazing. Burton's Batman is my number 1 favorite film of all times and it will always be and I love it to death! 10/10 Michael Keaton will be the only Batman for me!:P."
    },
    {
        "author": "ReelCheese",
        "review_date": "7 June 2006",
        "title": " Stylish and Thrilling",
        "rating": "9",
        "review": "Dark, foreboding and vastly entertaining, BATMAN changed superhero movies forever. Gone are the days of happy-go-lucky heroes arriving just in time to save the day. Director Tim Burton's Caped Crusader is a vengeful creature of the night preying on criminals who would turn his city into their personal playground.BATMAN is one stylish, thrilling and one helluva ride. While he's not generally associated with action, Burton proves it to be his forte as the Dark Knight Detective swoops out of the shadows, crashes through windows and employs a host of what his nemesis calls \"wonderful toys,\" such as grappling hook guns and the amazingly versatile Batmobile. And man on man, this Batman kicks some ass, at one point daring an armed henchman with a \"come here\" finger gesture.BATMAN wouldn't have worked nearly as well as it does without the right casting ingredients. The hiring of Michael Keaton in the lead role drew plenty of snickers, but the underrated actor showed up his detractors with a suitably mysterious performance. We know his heart is in the right place, but we're never quite sure what we should make of him. Jack Nicholson's famous performance as the villainous Joker is every bit as good as they say. Nicholson is equal parts amusing and sadistic beneath the white face paint and green hair. Sexy Kim Basinger, as reporter Vicki Vale, also makes the most out of her screen time.BATMAN is one of those films whose obvious flaws are so easily overlooked. The worst sin a movie can commit is to be dull, and that's something BATMAN never does."
    },
    {
        "author": "nino-keskilammi",
        "review_date": "8 June 2009",
        "title": " Classic Masterpiece",
        "rating": "10",
        "review": "I remember when i was a kid and i got this on video and i watched it so many times. But later, video got deleted :(. Well about 7 years i bought it for DVD and it was so huge masterpiece, what i didn't notice. This classical film should be top 250. Characters are so good. Michael Keaton is the best Batman by far. Jack Nicholson has really great lines and hes really good as The Joker. A reason why this movie is such a great is cause of its music sequences. This is what we need, we need music all the time in the movies. Other reason is its really entertaining with epic humors by The Joker. The story is great. Batman notices that Joker is the guy, who killed his parents.\" Have you ever danced with the devil in the pale moonlight\" is classic. The end of the film is a full off excellent action and it ends really good with great music.A movie is not hard to make. It just needs to get great director as Tim Burton and great actors."
    },
    {
        "author": "Anonymous_Maxine",
        "review_date": "26 August 2001",
        "title": " I don't even need to say that this is the best Batman of the series. It's obvious enough.",
        "rating": "10",
        "review": "What is all this yap about Michael Keaton as Batman? Yes, he was Batman, and he was a GREAT Batman. He pulled off every aspect of the role perfectly  he was better than Val Kilmer, better than George Clooney, better than everyone. He portrayed the mysterious charm of the winged crusader just as well as he captured the cool and collected character of Bruce Wayne. Michael Keaton is a huge part of the reason that this film was such a huge success, the other main portion having come from the tremendous contribution from Jack Nicholson as the Joker. Gotham City is created in incredibly detailed comic-book style, which adds to the overall quality of the movie.Director Tim Burton does an amazing job bringing this unreal world to reality, and Kim Basinger is excellent as Vicky Vale, the film's main female presence. The script is particularly brilliant. The role of the Joker seems to have been written specifically for Jack Nicholson, which would not be surprising because of how well he pulled off the role with lines like `Why didn't anyone tell me he had one of thosethings?!' and `Remember me? When you dropped me into that vat of chemicals? That wasn't easy to get over, and don't think that I didn't try.' And, of course, my favorite, `we'll be like Beauty and the Beast. Of course, if anyone else ever calls you beast, I'll rip their lungs out.' Everything, from the setting in Gotham City to the characters costumes to the actual dialogue, gives the unreal feeling of a comic book, but the characters are developed enough so that we understand their problems and we care about what happens. The movie is a thrill ride from the beginning to the end, and is enjoyable for all ages. If anyone is going to complain about who was chosen to play Batman, there is much more room for complaint among the film's several sequels. Keaton did a spectacular job that no one has ever even come close to."
    },
    {
        "author": "Smells_Like_Cheese",
        "review_date": "19 September 2002",
        "title": " A Tim Burton Classic!",
        "rating": "10",
        "review": "Tim Burton takes a darker twist to a cheesy over the top silly TV show that was loved by everyone. Batman is now played by Michael Keaton. Michael as Batman was perfect, he had the look, humor, and mystery that is Batman. Playing Batman for him, he became the role and I will always stand by that. For me, he is the best Batman, no one besides the original Adam West can touch his performance.Jack Nicholson is now the Joker. Who could ask for a better Joker? He has the look and dirty scary side to him that makes you fear but want to enjoy his presence on screen. He has such charisma and appeal, his lines were perfectly delivered and every scene, he stole. He and Michael were terrific together. They played off each other so well, it makes you go crazy almost. The Dark Knight vs. The Joker, the perfect super hero and villain. Jack stole my heart with his killer, no pun intended, performance.Kim Bassigner was also fantastic. She plays Vicki Vale, the love interest of Bruce Wayne/Batman. She is a photo journalist who is looking for the true identity of Batman, which leads to the question of if Batman can trust another being with his darkest secret? She was absolutely beautiful and charming. No other woman could've done a better job.Like I said, Tim Burton, he takes a different turn on this \"Batman\", but it's very appealing. Everyone loves this movie, and I can't blame them. Batman is the best super hero of all comic book hero's in my opinion. You see Spider-man can fly with webs, Super Man has super strength and can fly, but Batman just needs himself. He kicks butt by himself. :) The only thing you miss in the movie is Robin, his faithful sidekick, but I don't blame Tim for not adding him for this Batman. It wasn't needed. With a cool soundtrack by Prince and and awesome setting, please watch \"Batman\", it's a true classic.10/10"
    },
    {
        "author": "hall895",
        "review_date": "23 May 2006",
        "title": " The \"serious\" comic book movie",
        "rating": "7",
        "review": "No radioactive spider bites or guys turning green or supermodels painted blue here. Campy television series aside, Batman has always seemed the most serious, the most grounded, the most real of all the comic book sagas. Our hero has no magical, mystical superpowers...he's just a guy in a suit. But where does he get those wonderful toys? In this film Tim Burton does a very good job of bringing the Dark Knight to life while also seemingly giving the dark, foreboding city of Gotham a life of its own. Gotham is dark, gloomy, and dreary...almost oppressively so. The city is almost a character unto itself in the film...dark, mysterious and somehow quite real. The brilliantly conceived, stunning visuals are the perfect backdrop for the story which will unfold.The story follows our Caped Crusader in his quest to clean up Gotham which is in the midst of a frightening crime wave. There was much unnecessary angst when comic actor Michael Keaton landed the title role with fans feeling that was a sure sign the film would lean towards the campy style evident in the famous television series. Nothing could have been further from the truth. Batman would be a serious film (well, as serious as a comic book movie can be) and Keaton was perfect in the Bruce Wayne/Batman role. Keaton's Wayne comes across as an ordinary guy doing extraordinary things. Keaton brings all the required seriousness to the role but also can add a little comic touch when necessary. Inspired casting pays off big time.Good as he is Keaton is actually overshadowed in the film. Who else but Jack Nicholson could cause the actor playing Batman to get second billing in a movie titled Batman? Nicholson's performance as the Joker is simply terrific. Maybe a little over the top at times but, hey, it's the Joker...he's supposed to be over the top. Nicholson livens up every scene he's in, he simply owns the screen. With two terrific actors doing outstanding work bringing our hero and villain to life the film can hardly go wrong. It's certainly entertaining enough but the film as a whole doesn't quite match the brilliance of the two lead performances. The supporting cast, led by Kim Basinger as the requisite love interest, doesn't add much. Instead of leaving well enough alone with a fantastic Danny Elfman score the whole movie comes to a screeching halt a couple of times while we're forced to listen to some inane Prince songs. And the story just seems to lack a certain zest. We want to see the conflict between Batman and the Joker, these two great characters played by two great actors. And for too much of the film that conflict simply isn't there. But all in all, Batman is certainly a worthy effort. Some top-notch acting, stunning visuals and a story that does just enough to draw you in and hold your attention throughout. To call this film great might be a stretch but one could say it is very, very good. Certainly good enough to be worth your while."
    },
    {
        "author": "PhillipMichaelH",
        "review_date": "14 October 2011",
        "title": " A Hollywood classic.",
        "rating": "10",
        "review": "Released in 1989, Tim Burton's Batman holds up very well 22 years after its release and I actually prefer it over Christopher Nolan's re-entry, as interesting as his vision is. As for Joel Schumaker's stunning though at times silly vision of Batman, I try to forget about those films. Burton's first Batman is pure escapism in a sort of old fashion way. No CGI to be seen here and it works better that way. It's no surprise to me that Burton's Batman has been compared to Citizen Kane (1941) or The Maltese Falcon (1941), Burton and production designer Anton Furst take you into a dark world filled with crime and also mystery. Other films at the time such as Blade Runner (1982) and Brazil (1985) had already experimented with the classic film noir style, done in a sort of retro/futuristic way but Anton Furst's design for Gothem City truly feels like you are viewing a modern retelling of the classic noir films from the 40s.Sam Hamm's script is solid and while it has been the target for criticism, I feel that he did a nice job, his dialog is very witty at times and a little over the top but it's appropriate, particularly with Jack Napiar/ The Joker. The performances are actually quite impressive and even better then what Chris Nolan got out of his actors but that's just an opinion. Micheal Keaton, while controversial and unusual at the time, gives a really good performance, he is very shy and sensitive which is the Bruce Wayne that I respond to the most. Jack Nicholson really needs no analysis for his work here, he is just perfect that putting into words is pointless. His joker is fun and even believable, Jack is just as great of an actor as James Cagney in my mind. Kim Basinger is actually much better then she is given credit for, her and Keaton work well together. The rest of the cast really are supporting characters, some are familiar to the Batman story, some are new. One of them being Alexander Knox. Robert Wahl plays a very likable guy who the other characters have a hard time taking seriously. His eagerness to find Batman and win his Pulitzer prize is well done and is a very down to earth performance, which I guess is what the movie needed.As for Tim Burton's direction, he handles the actors very well and as for the technical work, I have mixed feelings about that. A lot of moments have really well choreographed camera work but there are a couple of zoom in shots that I felt were sloppy and a little unnecessary. There are a couple of matte painting shots that may not hold up as well today but none of this really matters, it still works. Of course, Danny Elfman's score left me speechless. He combines the fun, the adventurous and the dark side of Batman into one piece. I recommend buying the soundtrack with Elfman's score on it, it's amazing!! I think that Batman may be the best Hollywood movie of the late 80s and I still consider it a favorite from my childhood. I know that comic book purists prefer Nolan's Batman but as just a movie guy who loves old fashion Hollywood movies, this one appeals more to my taste. Batman deserves its comparison with Citizen Kane or any other Hollywood masterpiece as far as I'm concerned, even Casablanca (1942) or The Godfather (1972). Burton's 1992 sequel, Batman Returns is equally as great and even takes the series into a direction that's more complex and provoking which Joel Shumaker ignored. While Christopher Nolan's Batman films have stolen the popularity of Burton's, I would argue that his will go down in history as Hollywood classics."
    },
    {
        "author": "msegvic",
        "review_date": "21 July 2003",
        "title": " Burton`s masterpiece",
        "rating": "8",
        "review": "This is truly a Fantasy/Comic movie-masterpiece. First of all- the excellent cast- Jack Nicholson shines in the role of the manic and crazy Jocker. Nicholsons character is truly amazing- like a mixture of his former roles/characters in \"Chinatown\" (Jake Gittes), \"One Flew Over the Cuchoo`s Nest\" (Randle McMurphy), \"Prizzie` s honor\" (C.Partanna), \"the Witches of Eastwick\" (Daryl Van Horn) and of course \"The Shining\" (Jack Torrance)- but (the character) still keeps his own style. Michael Keaton also proves to be the ideal type for Burtons`s Batman. He reminds on the dark Batman from the \"Dark Knight\" Batman comics, and is the exact opposite of Batman introduced by Adam West in the 70`s. Second, Tim Burton created a unique athmosphere, exactly matching to the characters. Some people say that this movie is to dark, but I wouldn`t agree. I must not forget to mention the exciting Batman Theme composed by Danny Elfmann. Burton`s Batman, differnt from all the other Comic-hero movies, like Spiderman, Superman, Flash or Hulk, provides a refreshing character dimension.One of the best movies in the 80`s."
    },
    {
        "author": "iCrazyDavey",
        "review_date": "23 June 2005",
        "title": " Classic",
        "rating": "8",
        "review": "In 1989, Tim Burton created the very first Batman movie with great stars like Michael Keaton and Jack Nicholson. The Joker is definitely one of Hollywood's best villains on screen. Jack Nicholson was born for the role, with his psychotic and sick look. Michael Keaton is also great as Batman and is pretty good as Bruce Wayne. Kim Basinger is kind of annoying at times, but she's not the worst damsel in distress ever seen on screen.Tim Burton has a unique way of doing Batman, and I think most people can agree that it fits the characters and the story. To bad Warner Bros. got rid of him after the 2nd film."
    },
    {
        "author": "CuriosityKilledShawn",
        "review_date": "21 November 2000",
        "title": " Dark and Doomy",
        "rating": "8",
        "review": "If you were around in summer 1989 then you'll remember that Bat-fever was EV-ER-Y-WHERE! You couldn't look anywhere without seeing the Bat Logo in some incarnation. The film was a mega-hit. People were queueing up around the block for hours (the literal meaning of a blockbuster). The marketing team at Warner had to saturate the minds of the public with the big-screen coming of the Dark Knight. Up until this point the Batman series from the 1960s is how people regarded the Batman character and universe. Tim Burton corrected all that by giving us a dark, sinister and Gothic world with rich production design and a great score by Danny Elfman (who has made a career out of recycling the same old generic cues in nearly every movie he has scored). The original material is respected (to a degree), and the characters are deep instead of just campy.Michael Keaton is the best Bruce Wayne in my opinion. When he plays both Bruce Wayne and Batman you have to watch what he doesn't say and doesn't do. He's a rich, socio-phobic megalomaniac who has more money than sense. This is very different from Adam West's turtleneck playboy.Jack Nicholson is a great Joker too, not quite as intimidating or as iconic as Heath Ledger's take on the character, but still a role that has defined his career in a way. Nicholson's Joker isn't much more than an attention-seeking lunatic. But it's still nothing like Caesar Romero's campy, hopping-skipping-and-jumping villain.Anton Furst's Oscar-winning design of Gotham City is very original and unique, and is very much in the style of the Comic book. The smoke-blackened, cramped and claustrophobic 1920s buildings look and create a very oppressive atmosphere. This is definitely GOTHam City. Not LA like the TV series.They didn't even make any attempt with that show did they? In fact the Batcave in the TV series was like the set of a mad scientists lab from a 1950s movie. But the REAL Batcave in this movie is a monstrous cavern filled with stalagmites and it actually HAS bats in it. And there's no fireman's pole leading into it. With Christopher Nolan's reboot of the franchise currently the only Batman worth considering for most fans, it'd be a shame if you were to let this go ignored. It may not be as mature as Nolan's work but it has an edge that no other recent comic-book movie has.It's NOT an origin story. There's no 60 precious minutes on a build-up, it just goes straight to the action. Why can't more comic-book movies do this?"
    },
    {
        "author": "adamf613",
        "review_date": "12 August 2016",
        "title": " This is Batman",
        "rating": "10",
        "review": "I remember going to see this as a kid when it came to our local theater. It was a rainy overcast day which made it perfect to see this movie. We had picked up t shirts that had Batman on them. This has been my favorite movie for over 27 years and continues to exemplify Batman. The action and dialogue are amazing. The film noir look is amazing and despite Batman's limited motion during fights it is still amazing. Jack Nicholson is an amazing Joker. He is the definitive live action Joker. It was unusual to modify the origin so that a pre-joker killed Bruce's parents but it still works. Their have been many other Batman movies but nothing compares to this one."
    },
    {
        "author": "korben_dallas-2",
        "review_date": "19 August 2008",
        "title": " Batman(1989) vs Dark Knight(2008)",
        "rating": "10",
        "review": "After the recent press storm and domination at the box office of The Dark Knight I tried to get my head around comparing the two films. I'll be clear, I disregard films 3 and 4 of the original franchise,(ie. Val Kilmer and George Clooney as Batman), these were terrible films which pale next to Michael Keatons portrayal.Everyone went a little crazy about Heath Ledger's posthumous portrayal of the Joker, however now that I've seen the film, I really can't agree. He looks out of his depth and just doesn't carry it off. Jack Nicholson was born to play that role, he lives and breathes that part in his daily life, so all they had to do was add some makeup and a facial prosthetic to increase the size of that already huge grin and he was ready to go.To start with thats where the Burton films have an edge, beyond that there's Batman himself. Just like the Bond series, where there has been a reinvention and the casting of a young talent, Connery, for me and like many others, is the original and best Bond. The same goes for Batman, in terms of film adaptations, Keaton is the most versatile and adept at playing Bruce Wayne and Batman. For starters you just have to reference Beetlejuice and you'' see a screen stealing performance. Upon its release in 1989, Burton and Keaton, in that order, took Batman to a darker place in the conscious of the general non-comic reading public. Keatons Bruce Wayne, was shy, yet outspoken and slyly comedic at the same time. Current less observant Dark Knight fans will fail to notice this, as its something called depth, which current Batman(Christian Bale) only barely captures. As Batman, Keaton is hard and to the point with shades of Bruce coming through when he interacts. All Bale can muster is a silly lower and throaty voice. Given, the gadgets and cars have come along in technology, and thats great, we'd all love material that reacts to electricity and allows us to have a cape, which becomes a hand glider....but it doesn't hide some cinematic flaws.Before I draw a close on the bad points of the new film, I'd like to honourably mention Aaron Eckhart's portrayal of Harvey Dent. It was awfully scripted, and post burning of the face scene, where his injured eye is moving around like something from 'The Mummy', that was just hard to watch, after seeing a potentially great film, move into the 'good' category.The better points of the film are many, and in particular Michael Caine(as Alfred) and Morgan Freeman(as Lucius Fox). The original Alfred(Michael Gough), was excellent, but Caine produces some of the best one liners available. They really should have used more of him, as he brought the air of a master with him.I read a review which compared the Dark Knight with 'Empire Strikes Back', 'Jaws', 'The Godfather', that person, who was English, should really sit with the stereotype middle American, ie stupid. Those films are cinematic reference points, in breaking new ground. The Dark Knight really isn't, its on a bandwagon of the new action genre, ie the one that the Bourne series really brought into the mainstream.Both films are great, in many ways, but for me, the 1989 version is the winner."
    },
    {
        "author": "legendaryunderdog",
        "review_date": "12 May 2008",
        "title": " The Greatest Super-Hero Flick Ever......",
        "rating": "10",
        "review": "I must have watched this movie about a hundred thousand times in my childhood and it still is always as entertaining to me as it was when I was younger. Jack Nicholson's performance as the Joker is amazing, I couldn't believe how sadistic he made the infamous Joker character into. Michael Keaton (besides Adam West) is the real Batman to me, his Bruce Wayne character was excellent and he played the Dark Knight beautifully. Kim Basinger and Robert Wuhl played great supporters as Vicki Vale and Alexander Knox, the two reporters that are just dying to find out about the winged crusader. Tim Burton did an excellent job in portraying a dark, gloomy, Gotham City and he made the characters come to life and almost jump off the screen at you, great stuff by a great director. Burton has always had that Gothic approach in most of his movies and it fits beautifully here. I couldn't ask for any better of an action flick with a superstar cast than this. I would recommend this film to anyone who appreciates the Batman legacy and is always open to view the different interpretations that filmmakers and the like have had of the Dark Knight over the years. Great Stuff. 10 out of 10 stars no doubt!"
    },
    {
        "author": "Teh_Viewer",
        "review_date": "13 June 2007",
        "title": " Batman",
        "rating": "10",
        "review": "This is one of the best examples of comic book to film migration ever. Keaton and Nicholson appear as two sides of the same coin. Both characters struggle to cement their dominance over both Gotham City and Vicki Vale. Nicholson has some of the best lines of his career so far as The Joker, and Keaton turns in a performance as Bats/Bruce Wayne that other Batman actors should envy to this day. The Director, The Screenwriter, and the rest of the crew put together a film that stands alone, even 18 years later. Gotham City is brilliantly portrayed as a run down, industrial revolution burg, being torn apart at it's seems by corruption and crime. The best part of this film, for me anyway, are all the details. The supporting cast, the wardrobe, the sets, and the masterful shots, all paint a vivid and poignant picture of what an entire city at the end of it's rope could be. This is a film that get's better every time it's watched. It achieves what so few films do. It can be compared on the same playing field with the finest predecessors of it's franchise can produce. It's a classic."
    },
    {
        "author": "darktowerofnuri",
        "review_date": "28 March 2005",
        "title": " The First Two Batman Are The Last.",
        "rating": "10",
        "review": "When I saw this movie in the theater back in '89, I was just a kid - a kid paralyzed by the looks and the charisma of the super-hero ever! I didn't know much about directors those times, so I gave all the credit to Michael Keaton and Jack Nicholson. Years later I understood that Tim Burton -leading as my favorite director- was all behind this, making Gotham City darker and wicked, taking Batman to a fearsome -unlike that horrible TV show!- and heroic level as he should have been. As Michael Keaton was born to fulfill his destiny as Batman, I don't think anyone else could handle the Joker except Jack Nicholson. I have never seen any character more suitable than these pair of super actors as super heroes. I don't know whether I should be happy or sad for the first two movie was shot by Tim Burton, for the following ones was not as good as the ones shot by him. The third one was not as bad as the fourth. But the \"Batman and Robin\" was the final humiliation ever made to me (I really don't know what Joel Schumacher was thinking). I bet everyone involved in the first two was crying their eyes out at the end of the movie. Anyway, Tim, Michael, Jack and Kim was the best crew for a movie, and they made it worth watching it over and over again. \"Batman\" is amongst the best movies I've ever seen."
    },
    {
        "author": "EricVierthaler92",
        "review_date": "31 May 2009",
        "title": " The best Batman movie ever made!",
        "rating": "10",
        "review": "I have grew up watching this movie. It's simply brilliant. It's the best Batman movie ever made. Yes I'm brave enough to say it. It's better then The Dark Knight. It's better because of these reasons. 1. Batman's voice didn't sound like he was trying to be in a heavy metal band in this movie. 2. The Batmobile was better and more suitable for a Batmobile rather then a tank. 3. the music score! I mean when you hear Danny Elfman's theme to this you instantly think of Batman! The music in this was brilliant! 4.The hole idea that it was the joker who killed batman's parents then batman goes after revenge. 5.this felt more like a batman movie and the dark knight felt like a spy movie. And I can go on. I'm not saying the dark knight was a bad movie I thought it was good but I just like this movie better. Tim Burton did an awesome job with this! Jach Nicholson was great as the Joker. I liked how dark this movie was. Very good movie. You can never get tired of it no matter how many times you see it."
    },
    {
        "author": "Climinator",
        "review_date": "2 February 2013",
        "title": " Two hours of comic book fun",
        "rating": "10",
        "review": "Firstly may I just state that 'Batman' is one of those films where Batman isn't really the star. The star character is in fact the Joker played to brilliance by Jack Nicholson. However seeing as Batman himself didn't have that much of a back-story back then, its no wonder. All the character had for a well enough established origin was 'parents were murdered in a back alley' (the graphic novel 'Year One' only hit shelves like one year before the films release). So its no wonder why the Joker almost steals the entire film. Having said that Michael Keaton does make an excellent Bruce Wayne/Batman depicting a man constantly in turmoil between identities. The plot line initially seems rather basic good vs evil. However after watching it time and time again it actually gets more intriguing. Particularly with how Joker rises to the top of Gotham's criminal empire to further his plot. If you want a Batman story thats still dark but more grittier then watch Nolan's interpretations. They're every bit as enjoyable as this and vice versa. But if you want to watch a Batman that's grim in a graphic novel way this is it."
    },
    {
        "author": "Ziya90",
        "review_date": "15 February 2010",
        "title": " Keaton, Nicholson, Burton",
        "rating": "10",
        "review": "Burton opens Batman with a scene which recalls The original animation series (also the scene Batman stands on a high-rise building), so you almost get that you won't be disappointed, because it is a signal that the director is 'conscious'. On the rooftop, two muggers and The Dark Knight. The atmosphere? Misty, dreadful, unsafe and mysterious places that thrill you, the mobsters seesaw between being colorful and being dark etc. However, this is not a shallow or childish adaptation. Yes, may be to compare Burton's Batman movies with Nolan's Batman movies are wrong, but I want to say a few things. Nolan's Batman movies were fundamental reconstructions, but they were very conventional on all counts. Tim Burton's Batman movies are not, those movies are peculiar. By the way, I am one of the people who say that the best Batman was Michael Keaton. Nolan is interested in ideas, Burton is interested in details. If you have seen The Dark Knight, remember Two-Face's screen time for example or Joker character was not highlighted. Tim Burton's characters are interpreted in great detail, with their actions, accessories (my favorite is the dentures), costumes (the best Batman costume is here), personalities etc. Plus the story telling (as said for example, the tone of the movie is very similar with the animation series or comic book) Jack Nicholson deserves all the titles as Joker. A superhuman performance. I would not just say that Jack Nicholson is pretty good as Joker. The scenes he appears are riot of colors, I love this. By the way, Tim Burton shows us the personality of Joker by only one scene, the goodbye talking when he visits Vicki Vale in her house. By the way, in the final, we hear a mysterious and sad sound and the commissioner's face when he finds out. That scene effected me when I watched it for the first time, I was almost a child. After Nicholson, to play Joker would be unthinkable, but Heath Ledger did it that happens once in a blue moon. Watching this new Joker was very amusing, interesting and Heath Ledger's acting was like Daniel Day Lewis style, excellent, but my favorite Joker is always Jack Nicholson. By the way, I don't want to compare Nicholson with Ledger, but want to say that Burton's Joker is much more active than Nolan's Joker. Burton's Joker does many crazy and very interesting things. He kills a mafia boss in a funny and also very sad way, he reshapes hundreds of photos, paints the restaurant (this scene deserves being put in the cinema anthology) Jack Nicholson's Joker is teaser, acute minded, so he leads Batman on a merry chase. Thus, Batman Joker encounter does not become disappointing. You care about what will happen, because you want Joker to be caught, on the other side, may be because of your sympathy for Nicholson or for his Joker character (he has an accident, he losses his magnetism, so you cannot dislike him exactly), you don't want him to be caught or dead. While I was watching the movie for the first time, years years ago, I pleased every time, when Joker dodges Batman. May be it is because you know that if Joker is caught or killed, the movie ends. Action scenes are may be less and mild, but great, so we get that Burton is good at making action scenes too. I love the restaurant scene, the chase scene comes next and the scenes which Batplane arises are great too."
    },
    {
        "author": "MasterMegid",
        "review_date": "12 May 2009",
        "title": " \"I Want You To Tell All Your Friends About Me...I'm Batman!\"",
        "rating": "10",
        "review": "For many, the superhero film craze began with, Superman: The Movie. But not for me. I was not yet born when Superman flew into theaters. So for my own part it all began in 1989, with the release of Batman. Fortunately not titled, Batman: The Movie.As you can imagine, I saw the movie when I was a kid and loved it. I still enjoy it today, but on a much deeper level that can only come from age. And while it may not be of the caliber of, \"The Dark Knight\" few comic book films are or ever will reach that kind of perfection. And besides in the late 80's Hollywood was not yet making pictures of that magnitude. Before you, reader, roll your eyes, and think great another \"Dark Knighter\", I assure you I will not compare the two films, and after this paragraph, I shall mention TDK no more.Now, I would like to talk about the plot, cast, score, and all the other things that make this a great film. And still memorable some 20 years later. Sam Hamm and Warren Skaaren, while not without it's flaws is quite good. And the film is largely based on Alan Moore and Brian Bolland's 1988, Batman masterpiece: \"Batman: The Killing Joke\". This film really nails the spirit of the of the world of Batman.(I am a huge Batman fan, can't you tell?\"-MM-) And the sets and direction and lighting all combine to make for a very convincing Gotham City. Some much work, from so many talented people went into creating this world, I am flabbergasted to think about it.The cast is almost perfect. Michael Keaton, before this known best as a comedic actor, plays the brooding Bruce Wayne excellently. And somehow manages to out do that as the caped crusader. I mean he managed to wear a silly rubber suit and come off as one terrifying badass. And Jack Nicholson, proves what a talented actor he is with his dark and disturbing portrayal as The Clown Prince Of Crime, AKA, The Joker, Batman's greatest foe. Even the supporting cast is good. Kim Basinger as the classic 1940's Batman love interest Vicki Vale. And in a surprising choice we have Mr. Lando Calrissian himself as Harvey Dent, the once and future villain Two-Face. And that is only scratching the surface of the cast.The score, courtesy of Danny Elfman, fit's the film very well. In my humble opinion, it is one of his best. The music of Prince is interesting if a little strange. Overall, Batman has to be one of my favorite superhero films. Even now after so many more be unleashed upon the world. If you are a Batman fan or a fan of good films in general you could do worse than watch Batman."
    },
    {
        "author": "davidrulesyou",
        "review_date": "3 March 2009",
        "title": " The first true Batman",
        "rating": "10",
        "review": "Although I am not really a Tim Burton fan, I have been dying to watch his 1989 take on the Dark Knight. After seeing it, I enjoyed it.I thought Michael Keaton did an excellent job portraying Batman/Bruce Wayne and Jack Nicholson portraying the Joker. One scene I like is when one of the crooks was being held up by Batman said: \"Who are you?\" and Batman says: \"I'm Batman.\" I do have to agree that it is a serious comic book movie, very faithful to the original comic books.I also consider this movie to be the first \"official\" Batman movie because it was not only the first released by Warner Bros., but the first based off the source material (although there was a Batman movie back in 1966, that was actually based off the TV series of the 1960s.)It's also a little bit of a shame Tim Burton is now doing a take on my favourite children's book Alice in Wonderland, because Disney will be releasing it and I like their 1951 animated cartoon version, although the movie did screw up the book.I thought some of the action scenes were great, like Batman getting chased by the Joker's goons and Batman fighting against the Joker. For any fan of Batman, this is an essential movie to watch. As a fan myself, I rate it 10 out of 10. I'll be watching the sequel Batman Returns (also directed by Tim Burton and starring Michael Keaton as Batman) and I'll comment on that."
    },
    {
        "author": "eddieyankovic",
        "review_date": "3 August 2008",
        "title": " The Best Batman. Period.",
        "rating": "10",
        "review": "Before Joel Schumacher got his hands on the franchise, Tim Burton directed this tour de force of cinematic brilliance. Try though I may, I have not one criticism of this movie. Tim brought his now trademark darkness to the film, and used it well. The best part of this film is, without doubt, Jack Nickelson's Joker. While he may not have the physical stature that most would picture when the hear the name \"Joker\", he more than made up for this in his character. Anyone who saw Heath Ledger's portrayal of The Joker and thought it was superior to Jack Nickelson's, you are, quite simply, incorrect. This is without doubt the best Batman film thus far. Period. To those of you who have not seen this film, I implore you to go out and rent it. Now. To those of you who have seen it already, go out and rent it again. Now."
    },
    {
        "author": "darkpatriot85",
        "review_date": "24 May 2006",
        "title": " A Hero Reborn",
        "rating": "10",
        "review": "This was one of the first movies I wore out when VHS tapes were still the only outlet. The tape wore out so bad I had to buy it again to keep watching it. When you're five years old men dressed in suits and a cape will fascinate you, when you're twenty it still fascinates you.Michael Keaton makes the perfect Batman. You knew in the beginning when he said \"I'm Batman\" you knew this wasn't the campy T.V. show, it was the real deal.Jack Nicholson's portrayal of the most dangerous Batman villain was terrifying. The gigantic smile still gives me the creeps even as a twenty year old. His purple suit is straight out of the comics and even the lethal tricks he does are the same as the comics.Tim Burton's version gives the Dark Knight the treatment he deserved for years. The way he told the story made it look like it could be placed in real life. I have no idea how his mind works or what he sees in his sleep, but I like it. Batman will live on forever."
    },
    {
        "author": "davidslicer",
        "review_date": "30 September 2004",
        "title": " The best of the series,and the darkest. Until \"Batman Begins\".",
        "rating": "10",
        "review": "Around the time \"Beetlejuice\" was released in theaters,I was reading \"Starlog Magazine\". It was announced that they were going to film a \"Batman\" movie.The last time I remembered seeing \"Batman\" was from the 70s-the early 80s.The show was campy and really dumb to watch and the comics seemed to be more darker than the television series.At that time,the \"Superman\" films were dying,thanks to \"Superman III\" and \"Superman IV:The Quest for Peace\".It was hard for me to accept that a film like \"Batman\" was coming to the big screen.My only thought was how corny it was going to be.Almost a year later,I realized that I was wrong.\"Batman\" works on all forms.It is a wonderful film which captures the darkness and the imagination of what I did not expect from the film.Tim Burton directs the film with such glee that I was having a good time just by looking at the film.The casting for \"Batman\" is appropriately well made for the screen.The art direction and costume design are given a 1940s noir style and the cinematography gives \"Batman\" a comic book look to the film.Michael Keaton is fierce as Bruce Wayne/Batman and Jack Nicholson is gruesomely hilarious as The Joker.\"Batman\" is a dark film with fantastic special effects with a totally different look that had me feeling that I was being part of the movie.\"Batman\" is a film that is fun to watch."
    }
]