[
    {
        "author": "janmanuel2",
        "review_date": "21 October 2018",
        "title": " I liked it at first.",
        "rating": "5",
        "review": "I am between a 5 and a 6 on this. It was vastly overrated by the professional reviewers. I am sure their reviews were politically motivated. I loved the cast but I agree that characters were superficial and not defined as they should have been. I also feel more humor was needed in the movie. This can't compare to other Marvel movies. It's a one shot deal for us. We don't need to hear any more preaching."
    },
    {
        "author": "seanmartin-97794",
        "review_date": "18 February 2018",
        "title": " Overrated and overhyped",
        "rating": "1",
        "review": "I went to see Black Panther along with my friends, and following the hype train we were excited to see it. However, following the showing we were all dissapointed by a mess of a movie with little plot and little thought which only served as a pit stop for infinity war.The critics have vastly overrated this movie due to its groundbreaking cast, but the movie itself is not at all groundbreaking. Littered with all the boring Marvel clichés I have come to know and hate, such as their inability to kill off any hero's to add gravitas to their story, or the one dimensional villain who only exists for one movie so you know they will kill him off before the next, Black panther is also plagued by new problems no one but me seemed to notice. For example, the CGI was awful in the action scenes: whenever someone was even prodded, they would go flying across the screen in the most outlandish fashion, and the plot was torn straight out of the Lion King, as well as having the biggest waste of Martin Freeman since those Vodafone adverts.Overall, I believe my dissapointment for this movie is fuelled by the marvel cinematic universe, as I feel sick of the movies they are pumping out like an industrial machine, as they all feel the same with little originality. I can only hope the bubble will burst sometime soon, and bring back true standalone movies which don't need a cinematic universe."
    },
    {
        "author": "Crim-",
        "review_date": "28 January 2019",
        "title": " Utterly shambolic",
        "rating": "1",
        "review": "Having attempted to watch this once before and failed, I tried again due to its nod at the Oscars thinking maybe I hadn't given it a fair chance.It really was a disappointment end to end, bar some of the visuals it was certainly one of the worst Marvel films I've seen, and I think it's fair to say none of which were Oscar worthy in the best picture category (other categories maybe). It's a big shame that other genuine brilliant movies would have missed out on their chance of an award due to this.If it's taught me anything, it's that the Oscars are no longer relevant and should be ignored. Perhaps also many of the major film review sites as the ratings must be artificial, hopefully that gets exposed at some point as it would be questionable ethically if not also false advertising..."
    },
    {
        "author": "anthonycciancio",
        "review_date": "18 March 2018",
        "title": " Disappointing",
        "rating": "2",
        "review": "This was supposed to be the newest and best Marvel movie. It was also supposed to be deeper than a super hero movie. Well, basically all they did was put African-Americans in the role of the main characters and followed the same exact formula of every other Marvel movie ever created. The action was mediocre at best. The villain was good, but at the point when he truly started to flesh out his character, I was bored and realized I was watching a movie. I literally said what was going to happen about 30 minutes before it happened. Now if you like super hero films, which I happen to not, I am sure you will have fun and enjoy this film. But, in my opinion this movie had th intensity of a haircut and was a boring commercial to sell toys."
    },
    {
        "author": "c-murray631",
        "review_date": "15 February 2018",
        "title": " Over-hyped - Not enough effort put into core aspects of a film",
        "rating": "1",
        "review": "With all the hype surrounding this movie (excellent trailers, Kendrick-curated soundtrack, all-African cast) I thought I was in for something special with Black Panther, as while they aren't remotely the highest quality movies, the Marvel cinematic universe movies are generally pretty entertaining. As it turns out I was wrong, Black Panther was extremely average, I have no idea what these critics/review bots are talking about when they say that it is the best Marvel movie and worthy of \"critical\" praise (as not just a super hero movie but as a movie in general.)Things that I liked:\n<ul><li>Effort put into aesthetic authenticity of the African elements of the movie - within the Marvel universe the look and feel of the movie was unique and you can tell care was taken in this regard.</li><li>Andy Serkis - My favorite character by far, was probably the only person who didnt seem like he was reading from a script sheet and got some genuine laughs out of me.</li></ul>Things that I didn't like:\n<ul><li>The story was extremely predictable and to be honest I don't know if the most virtuous resolution was reached in the climax. Michael B Jordan's character had fairly reasonable intentions for wanting to kill the Black Panther and take his place in Wakanda as he had been abandoned, with seemingly no family, to live in the ghettos of Oakland. However, his whole plan to give advanced Wakandan weaponry to every African person in the world so they could kill and overthrow people in power who weren't African was extremely \"on-the-chin\" in terms of its narrative motivations within the current climate. It wasn't remotely clever or nuanced and really unbalanced his character, his motivations were understandable but his plan was moronic. Additionally, who didn't see Black Panther surviving his fall? Who didn't see the Gorilla tribe coming to the rescue at the end? The entire movie was so bland and predictable I wanted it to be over well before the end - I didn't even stay for the post credit scenes...</li><li>The acting was very wooden - Not a lot to say here really, some really poor line delivery from the cast across the board except for Andy Serkis. No one was particularly charismatic, the main character for instance was extremely boring.</li><li>The script was very robotic - This ties into the poor acting, but perhaps as a result of the script, some of the actors never really had a chance to bring their characters to life.</li><li>The characters - I have already addressed the mess that was Michael B Jordan's character Warmonger(?). Basically throughout the entire movie you never really learn anything or see anything of the Black Panther's character, he basically moves from one place to another showing no emotion and just either smashes things or asks people questions. Apparently the character is supposed to be very intelligent, while it was probably a narrative choice, the Black Panther in this movie seemed like an emotionless Jarhead whose only really characteristic was that he get nervous around his girlfriend... The women in this movie had a bit of attitude and charisma and shouldn't be blanketed down with the Black Panther and Warmonger as bad characters, but they didnt really get a chance to shine and really only contributed a few one liners and a bit of fighting.</li><li>The action - Shaky-cam rubbish, the action in the movie is terrible and not remotely on the level of the well-choreographed fighting in say Captain America Winter Soldier - please for the love of god show someone getting punched or kicked without having to cut the shot 5 times. There is an action sequence at the start which basically flagposted what the action was going to be like, it is shot at night and you basically cant see bloody anything...</li><li>The CGI - Honestly, the CGI in Black Panther felt extrmely overused and was surprisingly quite bad. It really took me out of some scenes because the environments and effects looked average (not quite Justice League bad but not far off). It is obvious in scenes in Wakanda, for instance, where the plains/mountains are in the background but they are clearly filming in front of a green screen. Some of the effects just looked silly and got laughs out of me and my party. I personally though the Rhinos were stupid...</li><li>The Soundtrack - After all the hype surrounding Kendrick Lamar curating a soundtrack for the movie, the tracks from that album barely feature at all. They faintly play from some cars and stuff here and there and a couple feature in some action scenes but I though we would be watching some decent action scenes with some bass heavy Kendrick blasting along to the fighting. Alas, no dice. The orchestral score is also quite average, coming in strong at weird moments and being quite out of place in certain places, there are a couple of moments where it seems like some sort of fairy, Harry Potter, Narnia music that just doesn't fit the scene.</li></ul>Overall I think this is probably one of the weaker Marvel movies, avoiding honest criticism because of the hype surrounding it. The basic components of the film are all poor-average, with the only real 5+/10 aspect being the aesthetics of Wakanda and its people. Like I said above, I wanted to leave well before it was over because I knew the action was probably not going to improve from nauseating shaky-cam and I knew how it was all going to play out."
    },
    {
        "author": "Vlad_Pasichenko",
        "review_date": "5 February 2019",
        "title": " Nominee",
        "rating": "3",
        "review": "If this movie will win Oscar, it will show again how prejudice and politician is Oscar now"
    },
    {
        "author": "peteski53-987-645179",
        "review_date": "26 January 2019",
        "title": " Way, Way Over Hyped",
        "rating": "1",
        "review": "Story was underwhelming at best. Felt really boring and not very creative. Dialects were extremely hard to understand...film actually needed english subtitles, which would have been ridiculous.\nThis just goes to show what a joke the members voting on films for the Oscars are. I would like my 2+ hours wasted back from watching this in the theater, I couldn't wait for the movie to be over with....it's a rental at best and should never be a best picture nominee."
    },
    {
        "author": "danielbastone",
        "review_date": "13 April 2018",
        "title": " Disappointed, Over Rated, Didn't like it",
        "rating": "2",
        "review": "People made this film up to be the best marvel film of all time, some of the cgi in this film was ATROCIOUS, sound track was mixed and horrible, and the concept of the film was over all stupid.\"so like we have this resource called vibranium, it never runs out and it fuels our entire society\"it wasn't worth going to the theater to see african tribal people spear fighting over popcorn. The only reason it has 2 stars is because it had a connection to the rest of the marvel universe which is well established, and filmography wasn't bad. but of course filmography is good, its a MARVEL movie"
    },
    {
        "author": "IronManu77",
        "review_date": "14 January 2019",
        "title": " Overrated, dull and boring. Waste of time.",
        "rating": "1",
        "review": "This is a movie you will like watching it the first time because everyone else is jumping on the band wagon. Many months later, your subconscious tells you this movie was completely overrated and a complete and utter waste of time. Watch it once, but it lacks the charm of other Marvel movies."
    },
    {
        "author": "dubwize",
        "review_date": "18 February 2018",
        "title": " What is this garbage?",
        "rating": "1",
        "review": "Sadly I had big expectations for Black Panther as a HUGE fan of Black Lightning TV show, I was looking forward to this release only to be dismayed.At best it is a movie made with 90% green screen sequences but in reality it is a discombobulated mash of garbage that takes way too long to develop any story whatsoever and that storyline is as thin and weak as a nightclub whiskey, left stale overnight and re-poured.The hype is over-rated and the movie is ultimately disappointing. May appeal to Millenials who exist without a functioning braincell."
    },
    {
        "author": "generationofswine",
        "review_date": "18 February 2018",
        "title": " An Honest Review",
        "rating": "1",
        "review": "I guess, because of the hype, I was expecting \"the best Marvel movie ever,\" or at least \"the best Marvel movie if the year.\"I pray to God and Stan Lee that this isn't the best Marvel Movie of 2018.The fact is, there are maybe 3 laughs in the entire film. Three moments where you smile. Three moments where you crack a grin and they all come exclusively from Letitia Wright.And it wasn't because there were jokes and they didn't land. It was really because the movie took itself far too seriously. Like Winter Soldier and Civil War it had a message to tell...but unlike the Captain American movies, it thought its message was so serious that it couldn't laugh even at itself.I think, honestly, it even forgot it was a Marvel movie. In fact at time I think that the director, crew, and cast all thought that they were making \"Roots\" meets the new \"A Birth of a Nation\"And Martin Freedman, yeah I think he was only there to prove that he could do a better American accent than his Sherlock counterpart. Maybe it was a bet, which part of the cast of Sherlock can hold an American accent throughout an entire film?And, honestly I am disappointed, because ALL three grins in the film went to Letitia Wright and Martin Freeman has some fairly decent comedic timing...they just didn't let it show. At least not for Freeman or ANYONE ELSE.Honestly, I'm surprised they even let Letitia Wright makes us smile or entertain us an any way.Honestly, it felt a lot like I was watching a college lecture...but a college lecture for a class that has a mandatory attendance policy and a professor that ONLY teaches from the book that he himself wrote...you get that kind of overly-serious pretentious feel to it.And...really, how often do people have to tell other people who they are in this movie? That really happened far too often and not in the \"Bond, James Bond\" way but in the \"If I tell you who I am it's going to give me extra power\" kind of way.And in the end you get two fight scenes by a waterfall that weren't very inspired and failed in comparison to other MCU fights. You get a car chase that was again...uninspired and fell flat but this time in the \"we've seen this before only done better\" kind of way. And a climatic battle that felt a little like the Gungan/Battle Droid battle in The Phantom Menace only with better CGI and an uninspired fight between the two powers rather than the Jedi dual.At least Winter Soldier and Civil War allowed us to laugh and relax a bit during the more serious MCU fair. At least they pulled out the stops when it came to action and, despite the message...tried to deliver something, anything.All this gave us was, well, a lecture and one where the action seemed, well, it seemed like the cast and crew felt they were obligated to give us that and thus did it with disdain.. It felt like all involved thought that entertainment would take away from the preaching.And really, have a message....just please entertain me. I work hard. I already went to school. What I want for the price of admission is to be entertained.If you can't do that, if you only let Letitia Wright make me smile and then only three times in a super hero movie that doesn't wow with action...then you've failed.In fact, you've failed so much that you aren't \"the first Black super-hero movie\" I'm taking that pilfered title and giving it back to Blade...because at least Blade was entertaining."
    },
    {
        "author": "morrisfotograf",
        "review_date": "8 March 2018",
        "title": " Wow! They forgot to give characters value... again...",
        "rating": "1",
        "review": "Seriously - WHY does Hollywood think that film lovers do NOT want characters to have a value? Both old and young people want to fall in love with the characters in movies - or the opposite for antagonists. In this movie they spend maybe 30 seconds building up the characters, if even that. They just assume that we will have feelings to any character who pops up in the movie - BUT WE DON'T. If anyone fights, almost dies and in the end dies anyways we just do not care since we do not get to know the person. Forrest Whitaker acts is but off yet you do not care if he dies... WHO is he, tell us something about him before please (!).Same thing goes for the rest. Seriously, a movie with 99% effects and 1% emotions is NOT a good balance.AND WHY ARE ALL CHARACTERS 100% STEREOTYPE??PS. They killed off the one character who did a good job acting:ANDY SERKIS, we all love you bro! Hope that you somehow come back in the next Marvel shajt-movie."
    },
    {
        "author": "marcximus1122",
        "review_date": "4 May 2018",
        "title": " You're kidding me right?",
        "rating": "1",
        "review": "I outright laughed at the beginning of the movie, Lion King meets Wonder Woman...lol. HIDDEN GIANT CITY with mass transit system in the sky, flying ships, and people who gather on steep rocks to watch a fight. I mean the entire concept is ridiculous. \nThe CGI is mediocre and disappointing. The actors were HORRIBLE...whoever wrote the lines to this pile of crap should be run out of hollywood. \nWHO the hell said this was the BEST Marvel film ever????\nKept falling asleep as well due to lack of action and horrible dialogue. \n2 hours of my busy life ill never get back."
    },
    {
        "author": "boynyc",
        "review_date": "18 March 2018",
        "title": " Overrated movie",
        "rating": "1",
        "review": "This movie was just way too overrated. The fighting was not professional and in slow motion. I was expecting more from a 200 million budget movie. The little sister of T.Challa was just trying too hard to be funny. The story was really dumb as well. Don't watch this movie if you are going because others say its great unless you are a Black Panther fan or Marvels fan."
    },
    {
        "author": "ajj_sin",
        "review_date": "1 March 2018",
        "title": " Why are there so many positive reviews of this movie ?",
        "rating": "4",
        "review": "I watched the movie last night. I have not written a review for a long time but i just wanted to help out my friends here who might be misguided by all the positive reviews here. I love all Marvel movies, they are not Oscar winners but my expectation is to be entertained and the most important ingredients have been\n<ul><li>Literally \"out of this world\" action!</li><li>Outstanding effects</li><li>Well placed humor ( one liners and all - Best example Thor - Ragnarok) </li><li>Overall entertainment</li></ul>This movie fails on all this. Its a dragged storyline, banal dialogues e.g. a fight scene, someone seems to be hurt and the dialogues go like \"Hw are youuuu\" \"I am good, and you\" \"I am good too\" \"Let's go\". Taken straight from a \"Learn English conversation in 5 minutes\" Chapter IOkay special effects, nothing special,lets say 20 percent of normal Marvel extravaganzas.The story line is weak and goes round and round and round...No menacing bad guy. The potentially menacing one had a lesser role to play.Very stupid and misplaced one liners, completely out of the blues some of them. All in all; i am giving it a 4 , but it could be 5 or 6 if expectations are lowered but it is certainly not the Marvel that we know."
    },
    {
        "author": "jon-147-171809",
        "review_date": "16 March 2018",
        "title": " All this hype, and for that?",
        "rating": "1",
        "review": "Not in the mood to write a huge review. Bottom line, it's just another superhero regurgitation - nothing new or special about it. No character buildup - just a bunch of senseless fighting and meaningless story line.I'm pretty sure that they paid like 25000 people to vote this a 10/10 - there is no way that many people actually like it that much. This is a flop."
    },
    {
        "author": "adamww-71263",
        "review_date": "4 May 2018",
        "title": " Garbage",
        "rating": "1",
        "review": "Shame I can't rate this 0/10.Movie could of been good if not for some people clearly pushing a political opinion but in the end everything was awful, the timing of the jokes, no expression or any kind of physical comedy when saying the jokes, everything was just awful.Could of tried to make it a little bit less obvious that is movie isn't really about the movie at all lol.I was excited for this, but honestly, worst film I've watched in a long time. Hatchet was better and that was a mere time killer and awful at the same time. I wouldn't even watch this again if I was in a hospital bed, rather be in silence and doing nothing."
    },
    {
        "author": "paul_marston",
        "review_date": "15 February 2018",
        "title": " Marvel's Last Jedi - RIP stand alone superhero movies",
        "rating": "2",
        "review": "If I were able to post a one or two word review, it would either be agenda or uncanny valley. Everything I feared this film would do, it did. Indeed in a couple of places it even referred to the (*spoilers*?) the slave trade! Seriously? In the 21st century you are going to refer at least twice in the same film to the slave trade - which BTW if you follow the film's premise would NOT have affected Wakanda as they were cut off from the rest of the world!The main character of the film is T'Chala - a character so depressingly dour and serious, he could be a candidate for depression. You have his younger sister - who is CLEARLY being geared up as effectively riri from the comics - she WILL be the replacement for Tony Stark! To best describe her, she is a light hearted Q from thee James Bond films - I liked her, she was fun, lively, bright, as a character a real find.Andy Serkis was excellent, but far too underused - Michael B Jordan's \"big bad\"? I understand the anger, I don't get his ultimate goal - makes NO sense. The female bodyguards were the nearest thing to Mary sues in the movie. Really - beating up men TWICE their size with the SAME military background?I MUST discuss the CGI. This is a MASSIVE problem.Sure Wakanda looks spectacular, but so did Asgard. It's the motion of the main characters that is the problem. It seems that whilst they can get stationary objects (buildings etc) virtually spot on now, the same can NOT be said for dynamic ones. If you have watched any of the trailers, you'll know what I mean when you see Black Panther do his somersault The dynamic CGI characters look crystal clear, whilst the real life objects have a faint blur to them. You can just see where the live action starts and the CGI ends. If the cars were CGI as well you wouldn't notice the difference so much, but it IS there, and because it seems 90% of this film is CGI, in the end it becomes very annoying.as for the claim that this is unlike any other Marvel film - I beg to differ - unless you refer to how insular the whole film is, as it is based almost entirely in Wakanda. Which could be acceptable, until you realise most of the action took place outside of wakanda - in the remaining 5-10% of the film!Winter Soldier was CONSIDERABLY better than this. Guardians was better and more fun! Avengers had greater scope.Ragnarok was funnier.I know EXACTLY who this film was geared for, and it was NOT for your typical Marvel comic book movie fan. it had good points, The tech wiz sis has major potential, Wakanda looked spectacular (if you ignore the poor water animations (the ripples in the water looked cut and paste, watch MOANA for how water can be animated!) The soundtrack bore no relation to the action (action scenes sounded the same as the quiet moments!). But the worst \"crime\" was the agenda it pushed. There is NO Excuse for this, as they PROVED they can have strong storyline in Winter soldier.So if you want a film with a dour dreary lead character, lots of uncanny valley moments, and LOTS AND LOTS OF POLITICAL GRANDSTANDING with no payoff, then this is the film for you!Just remember The Godfather / Goodfellas / Star Wars / Schindler's List all barely broke 90%, yet THIS is supposed to be 100%! If you don't think the ratings for this are agenda driven, I've got a bridge to sell you!I do NOT want a Black Panther 2 - I think the days of single super hero movies are done"
    },
    {
        "author": "jodyfidelis",
        "review_date": "17 February 2018",
        "title": " Wait for Netflix! Extremely Overhyped! Don't Waste your Time or Money!",
        "rating": "2",
        "review": "I took my nephew to see this today, expecting a wonderful memorable film. Instead, it was dull and full of cliches - a stale rehash. I feel that the critics are afraid to tell the truth about this film because it certainly does not deserve a 98% rating on RT. It's sad that our society cannot be honest about ratings due to fear of ostracization. Usually Marvel heroes use humor to charm the audience, but the Black Panther uses old, worn out cliched formulas. Although it's not a terrible film ,it is certainly not deserving of anything over 50%. There were too many negative racial overtones, and I believe Marvel/Disney need to keep their political ideologies out of the moves. THe visuals were good, but the story line got lost."
    },
    {
        "author": "stangpt-72073",
        "review_date": "16 February 2018",
        "title": " Most undeservingly overhyped movie of all time??",
        "rating": "1",
        "review": "Subpar to say the least. Political partisanship has now cemented its ugly head into almost every movie being delivered for mass consumption. Most moviegoers such as myself take in a flick to escape today's overt political nonsense and everybody's got an agenda world we live in........even if only for a couple hours. Forget about it. Not going to happen. For me there is so much effort to preach (as that's what it is) a particular political viewpoint that it totally interferes with story and character development. Because of this I found Black Panther almost unbearable and struggled to make it to the end. Besides that, technically the CGI was wayyyy off and character development severely compromised. Just awful. Possibly the most undeservingly overhyped movie of all time."
    },
    {
        "author": "paul_s_hills",
        "review_date": "16 February 2018",
        "title": " Don't Believe the Hype",
        "rating": "4",
        "review": "After the excellent.....and hilarious.....Thor 3, I was rather looking forward to this. Positive reviews had also whetted the appetite. Perhaps it was the expectation that undermined the enjoyment?The genre is a little hard to quantify, but it reminded a lot of Wonder Woman. Except, instead of the WW2 setting, we had a kind of Bond-style thriller instead, complete with ridiculous gadgets and under-developed baddies.The film looks great (some dodgy CGI aside) - I liked the armour, weaponry and cultural aesthetics. I also felt a lot of the performances were quite compelling. Unfortunately, it is all rather dull. And doesn't feature anything we haven't seen before. What is most disappointing, is that it doesn't seem to tie into the Marvel continuity at all (apart from the unremarkable Everett Ross, who appeared from nowhere in Civil War and is a poor attempt to replace Agent Coulson). Like Wonder Woman, this is simply a \"Black Panther tale\" and you can take it or leave it when embarking on your next Marvel marathon.I also found the advanced technology to be completely over the top. Weapons and armour, I can understand. Miracle healing and Panther suits concealed within necklace teeth is VERY hard to swallow indeed. Vibranium was an indestructible Alien metal that could absorb sound. Fair enough. Great material for weapons and armour. But spaceships and miracle healing? Really? Couldn't we have toned it down just a little?I was bored. My friend was bored. After his wonderful debut in Civil War, this was a bit of a wasted opportunity."
    },
    {
        "author": "davewilco84-109-601118",
        "review_date": "4 May 2018",
        "title": " Thank god i am not alone in hating this rubbish",
        "rating": "1",
        "review": "I was a bit wary to write a bad review about this nonsense film as I felt I ought to, it was that bad. I was expecting racist accusations if I openly condemned it, as it's full of messages. Thank god I am not alone in hating this rubbish. Black Panther my arse. worst Marvel film ever. Dont bother!"
    },
    {
        "author": "edgalarza",
        "review_date": "21 February 2018",
        "title": " Good comic book movie, but professional critics overrated it",
        "rating": "7",
        "review": "My spidey BS sensors went off on high alert during the days before this film was released to theaters. The news and entertainment media began praising the movie, over and over and over. A 97% Rotten Tomatoes score was quoted often before the film had been released to general audiences. A really good film doesn't need to be praised by the entertainment community when it really is good. Word of mouth among general audiences will ramp up interest in the film. So I went to the theater to see for myself. My spidey senses were right. The professional critics overhyped this film exactly like they did The Last Jedi. Very likely for political reasons which really damages the credibility of review sites everytime they overhype a movie they want to push on to the public.The film isn't extraordinary, but it isn't bad either. It does have high production value, much like any blockbuster sci-fi movie. To me, the film has a little bit of \"Revenge of the Sith\" (2005), a bit of James Bond 007, some John Carter (2012) and some Deadpool (2016). The African tribal council of Wakanda with the futuristic cityscape in the background was very reminiscent of the Jedi council on Coruscant in the Revenge of the Sith. T'Challa's sister has a little bit of \"Q\" from the bond films. She's the one with the laboratory filled with gadgets and Panther supersuits. Angela Bassett is like the tribe's matriarch Bond's \"M\" character in this film. The futuristic city and many of the flying crafts have a lot of similarities to the John Carter film of a few years ago. And the CGI fighting acrobatics over a car chase resembled the ones in Deadpool. The great battle during the climax near the end of the film resembles a war scene between two armies in Game of Thrones. There is no denying this film has great visuals. More importantly I really feel the costume designer for this film deserves an Oscar for best costume designer. I absolutely loved all of the costumes in this film. The costumes were both African tribal and futuristic. It reminded me of Stargate Sci Fi films with their Egyption but futuristic costumes.\nWhere I thought the film fell short was in character development and the screenplay. The actors weren't given a wide range of emotions to display. Most of the characters are either emotionally very stern and stoic, or angry. I felt the lack of variety in emotions got in the way of making the characters more human and approachable. Michael Jordan's American accent and demeanor sticks out like a sore thumb in a cast of well spoken and articulate african character. But physically, Jordan physique does look incredibly badass and tough in the film -- so that's a plus. I'm still wondering if the skin bumps on his torso were CGI or prosthetics.What I didn't like was the infighting between the tribes and the blame game with western cultures. The film depicts a technically advanced society but with backward tribal strifes between each other. It just seem contradictory, but that's just my opinion. I do look forward to a sequel. But I hope the sequel has an external villain were the nation of Wakanda join together to fight a common enemy instead of more infighting between tribes. Next time, make a solid story first, then build the special effects around it instead of the other way around."
    },
    {
        "author": "rodhackenflasch",
        "review_date": "14 February 2018",
        "title": " An Exercise In Nonsense",
        "rating": "2",
        "review": "This thing is being over-hyped to the max. The narrative is promising at the outset, but fails miserably as it deteriorates into the absurd, and then continues to drip like Chinese water torture from the poorly written screenplay. The acting was mostly amateurish with the exception of Forest Whitaker, who seemed out of his element, but the screenplay could very well be the culprit here. The entire production was a laughable exercise in nonsense, and the CGI was worse."
    },
    {
        "author": "davidrowntree-05460",
        "review_date": "16 February 2018",
        "title": " Lion King meets Coming to America, the Non Action Marvel Film",
        "rating": "1",
        "review": "Such great hype,imagery and effects, loved the trailers. Pity that every action scene is in the trailer, and the rest is just lame story lines, about the prince from somewanda (Wakanda). I kept waiting for Eddie Murphy to walk out and crack jokes. It has the prince and queen and staged like Eddies film and same \"set like\" feel for the royal ascension. The constant drums in the soundtrack felt like The Lion King. \nI would have walked out, but I paid Gold Class and wanted to finish my snacks. \nProbably some great social underlying story, but when the bad guy \"wanted to see the sunset\", I struggled not to laugh out loud.\nBitterly Disapointing, worst Marvel film ever. (And I even enjoyed Wonder Woman, and Justice League)"
    }
]