[
    {
        "author": "devs_17",
        "review_date": "10 August 2007",
        "title": " MY views on CHak De India",
        "rating": "10",
        "review": "In plain and simple words, I loved CDI. Heck, even if you take SRK out of it, I would still love it! This movie is about a man trying to prove his dedication and love for his sport, his people, and his country. This is about a man scorned by the nation, shunned by his close ones, and his redemption in the way he knows best. Its this main underlying theme that makes CDI special. This theme is so universal, and so identifiable, that your heart connects instantly.CDI is about Indian sportswomen coming to the forefront, about the stark and grim realities staring at our national sport, and the reasons behind that. It is about unity in diversity, strength in weakness, and putting the team above oneself. Its about the sacrifices one has to make in order to achieve his goals. Its about the success of true sporting spirit! Its real, yet entertaining. Its patriotic without being jingoistic. Its international, yet soaked in Indianness. Its a collage of the different states of India, and the difficult but fruitful formation of this collage.I have never played or watched or been interested in hockey! But this movie does not need that to touch your heart. All it needs is some patriotism, humility and goodness in your heart. If thats in abundance, I am sure you will love it.As for the performances, I would just say the entire team rocks. the keyword here is TEAM, as thats what this film is all about! Enjoy !"
    },
    {
        "author": "die_Heuchler",
        "review_date": "9 August 2007",
        "title": " Lots of goosebumps, adrenaline rush and hot Segarika Ghatge",
        "rating": "10",
        "review": "What's in a name? Although initially this movie drew some amount of controversy outside India among viewers of non-Indian origin, the final movie just falsifies all those who advocated that the title \"Chak De! India\" was non-representative and was supposed to mean to only a niche of moviegoers. This movie would've been just what it is no matter what is was called or which country made it. Director Shimit Amin's entry in YRF simply transforms the entire perspective of movie-making and movie watching, both for the production house and the viewers.Generally, you enter the theatre for a Yashraj movie expecting foreign locales, lots of song and dance, impossible and unbelievable characters, poor storyline, bad performances and a helluva investment but this movie delivers what no other Yashraj film ever did. Initially a sports movie, Chak De is rather a story of hope, courage, unity, integrity and the dreams. This film finally proves that you don't need Preity or Rani opposite SRK, and he all by himself, with a great screenwriter, great director and a good cast of the hockey team can make a great movie. There are lots of heroes in the movie - the women's team and these ladies simply steal the show. Mainly Bindiya, Balbir, Priya (the hot chic) and Komal.See it gets very hard when there is an incredible amount of character development to do. There is a ghost that follows Kabir throughout the film and writer Jaideep Sahani makes a very good use of it. I do admit the fact that he's watched an incredible amount of Hollywood sports flick to develop this script, but he adds his very homely formulas and successfully manages to retain this film as an original Indian movie. Some parts of the film are directly lifted like the part of Kabir's ghost and few of the women, but all in all I refuse to say this is a Hollywood copy.All in all, this is the best summer Hindi movie I've watched so far, not because it's got SRK but I love the script, the witty one-liners where sometimes with double meanings, every girl with her story (but I feel at most points the characters don't fully grow), well coordinated game sequences (though the practise scenes may bore you because there are a LOT), and above all the message the film delivers - when united, there's nothing you can't win over. The message is pretty well conveyed. You feel the adrenaline rush through the World Cup matches, a lot of goosebumps thanks to the great scoring by the Salim Sulaiman duo, well crafted script and good direction. Shimit's work is original contrary to the reservations I carried for him being a product of Ram Gopal Verma's school of direction.SRK, as usual is great with his acting (and beard,) Vidya Malvade is the overly publicised captain but unfortunately other girls outdo her, the Jharkhand girls provide a dimension against contrasting Bindya and her queen bees. Segarika Ghatge's character Priya Saberwal is most memorable for her looks, style and for being hot and everything. The North East girls do answer some of vital questions of the North East Indians about their existence in their country as foreigners. The class conflict, egoistic chicks and their attitude problem and stuffs are absolutely well portrayed in the film.All in all a well worth. Requires basic knowledge and enthusiasm in hockey. But avoid if you're looking for SRK as the lover-boy - he's the tough coach."
    },
    {
        "author": "hsm2310",
        "review_date": "11 August 2007",
        "title": " Bollywood's First of its kind.......Perfection Personified",
        "rating": "8",
        "review": "Aha..Finally Bollywood has a full fledged sports movie.This one is certainly worth a watch for every movie lover.This is a very well made movie with nothing unnecessary being added.Being an SRK fan I love to see him in all sorts of roles but these are the ones which bring the real actor out of him, Swades being another example.Role of a coach is perfectly portrayed by SRK.He is the most energetic actor around and he has put it all into it.The story of this movie moves very subtly and augments the excitement every next second.For a country like India with its national game as hockey this movie was long due.Finally, when it has arrived,it hasn't disappointed.It has also indirectly displayed the crippled Indian sports system which needs much improvement.Lets hope concerned people learn something from it.This movie can really do wonders for the next generation of aspiring hockey players.CDI is entertaining,insightful,inspiring and yet very simple which is its greatness.This movie succeeds in bringing out tears and giggles and also lets the adrenaline flow in full pace.The cinematography and editing are equally good.They succeeded in capturing each moment with its complete emotion.The director has treated the subject extremely well and has brought 100% from all the new actors.The character selection was spot on too. SRK and all others rocked!!!! All in all 10/10. Nothing less for this one!"
    },
    {
        "author": "ashishgautam87",
        "review_date": "11 August 2007",
        "title": " well done Shahrukh!!!!!!!",
        "rating": "8",
        "review": "As Shahrukh khan is trying do work in different type of movies than he has done till now(mostly romantic) he makes an attempt at the sports genre and delivers yet another brilliant performance.The story is of the Indian women hockey team which because of its poor performance and lack of sponsors is unable to find a good coach.Kabir Khan (Shahrukh Khan ) a former national hockey team player steps in to take the responsibility of the new coach .The rest of the movie shows how he takes Indian women hockey team to a new hight and how he regains his lost dignity The plot of the movie is linear and predictable without any twist or surprises, in fact it is quality of direction and acting by Shahrukh khan ( well supported by the rest of the cast),which sucks you in the movie and does not let you get bored. Music of the movie is good including the title song which is quite inspirational.It has to be said that good level of effort has been put into every part of the movie whether it is casting or hockey(matches)choreography (which is acceptable).Although the winning streak of the team at the world cup may seem to an extent unrealistic but overall Chak De India can be said as an entertaining and inspirational movie and is a must watch for every Shah Rukh Khan fan and critic for his brilliant performance."
    },
    {
        "author": "VirginiaK_NYC",
        "review_date": "10 August 2007",
        "title": " A full cup, a nice surprise from SRK & YRF",
        "rating": "8",
        "review": "Having originally planned to both not see Chak De and also to hate it, I went to see the first show and I now love it very much!!Two nights ago I saw Kal Ho Naa Ho for the 100th time. I found it beautiful, as always, but also realized it never makes me want to cry. Chak De!, on the other hand, is relatively \"plain\" to look at, and understated (at least for Bollywood), and I felt that wonderful emotional brimming-up-but-not-quite-over time and again throughout the story.The whole thing about this team of girls from all over India who have to be made into a team really works - you get to know enough about several girls to have a secure sense of the essence of each -- the one with the bad temper, the one whose husband wants her to come home and cook, the senior player who resents the new coach's control, the ones who are out for themselves -- and the problem each presents in relation to SRK's task of making a team out of a collection of individuals Of course this is any coach's job, but I like the moral resonance with the sad back-story of Shah Rukh Khan's character. Kabir Khan, like the real Indian player on whom the story is based, is an Indian Muslim. He was unjustly accused of throwing a match to Pakistan, and lost his career. A team where all have the identity \"India\" is an actual team; implicitly I think a country with the identity \"India\" doesn't engage in persecutory projection and hatred toward a member perceived as \"other.\"A note about the photography, I like the use of a dusty tone for the first half of the movie, and then a much brighter color skin for the second half, when we leave India and practice fields and go to Australia. The girls' exposure to the bigness and luxury of the west was handled so nicely - we're given their pleasure in all that's new to their eyes--giant swimming pools, exercise machinery, lavish hotel buffets -- but in passing: the Bollywood Visual Excess machine is not in operation, and the shed has several locks on the door. At some official function, we get to see them all in saris and a bit of makeup, but here too it's all under control, they're all dressed alike and half of them hate it.Shah Rukh is great. There is no sentimentality in the movie and his character is restrained. The music -- no \"songs\" -- is varied and good -- if I could do without the rap music (for life!!), I loved the Sufi refrain that turns up over and over, that seems to express SRK's character's anguish in separation, longing for reunion (with God).I've always felt that sadness was quite nearby for Shah Rukh -- here he neither conceals nor dramatizes it, he just lets us feel it. On a more mundane note, though I love Shah Rukh in all his Karan-Johar-selected beautiful clothes, I found it relaxing to see him in a small number of normal coach's costumes, shirts, khakis, and blazers that appropriately looked bought off the racks in Macy's.The movie really never hits a wrong note. It's also just wonderful in its feminist position. Generally speaking I feel just boredom and agitation at movie violence; in this one, when the girls beat up boys who'd been harassing them, I felt joy."
    },
    {
        "author": "to_mea",
        "review_date": "12 July 2007",
        "title": " Saw this movie in a premier- Well Worth the Watch",
        "rating": "10",
        "review": "When I first saw the first previews I thought it looked horrible, but after a while I saw the second promo and it looked so good. Then after there was a special screening with the director, so I got a special chance to see it, and all I have to say is that this one of my favorite movies of all time. Everything in the movie was very well handled, I loved everyone in the movie but shah rukh khan was freaking awesome, i love shahrukh khan with all my heart, hes so great in every movie, and the director was so amazing, after this movie i so thanked him for making this movie, this movie is one of ask ing, reminds me of the aamir khan movie lagaan, its well wordy everyones watch, this movie definitely should get an Oscar, the music was so splendid, i hope you guys love the music, and everything about this movie was very nice. This is a lot better then most shahrukh khan movies I watch, and this has to be one if finest performances ever, thank u shahrukh Khan for staying in bollywood you truly are the best actor ever!"
    },
    {
        "author": "movie_freak_dubai",
        "review_date": "9 August 2007",
        "title": " Very enjoyable movie with an excellent ensemble cast",
        "rating": "8",
        "review": "I have always loved good melodramatic underdog sports movies such as Remember the Titans,Invincible etc and now we have the bollywood version with Chak De India.Hats off to the production team and the director for coming out with a fresh and very high quality product with excellently filmed hockey scenes that are quite realistic. I loved the wonderful cast of unknown girls who make up the Indian national women's hockey team. All of them had a part to play and they played them beautifully while executing some rigorous hockey action. They were excellent and gave wonderfully natural performances that should shame some of the already established actresses. Special mention should be given to the actress playing Bindya Naik. My favourite was the actress who played the spirited but pint sized forward from Haryana, she was really cute and funny in a tomboyish sort of way.Shahrukh Khan was excellent in this movie..... his best performance since Swades in my opinion as he played against type. Had some wonderful moments with the girls and drew lots of cheers and laughs from the audience. If the movie succeeds then a lot of the credit has to go the King khan's crowd pulling power.If this film succeeds and I sincerely hope it does, I think Amin (director) and Yashraj films are going to start a whole new trend a la DDLJ with a whole slew of sports related movies coming from Bollywood. I am sure cricket will be next on the agenda.A thoroughly enjoyable ride....go watch it.P.S. - some interesting trailers shown as well Laga Chunari Main Daag, Aaja Nachle and Goal (the Indian bend it like beckham maybe?)"
    },
    {
        "author": "salilgoyal",
        "review_date": "10 August 2007",
        "title": " Predictable Yet Great",
        "rating": "9",
        "review": "Bollywood finally Manages to Pull out a Wonderful Sports Movie and After some upsets, Yash Raj Production comes with a brilliant film (Though they have nothing to do with it (Except the money).. Real stars are indeed the hockey players, SRK and the director Shimit Amin).Movie starts seven years back when Shahrukh Khan is accused of Match fixing in a hockey world cup final. After seven years, he returns to coach a hopeless Women hockey team. The rest of the movie deals with his journey to glory of the National team..The things that stands out for me are.. the Team. Talented actresses gathered from all over the country have done a wonderful job. Acting was top class. Shahrukh Khan have played a character that suits his age and does seriously well. Hockey sequences are great and do give a feel of an international tournament. A nice blend of funny and amazingly inspiring dialogs adds to the brilliance.However, the movie has its share of shortcomings. Most of the times, movie successfully manages to overshadow the predictable nature of the story, but the ending sequence was absolutely the same what i thought of before the movie started. We all knew what would happen in the end, but a bit of fine tuning would have made this film a masterpiece.Anyways, 'Chak de India' is not just a brave attempt. It goes beyond that tag. It's a wonderful and a courageous attempt. A movie that manages to match the brilliance of Jo Jeeta Wahi Sikander."
    },
    {
        "author": "rar_ind",
        "review_date": "13 August 2007",
        "title": " Best of 2007!",
        "rating": "10",
        "review": "We have seen a lot of underdog sports movies over the years which have been inspirational,cinematic and realistic...chak de India follows the realistic genre..... the film is very predictable in most parts but what makes the film memorable is the performance of the actors,screenplay,direction and also the background score...its a patriotic movie which depicts the story of women's hockey in India,the difficulty faced by the coach in uniting a diverse team and finally make them successful...srk pulls of a fantastic performance without his signature songs and dance...he has silenced all his critics with this performance....amin deserves a perfect 10 for direction which makes him the director to look out in the future....bgm is great throughout the movie...finally all those young girls deserve a standing ovation for their respective roles(most of them are débutante's) My verdict: a must watch...best of 2007"
    },
    {
        "author": "dsoumya",
        "review_date": "11 August 2007",
        "title": " SRK + Girl Power",
        "rating": "7",
        "review": "It is so refreshing to see an actor as good as ShahRukh Khan, being given a good role. Here he is stripped from all the gloss and sheen and most of the unnecessary melodrama and the final result is surprisingly entertaining! The story is really simple and there are not really very many surprises in the plot but you really don't care. ShahRukh shows again how much he can entertain given a chance and the director gives him the space to do so. The girls who make up the team he is coaching are really delightful and the time spent developing their stories was time well spent. The director could have eased of a little bit on patriotism where it was not directly relevant, but it doesn't really mar the whole experience.Overall a fun experience! You will not even notice the absence of many songs!"
    },
    {
        "author": "sid_rich",
        "review_date": "15 August 2012",
        "title": " I can count 11 Topics that were addressed in this Movie!!!",
        "rating": "9",
        "review": "I had taken my entire office to see this film, wanted them to observe and learn team-work and team management. I saw this movie again on TV today as a part of our Independence Day celebrations.This movie very brilliantly addresses so many interesting and thought-provoking topics like --- 1. States Vs The Nation. 2. Cricket Vs all other sports in India. 3. Problem of Muslims in India. 4. Career-Woman Vs Family. 5. Men-sports Vs Women-Sports. 6. How players are treated from smaller towns and states. 7. How north-eastern states are treated as 'tourists' in other states. 8. Women harassment in the streets of India. 9. Team spirit and team management techniques. 10.Hockey as a sport. 11.PatriotismAm so happy to see an Indian film made so well and with so much of honesty and efforts in detail. The makers of this film have surprisingly dished-out a near-perfect movie. They should be real proud of such works.I had seen this movie twice in 2 different cinema theaters in Mumbai, and both theaters cater to vastly different sections of our society, and this movie got the same exact treatment from both the crowds. There were whistles and loud cheers in almost every scene of the 2nd half."
    },
    {
        "author": "ammarshaikh1005",
        "review_date": "18 January 2014",
        "title": " Srk at his best....!!",
        "rating": "9",
        "review": "Shahrukh Khan formally known for his romance genre.Raised a few eyebrow's when he signed this one directed by the Critically acclaimed director Shimit Amin. the movie starts with the disgrace of a Former Hockey player Kabir khan on missing out his winning stroke..and years later he arrives years later to earn his respect by taking the women's hockey team to win the world cup..a lot movies have been made on sports in Bollywood but only few have left their mark while other have disappeared in wind..Chak De India tops that list the emotional content is so high that few scenes might wanna let you choke inside.Shahrukh gets into the skin like anything playing the character with ease and making you believe his intensity..Chak De is all time winner for Srk"
    },
    {
        "author": "namashi_1",
        "review_date": "10 January 2009",
        "title": " Chak De India is a masterpiece! SRK Rules!",
        "rating": "10",
        "review": "Shimit Amin's 'Chak De India' is easily one of the best films ever made in the history of Indian Cinema. Why? A fantastic script, which holds your attention from start to end, coupled with natural performances and bloody good dialogs. Chak De India proved to be a huge success at the box office internationally, and it deserved every bit of it. I love this film, I've seen like 4-5 times already. Chak De India is cinema at its very best! Performances: I am a fan of Shahrukh Khan. His performance is astounding. He swiped all the awards for the best actor category, and yes those awards were meant to come on his kitty. SRK Rules! The actresses who the portray the roles of the girls in the hockey team are great. But the ones who truly stand out are: Vidya Malvade, Shilpa Shukla, Chitrashi Rawat. Anjan Shrivastav is sincere.on the whole 'Chak De! India' is cinema at its very best. I love this film. Two Thumbs Up!"
    },
    {
        "author": "Peter_Young",
        "review_date": "27 January 2012",
        "title": " A superior sports film, brilliantly led by Mr. Khan",
        "rating": "9",
        "review": "Chak De India is without a doubt a one-of-a-kind Hindi film, one that you'd hardly ever expect to see in Indian cinema, and one that is at par with any great foreign production. It is an exceptional sports film, more because there's much more to it than just a series of games, and you never care about the fact that the ending is easy to predict. Shimit Amin, who previously directed Ab Tak Chapphan, directs the film with great skill, care, and feeling for the subject. Jaideep Sahni is responsible for the fantastic script, and that's where we get an original example of expert storytelling.This is the story of Kabir Khan, once a hockey star and a captain of the Indian team. Seven years ago, he was accused of treason in favour of Pakistan because he missed a crucial penalty against them. Being a Muslim and being good sport about it did the job and, branded a traitor, Kabir left his ancestral home in shame. We know nothing about what he's been through in these seven years, but we do know that he's got a new chance to prove his innocence when he comes back as the coach of the Indian woman's field hockey team. A chance as crucial as this damned penalty stroke.The second half is much stronger than the first (not that this one's bad), but that's the case with most sports films as the most enjoyable sequences are often in later portions, when the matches finally take place. And well, it is just full of suspense, tension, and even though I could easily predict the ending, the script and direction were good enough to keep me on the edge of my seat and give me quite a few goosebumps throughout it. In fact several moments throughout the matches were so exhilarating and overwhelming that I found myself jumping up off my seat with sheer joy.Technically the film is superb. The cinematography is amazing, with the camera moving intelligently to focus the viewer's attention on the proceedings. The film is efficiently edited, and the background score more than contributes to the film, building tension where necessary, and making everything so much more captivating. The title track, \"Chak De India\" is really a treat. It is patriotic, joyful, and very well used in the film. That the film's songs atypically play only over montage sequences, as opposed to the traditional style of song and dance, is certainly a great plus.Shahrukh Khan is tremendous. This is one of his most restrained performances, yet his charismatic presence is as evident as ever. He is perfectly natural and controlled in a most nuanced portrayal that never fails to convey the inner pain, the frustration, the hope and the quiet determination to clear his name and finally make a place in the sun. The supporting cast is roundly good, and the girls are great as a group. Shilpa Shukla enjoys the meatiest part, an assertive girl driven by ego and jealousy, and she is excellent. Sagarika Ghatge and Vidya Malvade are pretty and convincing.Chak De India can be described as patriotic, feminist, but for me it's more than anything about willpower and the importance of hard and collaborative work. It teaches and reaffirms that what really makes such games work--and for that matter, many other things in life--is lots of training, patience, and team work, without which nothing would quite click. According to me the best Hindi film of 2007; a thrilling and inspiring cinematic experience which is worth many a repeat viewing for more than one reason. Take a bow, Mr. Amin, Mr. Sahni, Mr. Khan, and all of you, twelve brave cuties."
    },
    {
        "author": "shahabkalim-1",
        "review_date": "10 August 2007",
        "title": " United They Stood",
        "rating": "10",
        "review": "Making a sports based movie in my opinion is a very tricky affair because of two things.Firsty,99% of the sports based films have the same conclusion,i.e David winning over a Goliath ,which the audience knows from the very beginning and Secondly, no matter how much tipsy topsy turvy the screenplay is,the climax scene is where the minnows and the audience rejoice ,exception being Rocky I ,which is one of the best motion pictures ever produced in my opinion.Be it The Longest Yard,Bend It Like Beckahm,Major League,Angels in the Outfield or our very own Lagaan ,Iqbal ,they all have the same thing. A bunch of not so good team-mates end up winning the world.So in short,when it comes to sporty flicks, we all know everything,yet we watch it and enjoy the every bit of it.Chak De India , is good but not great.Yet I believe it couldn't have been better.Confused?So am I.The theme is good, the performances are good, the direction is good,but you know what, the sport called Hockey looks dull (which in reality it isn't).The movie starts of well,but one doesn't feel the excitement(in the matches) which one noticed, when say, Kachra of Lagaan got a Hattrick or when Charlie Sheen did it for The Indians in Major League.Hockey doesn't look good on the big screen but Shah Rukh Khan and Bindya Naik(dunno her name) make this movie work. I think the coach and the rebellion plot and then the Mcdonald scenes were terrific. Shah Rukh as Kabir Khan is solid and the girls give him ample support.Dialogues are very good but I wish this movie was 15 mins shorter.And they could have used the title track more often.Don't expect it to be another Mughal E Azam,but it ain't gonna be a dud either because those who were coming out of theatre looked positive.United they stood,and they won the match,but sadly we are a nation which still believes in a Bhuvan hitting a six off the last ball and not a chick goalie saving a scorching shot so may be that's y I still consider Aamir Khan's Awwal Number as a fantastic movie.7 OUT OF 10Go enjoy Chak de India and Fcuk de box-office"
    },
    {
        "author": "biman-tripathy",
        "review_date": "8 March 2011",
        "title": " Never expected such a movie from Indian film industry, and such a response from Indian audience",
        "rating": "10",
        "review": "Felt like sharing my experience of watching this movie some 4 years ago...One fine day none of my friends were in mood to attend college. So we all decided to bunk college and visited nearby theater. Most of my friends suggested to go for Chak De India, while I joined their oppositions who wanted to watch some Hollywood movie (don't remember what that movie was).Few reasons for which I thought this movie was not worth a watch:1)This movie is based on Indian sports... and not every movie is \"Lagaan\" (if you haven't seen Lagaan, that should be your next target).2)This movie is based on Hockey (the 'dying' National Sports), while Lagaan is based on Cricket (the second most Important thing in India after Religion).3)This movie is based on 'Women's Hockey'!...dude, never in Indian history any movie was made based on women sports (just ignore Bend It Like Bekham... it wasn't an Indian Movie).4)The movie is starring Shahrukh Khan - the best 'commercial' actor, while Lagaan is starring Aamir Khan - Mr Perfectionist. OK. I accept. I HAD NEVER BEEN SO WRONG ABOUT A MOVIE BEFORE (forget movie, I had never been so wrong about anything before).Within the first 10 minutes, I was both mentally and emotionally connected with 'Kabir Khan'- played by Shahrukh Khan. I laughed, I cried, I clapped. Every person in the theater respected the National Anthem by standing up, when it was played in a scene in the movie...damn man I felt so patriotic. This indeed is the best performance by Shahruk Khan. I stopped criticizing him after this. I cannot forget his expressions after the final match...and the background song- Maula mere le le meri jaan (meaning- O lord, take away my life). Every time I see that scene, I try my best to hide my tears...just like I feel every time I see the climax of 'October Sky'.Well, I thank my friends with whom I was arguing in the beginning. Hats off to the creators of this movie - for bringing back my hope in Hindi movies.\"Watch It AND Get Inspired\" - CHAK DE!"
    },
    {
        "author": "kapil_chandana",
        "review_date": "9 April 2014",
        "title": " Simple life, simple times",
        "rating": "8",
        "review": "I was there when it released. To be honest, I was expecting a good film with expected Hindi film touches but it turned out surprisingly even better experience. I loved the fact there was no need to add a romantic sub-plot involving SRK, since a typical Hindi movie is considered incomplete without the lead actor falling in love.It is a simple story told skillfully by Shimit Amin and Jaideep Saini with SRK's one of the most memorable performances. Among the girls, 3-4 girls get most of the attention. I wish we had been told more about the other girls like Gul Iqbal but then such compromises have to be made to keep the film's length in check. The hockey matches are filmed very well without any sensationalisation. There is no hate or jingoism. At the end, you walk home with a feeling of triumph, the triumph of an underdog."
    },
    {
        "author": "eh5963-297-967354",
        "review_date": "9 April 2012",
        "title": " Subtle, yet powerful. A must watch!",
        "rating": "9",
        "review": "How often do we get a very simple story that makes the biggest impact possible? How often does a dull colorless looking film put a huge smile on your face by the end of the screening? You don't see much of that in Hindi cinema. Chak De does not preach, it does not bore, in fact it's just telling you a story with one sequence or another the viewer can relate to.Kabir Khan, once a caption of the Indian hockey team is accused of match fixing due to a leaked picture of a casual handshake between him and the Pakistani Captain. One circumstance leads to another, having Kabir fired and out of the team. Not only is Kabir fired but also heavily criticized and labeled as a traitor.Years later, Kabir returns to hockey. Not to play, but to coach a group of young girls from various states. Then starts Kabir's journey to lead his team to victory and regain his lost respect. As they say, the journey is more important than reaching the destination. Chak De is one tough journey of a coach and his group of girls who don't even know how to play as a team.Chak De talks about a good number of issues that we all see in our everyday lives. However, it's not the talk of the issues that win you over but it's how subtly the writer points it all out.Let's analyze: Chak De talks about India's national sport - No, not cricket. Very few know that field hockey was known as India's national sport in which we have received Olympic honors decades ago. Since the cricket wave hit, Indians forgot about their national sport.Chak De talks about the role of women in our country. Normally seen as housewives, Indian woman in sports is frowned upon. Chak De mentions that in scenes when a player talks to Kabir about her husband. Or when the girls are rejected permission to go to the tournament.Finally, Chak De is basically about playing for your country over anything else. Whether your Punjabi, Gujrati, Tamil, Bengali or Bihari - It's about I-N-D-I-A. As mentioned in a striking scene in the initial reels.there are so many remarkable scenes in the movie. To name a couple, the McDonalds scene is genius. Of Course the climax is electrifying.The writing is flawless. Screenplay glues you. The dialogues are touching, fresh and not a tad bit cheesy. Bravo Jaideep Sahni! Salim-Suleman's music is underrated. The title song and Maula mere are bout gems. Background score is amazing.Shimmit Amin's direction is top notch. It was his second film after a thrilling Ab Tak Chappan. Hard to believe? All girls are natural. Some are hockey players in real life and some are in reel life. They all play their parts flawlessly. Especially the one's that play Balbir, Komal, Vidiya, Alia and Preeti, respectively.Shah Rukh Khan is the heart and soul of Chak De India. Every expression, dialogue, mannerism, smile, cry, it's flawless. He carries Chak De all the way. A subtle act that speaks so loudly about the man's talent. One of his best performances. (Says a lot since he's got a great resume of performances) Aplaudworthy! Overall - Chak De is poetic, controversial and nothing short of a classic."
    },
    {
        "author": "denizen_blank",
        "review_date": "11 August 2007",
        "title": " Awesome!",
        "rating": "10",
        "review": "This movie is 1000% formulaic, but the formula works perfectly! The girls are super cute, fresh, spunky, and--what I haven't seen in a long time--exhibit all different kinds of Indian 'looks' (as opposed to every single one of them looking like Kareena with their hair and skin bleached). These girls have a really natural charm, and actually represent their states. I don't know when the last time was I saw a girl on the screen who actually looked South Indian. Great acting all around, lots of chemistry between the characters, and SRK is the perfect actor to play a stern-yet-sensitive leader who gives ridiculous pep talks. This role plays to his strength and avoids his weaknesses (the vibrating crying face is down to a minimum). If you want to see a really fun, energetic, rah-rah-India film, this one's paisa vasool for sure. The only thing is that it represents the Indian public as really nasty and disloyal to its athletes. I'm not sure if that's realistic, but it's kind of an unpleasant part of the film. The girl who plays Komal Chauta is beyond cute! I would love to see more foul-talking, short-haired baby faces on the Indian screen."
    },
    {
        "author": "suman_rbr",
        "review_date": "11 August 2007",
        "title": " One the best sports movie made in India",
        "rating": "8",
        "review": "Great Movie......I can say that simply go and watch it specially girls.....The story of the film is about a typical underdog winning the game. The aspect of coach seeking redemption by making his team win added lot of grip to the story. What makes this film different is extraordinary script writing and superb direction. Screenplay is just perfect. The entire film is realistic barring certain episodes demanding creative freedom. The writer avoided the board's politics aspect in the storyline, in order to focus on establishing each and every character of player well and then show how they change their attitude to become team players. The following scenes are defining moments of the film -Shahrukh Khan did the role of a brilliant coach whose respect is battered by the misconception and the media. He is exceptional as an inspiring and tough coach. The actor in Shahrukh dominates the star in this film. It is nice to see Shahrukh Khan doing purposeful films like Swadesh and Chak De India once in a while. The girls who played the women hockey team are exceptionally good. The girls who did the roles of Preeti, Balbir and Komal dominate the scene.Cinematography is amazing. Music is good. The background music is peppy and suits the theme. Dialogues are very good. Editing is nice. It is nice to see Yashraj Films producing a purposeful film like this instead of box-office winning inspired popcorn entertainers.The entire first half is concentrated on establishing all the characters in Hockey team and then inculcating the sense of belongingness among the team members. The second half is more entertaining with nice twists and engaging games. The plus points of the film are writing (Jaideep Sahni), performances (Shahrukh Khan), direction (Shimit Amin) and Cinematography (Sudeep Chatarjee). It is a sensible and a brilliant film with soul. On a whole, Chak De India (along with Lagaan and Iqbal) is one the best sports based films ever made in India. A must watch for everybody!!"
    },
    {
        "author": "haiderpx",
        "review_date": "12 August 2007",
        "title": " If you're gonna see 1 movie this summer see Chak De India.",
        "rating": "10",
        "review": "If you're gonna see two movies this summer, see \"Chak De India\" twice.Yes it's that good. It's the perfect blend of thriller - comedy - drama. I have to agree with one of the other reviews, that Shah Rukh Khan was great. But so was everything else in the movie. The girls were hilarious. SRK's style and acting both were different - adapting well to fit the role. I have to repeat, the girls were hilarious and acted well as well. I especially loved the Haryana girl. And of course the Punjabi girl. And the Chandigarh girl. And .. well.. I could go on and on. Each one outdid the other in their respective roles.It was good to see a movie this good in a long time."
    },
    {
        "author": "sauravadutta",
        "review_date": "12 August 2007",
        "title": " Slick Editing ,great professionalism and u don't need to be an SRK fan to watch the movie",
        "rating": "9",
        "review": "Well this is One movie that every Indian will be Proud to see and i don't find any reason for which it wont get critical acclaim across the world...though everyone knows whats gonna be the fate of the underdogs but its movies we r talking about and no one would go to the theatre to watch the home team losing .... and that too in a movie...........first of all the first 15 minutes of the film are tear-jerking ,,,, they actually set the mood of the movie and fills u with patriotism.....the humor used in the movie is top notch ......and the main credit goes to the editor....i heard it in the news that the reels used to make chak de were numbered to be around 1600 which is just 300 to 400 for a normal bolly movie so the editor must have had nightmares editing this movie ,...but god what a job he has done.....an error less movie......that will take Ur breath away.........after haqeeqat swades lagaan and rang de basanti this is the movie that makes u proud to be an Indian......and what a way to show it.........thru shahrukh khan......but i may not consider him as the main lead though i am a die hard fan of SRK......the ones who steal the show are the 16 girls from diff states .......oops i mean India............yea .....one country no states.......these girls have done a tremendous job........and such professionalism by the whole crew of the movie ...its just so touching.........well i just cant say more.......u must watch this movie if u really love u country....be it India USA south Africa or england....this is about making yourself proud of Ur country and the director of the film does the same"
    },
    {
        "author": "HeadleyLamarr",
        "review_date": "11 August 2007",
        "title": " Chak de Chak de, Ek Hockey doongi main Rakh ke!",
        "rating": "2",
        "review": "Yes I went to see the film because I saw Shahrukh looking super good in the promos (what can I say - I am a shallow person!). But what kept me glued to the seat with my eyes fixed on the screen was a motley crew of ordinary girls with extra-ordinary attitude. AND I like hockey, wish the glory days were back.Chak de India is an out and out sports film, there is a disgraced coach, there is a team that is fragmented and needs team spirit, and there are matches to be won and glory to reap. The film follows a rather linear path and does not dish out any surprises except one - it is unpredictably wonderful! My football and basketball fanatic little nephew was shouting \"goal\" at every score and the audience was as mesmerized at this tournament being played out on celluloid as they would have been at the live event. There were cheers and claps at every win. Why? Because this team was real, we watched them turn into a team and we yearned for their day in the lights as much as they did. Of course it was a Cinderella story - but what made the story poignant was the fact that all this happened for real, that there was indeed an extraordinary player who was disgraced and redeemed himself in exactly this fashion. The script was taut, the editing was superb, there were no unnecessary moments in the film. There were no cringe inducing dialogs, no useless song and dance routines, no romance backdrop of the coach falling for the star (a la Bend it Like Beckham). The music was uplifting and extremely well integrated into the narrative - Kuch Kariye was inspirational, Maula mere haunting, Badal Pe Paon a most exuberant transition from stuck in the back waters to out in the happening place of the World Cup! The girls were superbly cast - they represented the true face of India, with all its diversity and its problems that relate to this diversity. Their bickering, their in fights, quest for personal glory and how this slowly changed into a camaraderie was extremely well done. Komal Chautala (Chitrashi Rawat) was CUTE, Bindiya Nayak (Shilpa Shukla) was awesome as the bad girl of the team, Preeti Sabharwal (Segarika Ghatge) was hot, Tanya Abrol was awesome as the Hockey Doongi Balbir, Vidya Sharma (Vidya Malvade) was good as the conflicted housewife turned goalie/captain, but my personal favorite was SoiMoi (Nisha Nair) the girl from Jharkhand. Every one was given their moments to tell us why we should care about them. The other supporting cast of the assistant coach and the federation people did their job well. Of course I had gone in expecting to see SRK in a hot new incarnation. What I saw was a man who was a coach, a haunted man with agony in his eyes, a fire in his belly and a desire to redeem himself at all costs. After about the first 10 minutes I did not even care that Mr. Khan was looking the best he has done in years - he was coach Kabir Khan, the tarter, the disciplinarian, the psychologist, the motivator and above all the man who was in for the long haul and was going to make a miracle happen.Shimit's direction was superb, Jaideep Sahni wrote a stirring tale, and together with the actors they made sure that this was not just another sports Cinderella story. This was a tale about the empowerment of women, and showcased their ability to triumph in the face of innumerable hurdles both in the home and outside. Chak De!!"
    }
]