[
    {
        "author": "hilaryswank2011",
        "review_date": "5 October 2017",
        "title": " The Asian Film of 2017! Thank you for the Crew and Casts! Great!",
        "rating": "10",
        "review": "Mahavir Singh Phogat teaches his two daughters to be international wrestling players of India! This is a simple and impressive story. And they finally defeat UK on the wrestling match. \nI think this is India's 'Yip Man'! This kind of nationalism is healthy and is beneficial to all audiences without background considerations. The film length is also accurate. Growing courses of protagonists need 160 minutes. And emotional responses to their tragic mistakes are well described by the talented actors in detail. Audiences can fully engage in this film. \nA lot of Asian audiences have bias against Indian films that their films are just dances and songs for two hours or more, however there is the perfect construction of story with minimalist use of songs and musics. \nThis quality is higher than any Japanese films of today! Indian filmmakers should keep this high quality of film content! It is competitive to Hollywood films. At the end of the film, it is full of enlightenment, the most important thing in life is not 'thing' but it is a human relationship with emotion. If you are true to your families' goodness and emotion, you'll find the best solution of your problem. Even though you fail in this way, your family relationship will only be enhanced as the result of your effort and sincereness. This what this film tells you! \nThank you!"
    },
    {
        "author": "gskrocks",
        "review_date": "21 December 2016",
        "title": " Aamir is back with a stellar performance of a decade !",
        "rating": "9",
        "review": "DANGAL is a masterpiece. A terrific film that stays in your heart and remains etched in your memory much after the screening has concluded. A brilliant film that restores your faith in Hindi cinema. Actually, it won't be erroneous to state that DANGAL is the finest film to come out of the Hindi film industry in a long, long time and mark my words, it will be remembered as a classic in times to come. It blends drama, emotions, sportsmanship and patriotism extraordinarily the icing on the cake being Aamir Khan's towering act. This rich-in-merits film has a major advantage too -- the holidays ahead Christmas and New Year -- which will ensure a glorious run at the ticket counters. A must, must watch!"
    },
    {
        "author": "Fella_shibby",
        "review_date": "23 December 2016",
        "title": " Awesome film n wonderful performance by Aamir. Disney n Aamir did a miracle with this film.",
        "rating": "10",
        "review": "I saw this with my family in a theatre. Awesome experience.\nAamir's acting, effort n most importantly his passion is what makes his cinema so damn unique. First thing Dangal has going for it is Aamir khan.\nAamir khan gave arguably the best performance of his career playing Phogat. He is the best actor in bollywood. Period. He shocked me by his transformation. I myself being a gym trainer knows the effort which goes in such kinda transformation. Without Aamir I don't think this movie could have achieved what it has.\nThe child actors were good too. The music was good. The direction by Tiwari was the best of 2016. This movie was never boring and full credit shud go to the director. The cinematography gave you a feeling as if what you are watching is real.\nOverall you don't have to like wrestling or know wrestling to appreciate this movie. Its a wonderful movie. The movie is written very well. Superb screenplay n crispy editing."
    },
    {
        "author": "umashankarpati1997",
        "review_date": "23 December 2016",
        "title": " This is AAMIR KHAN's by far the best one.Finest casting and terrific acting by all.",
        "rating": "9",
        "review": "Aamir Khan shines in the role of Mahavir Singh Phogat. He is so outstanding in his performance that this could be considered as one of his best works ever. The opening scene of the film is just a glimpse of Phogat's passion for the sport – wrestling. The first half of Dangal works exactly like a skilled wrestler – invariably sure of its moves. The film's second half is all about victory. Mahavir's transformation from the once upset father of a baby girl to the most triumphant one to Geeta's string of losses before she finally wins a gold during Common Wealth Games to desi akhara being replaced by wrestling mat – every moment works in contrast to what you had watched earlier. But not even once does the film loses its focus.A word here about Mukesh Chhabra's casting: he has done a tremendous job of the casting. Nitesh Tiwari's direction is amazingly terrific. AmitabhBhattacharya's lyrics are great. Pritam's music is in terrific sync with the mood of the drama. 'Dangal dangal' is a very inspiring song and will soon become a rage. 'Dhaakad' and 'Haanikarak' are also very well-tuned. The 'Gilehariyaan' song has terrific charm of a different kind. Amitabh Bhattacharya's lyrics are great. The song writer may pick up some awards for his lyrics. Bosco- Caesar's choreography is very real. Pritam's background music deserves distinction marks. The actors who play the young Geeta and Babita (Zaira Wasim, Suhani Bhatnagar) do a competent job of maintaining the audiences attention. And both Shaikh and Malhotra carry it forward, especially when they spend a lot of the second half on the mat, learning how to lose, and, above all, to win. Since it encapsulates the historic win of the phogats who bought India glory so it is bound to inspire women. Dialogues are absolute gems. Without being overtly long, they are so effective that they invariably touch the heart before reaching the ears. On the whole, Dangal is not just a movie; it is an experience to be cherished. The film is destined to be one of the biggest blockbusters of Indian cinema.As it content oriented so The movie is both for the single screens as well as for the multiplexes and people of all age can watch.so this movie is a must watch. So I Rate it 10 stars out of 10 because I was thinking movie deserves it.I usually don't rate any movie 10 but This movie \"HatsOff\". Don't Expect a better story than this.Finest piece.Dangal hai yeh."
    },
    {
        "author": "ridinbal",
        "review_date": "22 December 2016",
        "title": " Movie of the year. Its much better than sultan in terms of everything and script here worked out well",
        "rating": "9",
        "review": "\"Direction was superb and Aamir's performance was excellent. A compelling narrative based on true story with a powerful message for women\" My rating- 4.5/5 (Movie of the year and don't miss this flick) Positives- 1.)Direction and screenplay- Direction and screenplay didn't bore us and we were glued to the seats as it was so engaging and entertaining.2.)Aamir khan , Zaira (young Geeta), Fathima (geeta) , suhani (young babitha), sanya(babitha) and fathima (mother)- Everyone's performance was excellent. Amir's hardwork and dedication for this role can be seen through his performance. He once again proved to be Mr perfectionist. All girls who acted as daughters were very good and they portrayed their roles without any problems.3.)Songs and bg score- Special mention for title song. Title song was great and suited the movie well. Hats off to Pritam and he once again proved that he is the best music director of bollywood.4.) Cinematography and edits- Cinematographer captured wrestling scenes very well and edits of certain scenes were good.5.)Strong message for women Negatives- (NO NEGATIVES) Is it a must watch? Yes!!! and watch it in theaters to get the feel.Overall- This is the best Christmas treat for everyone from dangal team. This has Aamir Khan's best performance till date. And the major one is that it has strong message for women. Yes its a must watch movie and don't miss this flick!! My rating- 4.5/5 (Movie of the year and don't miss this movie) For more reviews go to- ridinbal movie reviews. Ridin bal movie reviews has all language movie reviews(Malayalam,English,Telugu,Kannada,Tamil,Arabic,Hindi,Iranian)"
    },
    {
        "author": "khalid-71691",
        "review_date": "23 December 2016",
        "title": " The best biopic ever",
        "rating": "9",
        "review": "Umm where to start? First of Aamir sir has done it again. He really has a good taste in selecting movies. Not only the acting even the fighting scenes were quite real to me &amp; reel Geeta and Babita were just too awesome. There is certain moments where you're gonna laugh out loud, get anger, get emotional and obviously feel proud the most that's what the movie brings out of itself. I hope this movie brings joy to all family and a chance to look at all daughter's of their's potential.Should you go for it? Hell yesSongs are smartly enough and pretty amazing.Ps. I wished the movie to be a bit longer."
    },
    {
        "author": "dineshprakash",
        "review_date": "22 December 2016",
        "title": " Ultimate triumph",
        "rating": "10",
        "review": "Director Mr. Nitesh Tiwari work is so brilliant that after few minutes, you just forget that you are watching film. You simply start witnessing the journey of Phogat's family. Makers are so confident that they have even given credit for story idea to Divya Rao, which reflects their honesty. She is not in writing team but gets her due credit. There are four writers, Director himself, Piyush Gupta, Shreyas Jain and Nikhil Mehrotra and their work is fantastic. Screenplay is seamless and very balanced with much needed freshness. Film starts with glimpse of Mahavir Singh Phogat's passion for wrestling, while watching and challenging another district level arrogant winner, while commentary comes over on them which is fresh. When that person gets defeated he says 'Tumne district level pehlawan ko haraya hai' Then Mahavir Singh replies ' Tension mat le, tum national level champion se hare ho'. Words may be a bit different but meaning was same. Which gives strong idea that what level of dialogues you are going to listen and they have maintained the graph. Dialogues just nourish your senses, inducing correct emotions. A simple scene where protagonist massages feet of his sleeping daughter, clearly reflects that he is just not a ruthless coach but a caring father too. Girls curse their father in front of their friend who is getting married, then that girl emotional words about her feeling towards their caring father is very cute, emotional and enough to make girls realize that what they are taking for granted. Best part of this film is it's continues ascending graph in every aspect. First half is cute, funny with subtle dose of emotions. Second half takes this graph to the horizon. Full of emotions, either it is of defeat, victory or relations. Another major plus point is the way they have shown wrestling. I dint know a bit of it but I enjoyed all wrestling matches like it was my favorite game and that is major chunk of film. Hats off to the team behind wresting choreography .Though you have basic idea of film happenings but still they kept you engrossed by presentation. Climax comes with a very strong message that one can train you but only you have to implement the techniques, which makes you true winner and enriches self confident. Performance makes you thunderstruck. Words can not justify or compliment, Amir Khan's performance as Mahavir Singh Phogat. Zaira Waseem as younger Geeta is brilliant. She is so good that when Fatima Sana Sheikh takes over as grown up Geeta, you miss younger one but soon Fatima proves that she has taken the graph far ahead. Same happens with younger Babita played by Suhani Bhatnagar and grown up by Sanya Malhotra. Skashi Tanwar as wife of Mahavir Singh is very good. Girish Kulkarni , who had played coach is superb, you do hate his character but love his performance. Actor, who played younger cousin of Geeta and even grown up one, both actors are cute and endearing. Kudos to casting director Mukesh Chhabra and team. Music by Pritam and lyrics by Amitabh Bhattacharya, are integral part of this film. Without any formulated track you just enjoy every song and your eyes get mois in one too."
    },
    {
        "author": "akbar-navid-151-165374",
        "review_date": "22 December 2016",
        "title": " Simply Fantastic! Plot, acting, direction: mastery in all.",
        "rating": "10",
        "review": "Just came home after watching the premier show. It really is a masterpiece! A compelling narrative based on a true story. Add stellar acting performances and humor. Pour in cinematography, location, songs &amp; meaningful lyrics. Voila! Everything amazingly fits together in a single string. Truly clean entertainment. In all sense of the word. Worth watching with family. A good movie should entertain. A great movie must connect. And connect, it did. I could almost feel as if I were there, throughout. The plot development is deep, and engaging. Did I mention the child actors, especially the one portraying Geeta? Outstanding performance by all. In a nutshell, my time &amp; resources spent were fully worth. And Aamir Khan! Boy, he never disappoints. =)"
    },
    {
        "author": "faisalfaves",
        "review_date": "23 December 2016",
        "title": " Very Strong - A Must Watch 10/10",
        "rating": "10",
        "review": "Story: 9/10 A Very True inspiring story of former wrestler champion Mahavir Singh Phogat whose dream is to win a gold medal for India in wrestling. But he fails to achieve that, then He avow that his son will do it. However, he got disappointed when his wife gives birth to four daughters.Music: 9/10 Amazing, Very touching background. Greatly Synced Title track will give you goosebumpsDirection: 9/10 Nitesh Tiwari achieved what he wanted, Got a new name, One of the best directors of Bollywood.Acting: Aamir Khan: 10/10 This time as a father, He will amaze you in every scene. His acting skills are deeply great. Whenever I watch Aamir's movies, I feel his acting. He loves acting and entertaining the world since He came to the Film Industry.Fatima Sana Shaikh: 9/10 Sometimes I still watch Chachi 420, because I love Kamal Hassan. And Fatima Sana Shaikh was the little girl in Chachi 420. Seriously I have seen her after Chachi 420. And after Dangal she will go so far.Aamir Khan and the two lead actress are the best cast roles in a long time, but overall cast done an amazing job.Dangal is humorous and Inspirational Journey."
    },
    {
        "author": "adityapaihy-724-884968",
        "review_date": "22 December 2016",
        "title": " Very Nice Movie",
        "rating": "10",
        "review": "Excellent movie. Stellar performance by Aamir Khan. Movie of the year. The girls - kids and the grown ups portrayed their role very well. Special mention should be given to Nitesh Tiwari - the director. Music by Pritam is good. The cinematography is nice. The story telling is superb. Overall very nice movie. Watch this movie for Aamir Khan. Hands down to Aamir. His role as Mahavir Singh Phogat will be marked as one of his best. This film will come as one of the best sports films based on the life of coach after Chak De and Iqbal. I strongly recommend this film. Wish other actors think like how Aamir Khan thinks. He is brilliant actor. That makes him special and perfectionist. My rating 10/10."
    },
    {
        "author": "Takethispunch",
        "review_date": "22 December 2016",
        "title": " The best Indian film. Deserves an Oscar. Do not miss this masterpiece.",
        "rating": "9",
        "review": "Mahavir Singh Phogat is a former champion wrestler. He is married to Shobha Kaur. Phogat's dream is to win a gold medal for India in wrestling. He is unable to do this. He promises that his son will do what he couldn't do. However, although he loves them dearly, Phogat is disappointed when Shobha gives birth to four daughters. He does not believe girls can wrestle well. However, when two of his daughters, Geeta and Babita, come home after beating up two boys, Phogat realises how wrong he has been and begins to train his daughters in wrestling. The film is the story of how Phogat trained his daughters to become professional wrestlers."
    },
    {
        "author": "aashkaran2006",
        "review_date": "23 December 2016",
        "title": " Aamir's Chak De India of 2017 !",
        "rating": "10",
        "review": "My Dangal Review/Thoughts:In the moments of tension, I believe everyone exhibits their own unique body language to deal with nervousness and anxiousness. Mine involves folding hands (christian style). I am worried that I folded my hands for so long during the film that had I done the same in a temple, I would have been some Shah Rukh Khan myself. Yes ! The film is that excellent in its portrayal of the sport that it makes you grudge every time a player lands back first on the mat. We are so used to applauding action set pieces in other films that it will be criminal if the action choreography for Dangal goes unappreciated. This is the best and most realistic we have ever done!The whole cast is so great that I can't do anything but wonder why we need the glam actresses for each and every big film..why not some Sakshi Talwar? The new faces do wonders when it comes to making the illusion of cinema feel true. And, when Aamir (the superstar) sheds former self to becomes some chachajaan, it adds to the illusion instead of taking the magic away. I am bound to praise Aamir, but that guy has lost that element of surprise to make you go WoW. He is just aamir being aamir in yet another film that'll be brought in his already long good list. This is what happens when you submit yourself to the script and director (&lt;= full marks)Most sports film are marred by clichés. Its impossible to evade the conventional trappings of the genre. Dangal has its fair share of those, but the biggest thing is that it knows when to stop, and that's what makes it a stadium like live experience. My adrenaline rush was high, and it made me very nostalgic as I got reminded of CWG Delhi days when I was 24*7 glued to DD sports. At this point, I feel my review is deviating from its path so I will put breaks by making a concluding statement.This is Aamir's Chak de India! I am speaking this both figuratively and literally ( :) ). But, who in the right mind would mind another one of those."
    },
    {
        "author": "madbhoot",
        "review_date": "22 December 2016",
        "title": " Must Watch for Every Film Lover!",
        "rating": "6",
        "review": "I got the privilege to watch this film earlier than the India release as I happen to live in North America. Thank you Disney! Now, what to say about 'Dangal'? It's not a typical Bollywood film, yet it is easily the best Bollywood film ever, even in terms of every, so called, Bollywood masala trick. The incredible storytelling, based on true events, every small detailing, amazing cast, the message it had without being preachy or pretentious but still powerful-there was not one single boring moment in the movie-well, probably one, if you are too picky!,though it is nearly three hours! Kudos to the director! And what to say about Aamir khan? Though he did not have any dramatic moment in the movie (those belong to the girls, who were fabulous by the way), he is not the charming usual boy next door, sexy or cheeky person(the traits which are generally associated with Aamir Khan); rather he is a brute, has a tummy for the majority length of the movie-yet you will not be able to keep him off your mind, even after the movie ends, and easily the best Aamir khan performance ever (and yes, I have seen every Aamir khan film, each a million time)."
    },
    {
        "author": "heartbeats123",
        "review_date": "28 December 2016",
        "title": " labeled Based on a True Story but simply Fictionalized",
        "rating": "10",
        "review": "This movie proves that India is not yet ready for an honest biopic film. Although the film excelled in every other aspects such as acting, cinematography, special effects, music; especially MUSIC, But it couldn't capture the real aspect of the story of the wrestlers daughter and her sisters. We never get to know her enthusiasm towards wrestling. Was it her relationship with her father who imposed his dream of winning a gold on her? or her duty towards her nation to win it? or was it her own desire to never give up or lose to a competitive opposition to satisfy her own ego?This film was heavily clichéd just for the purpose of entertaining the masses and clearly may have aggravated many characters who are related to this story. TOO much HYPE may have given this movie the attention that it pursued, and why not? this is business after all.Much disappointed with the makers of the film for adulterating such an awesome script which may have had made everybody proud. Current IMDb score :9.2 with over 13k users. Where have we gone wrong?Final verdict: Its a good watch, but one wouldn't rate this movie 9/10 unless he/she had any personal attachment towards the film. it has good social message/dialogues. An 8 would be too generous, hence I would rate it 6 or 7 out of 10."
    },
    {
        "author": "paulsmithson-192-243826",
        "review_date": "23 December 2016",
        "title": " Had me on the edge of my seat and in tears",
        "rating": "9",
        "review": "It's conceivable that a wrestling movie might have you on the edge of your seat, but who'd have thought it would bring tears to your eyes. Dangal does both in large doses. Right from the opening scenes through to the awesome climax, this is one movie that will keep you glued to the screen. I can't remember the last 3 hour movie (nearly) where absolutely nobody took a toilet break apart from in the intermission.Everything about the movie is superb from the cinematography through to the script writing. The movie is superbly directed and there are so many stellar acting performances that it would be unfair to single anyone out.One thing about sports movies is that the action can often seem staged, but the fight sequences in this movie are superbly done and brilliantly filmed.Everyone knows an AK movie is going to be great, and this definitely doesn't disappoint.A must watch."
    },
    {
        "author": "Filmaholic_Khan",
        "review_date": "24 December 2016",
        "title": " High Level of Detail makes Dangal Stand Out! Inspirational True Story",
        "rating": "9",
        "review": "Nitesh Tiwari, Amir Khan and the team has put an extra-ordinary effort to make such an intelligent blend of Inspiration, Emotions and Humor that standing ovation at the end is irresistible. Dangal has a very unfamiliar high level of detail which is too good for Bollywood. High detailing make actors live the character, which doesn't go unnoticed and Dangal proves this point. Each actor wasn't just playing the character, they were truly living it. It was the Phogat family viewers saw on screen instead of the actors. That makes Dangal stand out. Acting is brilliant by both the lead and supporting actors. Mr. Perfectionist was great like always. No words to describe his level of commitment. Special mentions are the debutantes Fatima Sana Shaikh, Sanya Malhotra and Zaira Waseem. All the wrestling scenes are perfect and viewers can't mistake them for actors. The way these girls portrayed the characters of the wrestlers Geeta and Babita is commendable and worthy of every award. Story was based on a true story and the director stuck to it with some slight additions to make the movie more emotional and enjoyable which is good for Bollywood audience. But as a critic I must say there was a little bit of over dramatization in the end. Also I want to mention that AK and Nitesh didn't include any usual romantic crap and dance sequences which must be appreciated. Casting could have been better. Fatima is too cute for Geeta's character and this matters a lot while making a Biography. But she minimized this shortcoming by her flawless performance. Movie is 2hr40mins long but its well crafted so its enjoyable. ____________________________________________________________________ _________________________________________________ Its a must watch movie and Amir Khan keeps on setting standards for other producers of Bollywood which makes us hope for a better future of movies in India."
    },
    {
        "author": "maulin5",
        "review_date": "24 December 2016",
        "title": " Bhed Ki Haahakaar Ke Badle Sher Ki Ek Dahaad Hai Pyaare- Dangal!",
        "rating": "9",
        "review": "Aamir Khan is back after 'pk' as a wrestler who wants his daughter to win the Gold for the nation. It is a biopic of Mahavir Phogat. And believe me, it's a must watch biopic to get inspiration. To achieve something you have to let go the rest of the things.A simple story with great performances make this film a worthy watch. Aamir Khan is as usual fantastic. But, the girls are true heroes of this film. Fatimah who plays Geeta is a sure shot winner. She looks exactly as per her character and delivers great impact as a wrestler. Younger girls of Geeta and Babita are also very fine. Sakshi has a small role, but she plays it safely. Aparshakti Khurana is doing a voice over here and plays a role of the girls' cousin brother. He is funny and entertains the audiences for sure. Girish Kulkarni is also there, who delivered a classy performance in Ugly. So, the star cast and their performances are the biggest point of Dangal.Direction and writing by Nitesh Tiwari are worthy enough for viewers as they don't get bored in any situation. Except one, after interval song, that is like something slow paced. Everyone has to applause him as he gives justice to Phogat's family and doesn't add any extra material which we often see in Bollywood movies. He has delivered the frame as it is, so the middle class viewer can easily be able to connect with the film. What I like the most in the film apart from the performances is Music. Pritam has given it with the lyrics of Amitabh Bhatacharya. Both were amazing in Ae Dil Hai Mushkil. This time also they are killing the stereotypes. I loved all the songs. I'm downloading it. Hanikarak Bapu and Dhakad are pitch perfect. They have some English words as well as some pure Hindi words in them which make them enjoyable. But the best song is by far the Title track in the voice of Daler Mehndi. Full marks to the music department!Yes, it is very emotional film. Those who get the connection easily with films, may cry during some scenes. Even I'm one of them, too. It is better than Sultan, because it's a pure wrestling movie with a family background. Sultan was like a love story with a background of wrestling till interval and then box fighting post interval. I wish, Dangal may cross the record of Sultan at Box Office.On the whole, just go and enjoy the perfect film with your entire family as many time as you can. Btw, I will go for the second time for sure. So, 2016 has ended with a perfect film. Jai Hind!"
    },
    {
        "author": "hsm2310",
        "review_date": "23 December 2016",
        "title": " Dangal is very special. Ultimate mix of technical film making and popular cinema",
        "rating": "8",
        "review": "Dangal (9/10) is the kind of film for which the 70mm medium exists. It has universal appeal, is technically brilliant and more than anything else it is a film that skillfully balances popular sentiments and realism. It is going to reach tens of millions of people without having compromised the quality of storytelling.An extraordinary story of some extraordinary people who not only conquered their fears but also a society which had the negativity to kill their dreams even before they were born.If Chak De was a fine example of exemplary editing in a sports film and Pan Singh Tomar was an exceptional sports film with great depth and realism, Dangal would forever be remembered as one of the best Indian sports film for the sheer reach it will have. Wrestling is a fast paced technical sport. To make the whole thing look as authentic as it has looked in the film, it would have required some meticulous planning and extensive training and they have done it really well.The fact that you feel the frustration that Mahavir Singh Phogat feels in the final scene and you along with the whole audience begins to clap after each of Geeta's winning bout as if there was a live game at display shows how supremely engaging the film is. One negative, though not significant enough to harm the film is that it has over dramatazied the narrative at the cost of slight misrepresentation of the facts.Only if the majority of Indian film makers could realize that it is not impossible to make good cinema with popular appeal, we would start getting more than just a couple of Hindi films every year worth watching. Now is a good time to list Top Films from India in the Sports/Drama genre: 1)Paan SIngh Tomar 2)Dangal 3)Chak De India 4)Iqbal 5)Jo Jeeta Wohi Sikander 6)Lagaan 7)Bhaag Milkha Bhaag"
    },
    {
        "author": "sarkar-64044",
        "review_date": "23 December 2016",
        "title": " Energetic,emotional,patriotic and a good message",
        "rating": "9",
        "review": "excellent work by the whole cast and crew,and as always a work of perfectionist,brought up a good story and something which was buried in past ,a thing which a society doesn't accept,great work on focusing on that aspect,and a moral booster for women's,and a emotional line up for doing something for the country,showing the nation,the struggle of a father ,making that aspect possible,which the society don't even want to think about it,and Mr khan's prismatic performance as an champ wrestler,struggling father and a coach,after all Mr khan's most emotional film and as always a perfectionist as ever,to end a great step to lightened the darker side of the society"
    },
    {
        "author": "anupapu8",
        "review_date": "23 December 2016",
        "title": " This Years Best along with PINK",
        "rating": "9",
        "review": "DANGAL - its such a good thing that both PINK and DANGAL , two top movies of this year are women centric. Its such an improvement for Bollywood which doesn't make movies on women because such movies doesn't make money , which is a wrong fact , PINK made almost 300% profit. You just need to make a good movie and it will make you money. And by saying women centric m serious, the character of Mahavir Phogat is not the real hero of the movie , rather its his daughter Geeta Phogat who is in the center of the movie. For understanding what MAhavir Phogat has achieved in his life , we must know the fact that Hariyana is one of the worst state in India for girls. A very low sex ratio and a very low Literacy rate for women. And in such scenario what Mahavir Phogat has achieved is tremendous. That said , one thing is clear that we cant expect anything out of the box which we always get from AMIR's movies like 3 idiot , PK and TALAASH , because its a biopic , so they have to show what actually happened , which is not exactly bad things , in fact what this movie shows is an out of the box real life story. First i would like to mention two things which i don't liked. 1st - The way the wrestling coach of NATIONAL SPORTS ACADEMY has been shown as one sided villain also who is kind of incapable to train , was wrong. 2nd - there was an unnecessary twist in the end which seems unconvincing. Apart from these two things , everything else is either good or great in the movie. The movie tackle through different themes. Sometimes it tackles them one by one , and sometimes simultaneously. But the good thing is that it tackles them convincingly. For example when we see Mahavir training his daughters rigorously , there comes a thought that, what kind of dad he is. He just stole the childhood of her daughters to fulfill his own dreams. But after some scenes on the wedding of Mahavir's daughters' friend both the daughters complaining about Mahavir her friend (who is getting married) reply that she hoped that she would had get such father as Mahavir who thinks about their daughters and wants them to achieve something and not like his own father who force her to marry at the age of just 14 to an unknown person. That particular scene convince the audience that what Mahavir is doing is not wrong as compared to the society where they are living. Another theme which movie showed very convincingly was how free a girl feel when she goes out of his family for the first time. Almost 1 hour of the movie contains wrestling matches. And those matches were done extremely well on technical level , and hook you like you were watching a real match. I mean as compared to this the matches show in SULTAN were just nothing. Among the performances ZAIRA WASIM (also the lead actor of Amir's next SECRET SUPERSTAR) playing Young GEETA was delight to watch. The scene where she request her father to not cut her hair and she will do anything he wants was heartbreaking. And she does her fighting scenes very well considering the fact that the director in an interview has mentioned that ZAIRA was actually the weakest among all the four girls before they start their training. But when it comes to fight scenes , FATIMA SANA SHEIK as the older Geeta was best. She fights like a real fighter and her hard work is visible on the screen. On her dramatic acting front she was awesome too. Both the actresses who played young and old Babita were good too , but got less screen time as compared to Geeta's character. Aparshakti Khurana(brother of Ayushman Khurana) as the nephew of Mahavir has an impeccable timing of comedy , and surly will make you laugh many time. But for Amir Khan , what to say , he blends so nicely , that he became MAHAVIR , and the actor Amir is nowhere visible anywhere. He just makes me wonder why cant other actors (yes pointing at SRK and SALLU) stop-showing their persona and blend into characters in their movies . Around the whole movie there were so many whistle blowing happening , that i was not able to here the dialogues many times. But just before climax , the NATIONAL ANTHEM runs in common wealth games after GEETA PHOGAT won her gold medal(i hope that's not a spoiler) and the whole theater stands in respect of NATIONAL ANTHEM you just cant help and get OVERWHELMED. 9.4/10 by ANuP APu KuMaR"
    },
    {
        "author": "arpanmitra3",
        "review_date": "23 December 2016",
        "title": " Grit and Determination",
        "rating": "8",
        "review": "Its a movie decked up with the classic acting of the veterans and the novices and bore the testimony of the unorthodox approach to bring to light the dream of Mahavir Phogat. The fire of 'dangal' ignited in the hearts of the sisters which paved the path of demolition of gender discrimination. The film portrays the affectionate bonding of a father and a daughter and emotional rendition escalates barriers when the elder sister has kept the very words of her father's dream. In fact it is beautifully carved that our ignorance towards our family elders hinders our progress. The film has been peppered with humour every now and then and it has added extra spice to the viewers."
    },
    {
        "author": "oazam",
        "review_date": "23 December 2016",
        "title": " 2 years later, Aamir Khan yet again succeeds with this Sports-drama. Pritam's music is a bronze medal",
        "rating": "9",
        "review": "Honestly I was a bit determinant after watching Sultan thinking that this film could be a remake but honestly after watching this movie, it was a lot different. This movie just melted my heart with the fantastic writing, direction, performances, and editing. Nitesh Tiwari brought 2 average films which were Bhoothnath Returns and Chillar Party. But for this film, he deserves a bow for the amount of hard work he managed to put for this film.The performances in the movie were absolutely phenomenal. Aamir Khan is back to becoming nuanced and self confident Khan we always admired. His fat to fit video really created a lot of inspiration for me and my friends and that increased our eager level in watching this movie. Sakshi Tanwar is a pretty decent actress. Her role was absolutely strong and withheld but her dialogues in certain places were quite awkward and almost out-of-place.The girls who played Geeta and Babita just kept me to the edge of my seat. What amazement these girls did and how they used their empowerment to pull of a male-sport with such ease.The screenplay and direction was something I really loved just like how Haryana was shot and how the wrestling scenes were shot.After Ae Dil Hai Mushkil, I managed to enjoy Priam's music but the songs in Dangal were average and I wouldn't consider them at loop-listening soundtracks. Not many songs really stand out as such.Honestly, I enjoyed this movie much more than Sultan based on its true story and fantastic direction. Overall, this movie is a masterpiece with beautiful direction, performances, and acting. This motion picture really touched my heart. Leave your house and grab your tickets, this is definitely a cinema watching movie.In any society, it is very important to understand the meaning of women rights. No matter how boyish something could be, women are considered human beings. Girls have the right to do anything ranging from being a police officer to a taxi driver. These are typical jobs that mostly men pull off but women can also pull these jobs off but much quicker. Try to understand that men and women are the same professional wise."
    },
    {
        "author": "hassaanbukhary-40684",
        "review_date": "25 December 2016",
        "title": " The movie with its classic taste",
        "rating": "3",
        "review": "Amir Khan a person always amazes everyone,recently he is working for movies with a good moral lesson and a worthy base.That kind of movie is a \"movie\". Dangal is a good example it has a classic taste and digestible fun which peels off the people eyes. It is a true story full of suspense and when you're watching a fight you feel like you are wrestling in between this kind of quality is difficult to be produced and Amir is good at it. The reason for giving 9 stars is because of its ending I think it should be made better by showing scene like he is putting that medal at the wall of Honor. Anyways keep it up I was expecting this a thing from you. Love you :)"
    },
    {
        "author": "aeykeay",
        "review_date": "1 January 2017",
        "title": " Over-hyped by Patriots .. Average Movie......Nowhere near what everyone is making it out to be.",
        "rating": "10",
        "review": "Story : Good Screenplay : Good Direction: Average Actors: All acted ordinarily except Aamir who was above average due to few heart touching scenes. Music: Effective/GoodToo much hype by patriots not knowing a good movie from a bad, who are simply echoing the same words uttered by the bollywood celebs for their friend Aamir. I felt the movie was very predictable with lots of scenes were altered from reality for entertainment purposes. Yes it has emotions, comedy, action etc. but is not a true movie at all except a few scenes such as fight sequences. I believe a lot of people are just going to watch this due to the word of mouth coming from other bollywood celebs promoting the movie left right and centre. The whole of India if not the world had more time at their hands due to the holiday season and everyone from marketing team to film producers, directors, actors, friends, media just went all out promoting this movie for Aamir and his production house and all they did is enjoyed people spending their hard earned moola on this average movie."
    }
]