[
    {
        "author": "notoriousCASK",
        "review_date": "11 April 2018",
        "title": " Welcome to the Real World.",
        "rating": "10",
        "review": "Without a doubt one of the best and most influential movies of all time, the Matrix is the defining science fiction film of the 1990's and the biggest leap the genre has taken since Stanley Kubrick's 2001: a Space Odyssey and Ridley Scott's Blade Runner. The Matrix is a ground-breaking motion picture that not only raised the bar for all the science-fiction films to come after it but also redefined the action genre with its thrilling action sequences and revolutionary visual effects.The film tells the story of Thomas Anderson a computer hacker that in the world of hacking goes by the alias of Neo. When he is contacted by the mysterious outlaw Morpheus and having always questioned his reality, he is awakened to the truth that the world he's been living in is a simulated reality called the Matrix and that he's nothing more than a slave in this dystopian world, created and controlled by A.I powered machines.The direction and script by the Wachowskis is fantastic, as they drew ideas and inspirations from every other great sci-fi and cyberpunk movie and anime before the film, combining it with stunning action and putting it into one picture that has enough style, substance and subtext that everyone ended up giving their own interpretation of the story. The research that went into the preparation of the screenplay is quite extensive but the manner in which it is presented on the big screen is also very impressive. Every character presented on the film, has a well-defined arc and a purpose, and their motivations are clear.The cinematography is impeccable. It was very innovative in the use of the camera angles and movements, the zooms, the slow motion captures and the different color palette used to differentiate the Matrix and the real World. The editing is flawless, as it makes sure that every scene is integral to the story and ensures the pace of the film stays ferocious through its entire runtime. Each frame is also packed with so much visual information for the viewer to devour. The visual effects introduced us to the bullet-time effect and their impact can still be felt in today's movies. The performances are also incredible. Each member of the cast gave their best performances and brought the characters they portray to life, but the one that stands out the most is Hugo Weaving's disciplined rendition of his character, Agent Smith; a powerful computer program made to search and destroy the human rebellion, in undoubtedly the greatest performance in his career.In conclusion The Matrix is a masterpiece everyone should see. It is one of the most thought provoking, inventive, pioneering, influential and stylish movies of all time and it's also full of philosophical and religious allegories waiting for interpretation. Immortal for its contribution to cinema and pop culture, its brilliant combination of inventive visual effects, excellent vision and exquisite action easily makes it one of the best, most influential and most entertaining movies ever made."
    },
    {
        "author": "mambubukid",
        "review_date": "19 September 2000",
        "title": " The benchmark for all sci-fi films to come",
        "rating": "10",
        "review": "The story of a reluctant Christ-like protagonist set against a baroque, MTV backdrop, The Matrix is the definitive hybrid of technical wizardry and contextual excellence that should be the benchmark for all sci-fi films to come.Hollywood has had some problems combining form and matter in the sci-fi genre.  There have been a lot of visually stunning works but nobody cared about the hero. (Or nobody simply cared about anything.)  There a few, though, which aroused interest and intellect but nobody 'ooh'-ed or 'aah'-ed at the special effects.  With The Matrix, both elements are perfectly en sync.  Not only did we want to cheer on the heroes to victory, we wanted them to bludgeon the opposition.  Not only did we sit in awe as Neo evaded those bullets in limbo-rock fashion, we salivated.But what makes The Matrix several cuts above the rest of the films in its genre is that there are simply no loopholes.  The script, written by the Wachowski brothers is intelligent but carefully not geeky.  The kung-fu sequences were deftly shot -- something even Bruce Lee would've been proud of.  The photography was breathtaking.  (I bet if you had to cut every frame on the reel and had it developed and printed, every single frame would stand on its own.)  And the acting?  Maybe not the best Keanu Reeves but name me an actor who has box-office appeal but could portray the uneasy and vulnerable protagonist, Neo, to a T the way Reeves did.  But, come to think of it, if you pit any actor beside Laurence Fishburne, you're bound to confuse that actor for bad acting.  As Morpheus, Mr. Fishburne is simply wicked!  Shades of his mentor-role in Higher Learning, nobody exudes that aura of quiet intensity than Mr. Fishburne.  His character, battle-scarred but always composed Morpheus, is given an extra dose of mortality (He loves Neo to a fault.) only Mr. Fishburne can flesh out.People will say what they want to say about how good The Matrix is but the bottomline is this: finally there's a philosophical film that has cut through this generation.  My generation. The Wachowski brothers probably scribbled a little P.S. note when they finished the script saying: THINK FOR A MOMENT ABOUT YOUR EXISTENCE.  What is the Matrix, you ask?  Something that's closer to reality than you think.Either that or it's my personal choice for best film of all-time."
    },
    {
        "author": "MinorityReporter",
        "review_date": "2 December 2005",
        "title": " Immensely entertaining, intriguingly philosophical and just about one of the best films ever made!",
        "rating": "10",
        "review": "Writing a review of The Matrix is a very hard thing for me to do because this film means a lot to me and therefore I want to do the film justice by writing a good review. To tell the truth the first time I saw the film I was enamored by the effects. I remember thinking to myself that this was one of the most visually stunning films I had ever seen in my life. Also having always been a comic book fan and a fan of films that were larger than life, the transitional element of the story was very appealing to me and this probably heightened my enjoyment of the film very much. It wasn't until some time later (and after having seen the film a few times more) that I started to think about the film. I recognized the Christian elements quite quickly but it wasn't until I wrote an actual 15-page essay on the film that I tapped into some of the philosophical and religious elements and that made me appreciate the film even more. I won't say that I have recognized all elements because the film is quite literally packed with them.Acting wise the film works excellently. I won't say that there aren't any issues because there are but overall the acting is pretty flawless. Keanu Reeves plays the main character, Neo, or Thomas A. Anderson and while he is not the perfect actor I think he does a pretty good job in The Matrix (and the sequels). He doesn't have the longest of lines which was probably a deliberate choice from the directors and it works because this gives him a better opportunity to work on posture and facial expressions and I must say that overall his body language is very good. Very clear and well defined. Laurence Fishbourne plays Neo's mentor Morpheus and he does an excellent job of it. His lines flow with a certain confidence and style that makes his character somewhat unique and interesting. Carrie-Anne Moss does a good job as well and succeeds in looking both cool and sexy in her leather outfit. Joe Pantoliano, a critically underrated actor does a brilliant job of bringing his character, Cypher, to life. I can't say much about him because his character is pretty essential to the plot and I certainly don't wan't to spoil it for anyone. Gloria Foster appears in a relatively small role that will have greater significance in the following films and she does a very good job. The best acting is provided by Hugo Weaving, however, in his portrayal of Agent Smith. It is really something to watch him act out the changes in his character. Agent Smith gains some human traits like anger, sense of dread, hate and eventually even a sly sense of humor (mostly in the sequels). Two thumbs way up to Weaving who has created one of the finest screen villains of all time.Effects wise the film is simply stunning and it deservedly was awarded the Oscar for best effects (and was regrettably cheated out of a nomination in the Best Film category) ahead of even Star Wars. The reason that I think The Matrix deserves the Oscar for best effects is simply that the effects in The Matrix are more innovative than the ones in Star Wars. Just take a look at how many times the effects have been spoofed and you'll probably agree. The effects also help in the symbolism of the film and in creating a very dystopian atmosphere not unlike the one seen in Blade Runner and this works brilliantly. The film looks beautiful at all times and today 6 years later (my God has it already been 6 years?) the effects still hold their ground against new science fiction films. Add the effects to the brilliant editing and you have a visual masterpiece on your hands. Very well done.The reason that I think The Matrix is more reviewable than pretty much any other film is the story and the philosophical and religious elements of the story because with every viewing I catch something I didn't see the previous time I watched it. Without spoiling the film I think I can mention a few of the more obvious elements. Obviously the film draws on the Messiah myth as Neo is a clear reference to Jesus with the analogy of his name (Neo = one, as in The One) but also hidden in his other name, Thomas A. Anderson. The first part of his last name, Anderson comes from the Greek Andros meaning \"man\" and combine this with the second part of his last name \"son\" and add a little creativity you will come up with the combination \"son of man\" which was a title Jesus came up with about himself. Also the first time we meet Neo a man calls him (and I quote): \"You're my Saviour man. My own personal Jesus Christ.\" It doesn't get any more obvious than that. Aside from the Christianic elements the film also gets its inspiration from Budhism, Gnosticism (Gnosis = knowledge) but is also inspired by Plato and his analogy of the Cave and Jean Baudrillard's essay, Simulacra and Simulations. Explaining these elements would make this review go on forever so aside from mentioning them I will not comment on them further.To all the people who doubt the profound nature of The Matrix I can only give one advice: Free your mind and watch the film again. You won't regret it. If I had to choose a favorite all time film my choice would probably fall on either The Matrix (obviously I don't expect people to agree but if they do thats great) or The Lord of the Rings: The Return of the King and I recommend it to all fans of sci-fi and people who like philosophy.10/10 - on my top 3 of best films."
    },
    {
        "author": "gogoschka-1",
        "review_date": "26 July 2014",
        "title": " A watershed moment in film-making – and what a kick-ass masterpiece",
        "rating": "10",
        "review": "** May contain spoilers **There aren't many movies I watched in the theatre twice  let alone on the same day - but immediately after the credits had rolled (and still pumped up by 'Rage against the Machine'), I queued up for the next screening of 'The Matrix'. I was so blown away by that film, I feared - and probably rightly so - that I hadn't caught every detail of what I'd just seen. I later found out that many of my friends had had a similar reaction to the film, and I know virtually no one who liked the film and didn't watch it at least twice. It's simply one of those rare films that are so rich you just have to watch them several times.In structure, style and concept, 'The Matrix' was ground-breaking; it marked the first time the visual style of Manga comic books and Anime such as 'Akira' or 'Ghost in the Shell' had been successfully translated to a live-action film. Apart from 'Blade Runner', which has a totally different mood and pace (but is also a masterpiece and visionary film-making), there simply hadn't been anything even remotely like it. The jaw-dropping action sequences have such a raw, gripping energy they feel like an adrenalin overdose, but unlike most action films, they never overshadow the story; on the contrary - they enhance it and make complete sense within that universe.As for the story itself, I think this is one of the most original, fascinating Sci-Fi tales you'll likely ever see on screen. Clearly inspired by Japanese Anime and Manga yet also by authors like Isaac Asimov or Philip K. Dick, the story about humanity's war against its own creation, machines of an artificial intelligence that have evolved to the point where they have become the dominant 'species' and vastly superior to their creators, could take place in the same world as 'Blade Runner' or 'The Terminator' - albeit several hundred years later. But there is also a mythical, even religious undercurrent to the story; the themes of a prophecy, a \"liberator\" or even a \"messiah\" make 'The Matrix' transcend the Science-Fiction genre and become even more unique.'The Matrix' was a watershed moment in filmmaking  in every respect  and even though two inferior sequels have left a bit of a stain on the film, they can't distract from what an uncompromising and hugely influential masterpiece this is. Sci-Fi movies that were released after 'The Matrix' have tried very hard to achieve a similar look and tone, but the original still owns them all. 10 stars out of 10.Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
        "author": "lastliberal-853-253708",
        "review_date": "23 July 2015",
        "title": " ...it is not the spoon that bends, it is only yourself.",
        "rating": "9",
        "review": "I remember taking a class in social psychology many years ago. The Joy Luck Club figured prominently in the course. I like the idea of combining movies and theory.I am now studying metaphysics, and any study of reality begins with René Descartes, the father of modern philosophy. Descartes began his intellectual odyssey with this question: How do we know that there is a reality outside our own minds? We each know that we have experiences, and we can be sure of these experiences; therefore, each of us can be sure that we exist. But how do we know that the internal experiences we have corresponds to objects outside our minds?This is the whole theme of The Matrix. Watching this film is like studying metaphysics."
    },
    {
        "author": "SdrolionGM",
        "review_date": "3 March 2001",
        "title": " What is the Matrix? Well, one of the best films ever, for one thing...",
        "rating": "10",
        "review": "The Matrix...when I first heard about it, I expected just another sci-fi action thriller.  Good and filled with insane stunts, but not terribly intelligent.Boy, was I wrong.  Oh, the stunts are there in spades, all right, and yes, they are awesome.  And the special effects are absolutely amazing (even if similar ones have been used in other movies as a result- and not explained as well).But the movie has plot as well.  It has characters that I cared about.  From Keanu Reeves' excellent portrayal of Neo, the man trying to come to grips with his own identity, to Lawrence Fishburne's mysterious Morpheus, and even the creepy Agents, everyone does a stellar job of making their characters more than just the usual action \"hero that kicks butt\" and \"cannon fodder\" roles.  I cared about each and every one of the heroes, and hated the villains with a passion.  It has a plot, and it has a meaning...and lo and behold, a plot does help the fight scenes!  Just try it, if you haven't seen the movie before.  Watch one of the fight scenes.  Then watch the whole movie.  There's a big difference in the feeling and excitement of the scenes- sure, they're great as standalones, but the whole thing put together is an experience unlike just about everything else that's come to the theaters.  Think about it next time you're watching one of the more brainless action flicks...think how much better it COULD be.All I can say is WATCH THIS MOVIE.  If you haven't, you're missing out on one of the best films of all time.  It isn't just special effects, folks."
    },
    {
        "author": "blake-northcott",
        "review_date": "25 May 2018",
        "title": " One of the best ever. Period.",
        "rating": "10",
        "review": "By the end of the 90s, there hadn't been much in terms of fresh, new sci-fi that we hadn't seen before. Or so I thought.The Matrix combined the best of hard science-fiction with Asian cinema's frenetic and masterfully choreographed action sequences, gorgeous direction, pitch-perfect casting, and the best martial arts I'd ever seen in a Hollywood film.I don't think the sequels did it justice, but The Matrix - as a stand-alone film - remains one of my all time favorites in ANY genre."
    },
    {
        "author": "elto-30283",
        "review_date": "22 May 2018",
        "title": " One of the best movies ever! (This review is only about the original Matrix movie)",
        "rating": "10",
        "review": "The Matrix is one of the best sci-fi movies ever made!I read it used to be one of Tarantino's favourite ones too, but the second and third ones ruined the whole beautiful idea and brought the overall value of the movie pretty low.The story/philosophy is mind-blowing and the directing, special effects and the overall performance absolutely amazing. Thomas Anderson (Keanu Reeves) is an IT specialist in his day-to-day job and a hacker (alias Neo) during the night. He is looking for Morpheous (Lawrence Fishburn) who could give him the answer to the question 'What is the Matrix?' The more relevant questions to ask, though, would be \"How would you know the difference between the dream world and the real world?\" and \"How would you know if what is happening right now is not a virtual reality?\"The antagonist, Agent Smith (Hugo Weaving), is one of my favourite characters. Just watch his mouth - the way he speaks, the tone and pitch of his voice, his pronunciation, even the pauses he makes while speaking, have an incredible effect on the viewer. The concept of people being like cancer to this world is absolutely astounding.Carrie Ann Moss was the perfect choice for Trinity because any other blond, big lipped, big brested 'bimbo' would have totally ruined her character.A few more questions pop up in one's mind. \"Haven't we gone too far creating such super intelligent machines?\", \"What if they become so powerfull one day and take control over humanity?\"The acting's just amazing, all of them, no exceptions. The 4 leading characters though... (Morphy, Trinity, Neo &amp; Agent Smith) - (yes, to me there are 4 leads) - I love them all. I can't imagine the movie with any other 4 actors but L. Fishbourn, C.A. Moss, Keanu and H. Weaving. They were born to play those roles.Whoever did the casting did a terrific job. Bravo!Brilliant, absolutely brilliant!"
    },
    {
        "author": "mail-3216",
        "review_date": "8 November 2018",
        "title": " Still holds up 20 years later..",
        "rating": "10",
        "review": "Even with the new 4k hdr these the graphics and action scenes area holding up to the test of time. It not only looks better than mainstream movies today, you're hard pressed to tell what was added in visual effects and what was happening at the time of the shoot.The entire tower scene, not just the bottom level, is a thing of beauty. From all of the rain and explosions and bits flying around that you can see clearly now in 4K, to the generated explosion when the bomb hits the basement. Just gorgeous. Give it a watch, or a rewatch. It's worth it even now more than ever."
    },
    {
        "author": "ivo-cobra8",
        "review_date": "30 July 2015",
        "title": " The Matrix Is one of the best Classic Sci-Fi Action Film ever",
        "rating": "10",
        "review": "My review of the best epic Science Fiction Action film, The Matrix (1999) starring Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving, Joe Pantoliano, Marcus Chong and Gloria Foster.This was be the first movie I went to see in the movie theater with my mom when I was 15.years old, when I read in the magazines about The Matrix I was blown away and I wanted to see it right away. The Matrix is the best action sci-fi films that Keanu Reeves made in the 90's. It is one of my personal favorite movies. The Matrix is a (1999) American science fiction action film written and directed by The Wachowskis, starring Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving, and Joe Pantoliano. It depicts a dystopia future in which reality as perceived by most humans is actually a simulated reality called \"the Matrix\", created by sentient machines to subdue the human population, while their bodies' heat and electrical activity are used as an energy source. Computer programmer \"Neo\" learns this truth and is drawn into a rebellion against the machines, which involves other people who have been freed from the \"dream world\".Written and directed by the Wachowski brothers, this classic sci-fi action film stars Keanu Reeves as a lowly computer programmer who discovers his entire existence, and that of all mankind, is nothing but a simulation in a computer. The reality within a reality is a concept that's done before... but never like this - The Matrix requires absolute attention from his audience, least you'll be completely lost in a few minutes. With the help of supporting cast members Laurence Fishburne and Carrie-Anne-Moss, Reeves discovers that inside this simulation environment known as The Matrix, he can control, bend, and manipulate space-time... resulting in some of the most incredibly iconic images to ever grace the silver screen. The slow-motion \"bullet-time\" effects as they're known today were groundbreaking and revolutionary when we first saw them 12 years ago. Although Reeves is notorious for his inability to really convey much emotional range, his character here lends itself well to him as an actor. This is a movie that makes you think, makes you gasp, and makes totally forget where the 136-minutes went after finishing it. It's no wonder this film spawned two very successful sequels, and dozens of copy-cats. The Matrix, \"Visually revolutionary, and mind-blowing.\" Keanu Reeves plays the main character, Neo, or Thomas A. Anderson and while he is not the perfect actor I think he does a pretty good job in The Matrix. He doesn't have the longest of lines which was probably a deliberate choice from the directors and it works because this gives him a better opportunity to work on posture and facial expressions and I must say that overall his body language is very good. Very clear and well defined. Laurence Fishbourne plays Neo's mentor Morpheus and he does an excellent job of it. His lines flow with a certain confidence and style that makes his character somewhat unique and interesting. Carrie-Anne Moss does a good job as well and succeeds in looking both cool and sexy in her leather outfit. Joe Pantoliano, a critically underrated actor does a brilliant job of bringing his character, Cypher, to life. He also played the roles in Underrated Daredevil (2003)and Bad Boys I &amp; II. I can't say much about him because his character is pretty essential to the plot. Gloria Foster appears in a relatively small role that will have greater significance in the following films and she does a very good job. The best acting is provided by Hugo Weaving, however, in his portrayal of Agent Smith. It is really something to watch him act out the changes in his character. Agent Smith gains some human traits like anger, sense of dread, hate and eventually even a sly sense of humor. Two thumbs way up to Weaving who has created one of the finest screen villains of all time.Effects wise the film is simply stunning and it deservedly was awarded the Oscar for best effects (and was regrettably cheated out of a nomination in the Best Film category) ahead of even Star Wars. The reason that I think The Matrix deserves the Oscar for best effects is simply that the effects in The Matrix are more innovative than the ones in Star Wars. Just take a look at how many times the effects have been spoofed and you'll probably agree. The effects also help in the symbolism of the film and in creating a very dystopia atmosphere not unlike the one seen in Blade Runner and this works brilliantly. The film looks beautiful at all times and today 16 years later (my God has it already been 16 years?) the effects still hold their ground against new science fiction films. Add the effects to the brilliant editing and you have a visual masterpiece on your hands. Very well done.The film also won 4 Academy Awards including for best visual effects. \n10/10 for one of the best epic American science fiction action film's in the history movies like this and Aliens (1986) don't exist anymore. It is one of my personal favorite movies, it is the movie I saw with my mom in the movie theater it is memories on my mom who is no longer with us anymore and I miss he."
    },
    {
        "author": "emptyskies",
        "review_date": "23 April 2002",
        "title": " The more you watch it, the better it gets",
        "rating": "10",
        "review": "The Wachowski brothers really did excel themselves with this movie. It's a brilliant movie on a number of different levels - the directing is excellent, the camera work is great, the visuals are stunning, the kung-fu is A+, acting is executed with style and conviction, and the plot is truly inspired. It's really hard to use enough superlatives on this movie!It'd be a 10/10, except for the ending. Having Neo do what he does at the end really lets it down, in my opinion. However, there's a couple of sequels on the way, so let's see what the Wachowskis can do to make up for it.Other than that, (and like I said above) the movie is operating on so many different levels that each time you watch it, you pick up something new... this isn't by accident, either. The Wachowski brothers had the actors read a number of definitive works (Simulation &amp; Simulcra was one I believe) in modern literature and psychology, and applied liberal dashings of aspects of the major religions to provide the best sci-fi movie of the decade, if not ever.I'm yet to meet somebody who hasn't enjoyed it. It's my favourite movie to watch on a good cinema system, too."
    },
    {
        "author": "Pessimisticynic",
        "review_date": "3 April 1999",
        "title": " Stunning and wild...",
        "rating": "9",
        "review": "It's been a while since a movie has generated enough interest in me for me to watch it.  \"The Matrix\" looked exciting enough in the trailers, so I decided to give it a look.  What I found was an amazing movie, with some of the greatest special effects I've ever seen.  The camera angles really work for the action sequences and the choreographed fight scenes made me yearn for more.  Say what you want about Keanu Reeves' acting.  He may not deliver the best dialogue, but his look can carry a film.  He was a great choice for the role of Neo.  Carrie Anne Moss was great as was the underrated Laurence Fishburne.  I highly recommend this film for those who are a fan of visually stunning movies.  It will blow away your senses..."
    },
    {
        "author": "Xophianic",
        "review_date": "2 February 2000",
        "title": " One of my favorites",
        "rating": "10",
        "review": "At first, I wasn't interested in seeing the Matrix. But after hardly hearing any bad reviews for it (and believe me, I hear bad reviews for every movie I enjoy) I decided to give it a try. At first, although I really loved the fights, graphics and characters, the plot confused me. (Anyone confused by the plot at all should go to www.knowthematrix.com and you'll find out everything you could want to know) By the second time I watched it, I really understood it, which made the movie even more enjoyable.I really loved this movie. Just about every character, good or bad, is very interesting and cool. The acting was excellent. Even though I think this was Keanu Reeves at his best, the best acting jobs were done by Laurence Fishburne (Morpheus) and Carrie-Anne Moss (Trinity). Hugo Weaving did an excellent job as Agent Smith and Joe Pantoliano was great as Cypher as well.The plot is one of the best movie plots I've seen in a movie. An accountant by day, computer hacker by night guy suddenly finds out that reality as we know it is fake and that we are actually in a giant computer program run by robots (that we created, of course) in order for them to get power. Not only that, but he finds out that he is one who is, according to prophecy, going to put an end to it. The greatest thing is that you learn things just as Neo does, so you can really relate to his character.My favorite thing about this movie is that no matter how many times you watch it, you will learn more about it. I guarantee this. Some may not like this movie because the plot is too complicated, but I recommend that anyone who enjoys movies should go buy this one right away."
    },
    {
        "author": "wolf_wallace",
        "review_date": "29 March 2000",
        "title": " Raises the bar for sci-fi films for years to come",
        "rating": "10",
        "review": "The Wachowski Brothers vision of a possible future takes the visual and sound aspects of filmmaking to a new high. Incorporating older still photography with computer enhancement to the degree that appears on the screen has raised the genre to a level that will be very hard-pressed by filmmakers for a number of years. Acting was wonderful, script, visual, sound, everything about this film is a tribute to a usually overlooked genre."
    },
    {
        "author": "MercurioKnight",
        "review_date": "27 April 2000",
        "title": " A great epic that sets the stage for the next level in sci-fi...",
        "rating": "10",
        "review": "Who is to say what is real or not? We are defined by our view of reality, no matter how twisted or demented it is in comparison to 'normal' people. *evil eye* Yes, I see you all, looking in the mirror, trying to decipher whether or not your view is the reality we all share.The Matrix not only supplies the world with a whole new level of special effects mixed with style and substance, it also brings a whole new meaning to the word 'paranoria'. This is one of those great epics that becomes a milestone in our present day world, a mark for which just about everybody can appreciate. Not since the original Starwars trilogy has a science fiction film reached across almost the entire population and gripped it with awesome special effects, great sound, and a overall feel of ground breaking movie making magic. It also serves up a good dose of paranoid delusions we all need in our lives every now and then.With that, I leave you with the fact that I've seen more different types of people liking this one film than most other films to date. Move over George Lucas, you may have just met your match... :)"
    },
    {
        "author": "RichardRowell328",
        "review_date": "30 January 2005",
        "title": " True Cinematic Achievement",
        "rating": "8",
        "review": "In the year 1999, \"The Matrix\" and \"Fight Club\" were undoubtedly the best films of the year. The Matrix was truly revolutionary in special effects, specifically in CGI (Computer-Generated-Imaging) technology. The still cameras that were used to capture multiple angles of a single shot, in bullet-time technology, was a creative new approach. The film is initially suspenseful with people not knowing quite what was happening until Morpheus (Lawrence Fishburne) reveals that Neo's (Keanu Reeves) reality was actually a fabricated world that is an elaborate simulation created by machines. Neo and the majority of the world's inhabitants have been stuck in simply a mental simulation prison. The magnitude of philosophy in sync with special effects make \"The Matrix\" a one-of-a-kind movie masterpiece. College classes show this movie in their philosophy class, and at the same time can prove to be one of the best special effects movies ever. Supplementally, \"The Matrix\" also provides endless action and a pretty solid storyline that influences the philosophical ideas in the movie. There are so many great things in this movie, it is just crazy.The color palette along with the time and effort put into stunts also accelerates this movie on all filming levels. \"The Matrix\" leaves the viewer a sense of pride in the world he/she can live in to just know that people are capable of creating at this level. Unfortunately, monetary and timing motives offset the potential quality of the sequels. \"The Matrix Reloaded\" and \"The Matrix Revolutions\" were just a waste of time and weren't carefully thought out, as was the first Matrix. 10/10"
    },
    {
        "author": "ShinKyo81",
        "review_date": "31 October 2018",
        "title": " Let's ponder on the influence of \"The Matrix\" to the whole industry...",
        "rating": "9",
        "review": "It is funny how it has been 15 years since \"The Matrix Revolutions\", bringing the movie trilogy to a close. I wrote reviews for it and \"Reloaded\" as well back in 2003 and I realized that I had never written a few lines for the first movie. Well, here I am.I will keep it short. We all know how good \"The Matrix\" is. The plot, the visuals, the mythos, it all adds up to a movie experience that is timeless. Almost 20 years later, it now has a \"retro\" vibe that makes it more interesting, with late 90s cars, rotary phones, Nokia cells and CRT monitors.Today sets the 4K HDR release of the trilogy. Coming back to \"The Matrix\" after probably 10 years since my last viewing, it is a constant reminder of how the Wachowski's masterpiece shaped up the movie industry and its echos are still felt today.A true timeless piece of movie history."
    },
    {
        "author": "dogg01",
        "review_date": "19 July 2000",
        "title": " Guns. Leather. Keanu Reeves. How cool can it get?",
        "rating": "10",
        "review": "You walk into this film not knowing what the Matrix is. You take your seat and watch the trailers. The green Warner Brothers (green? you ask) trademark comes up, and without warning you are thrust into the Wachowski brothers grand vision. 2 hours of excitement later, you stumble out of the cinema, knowing what the Matrix is.This is one great movie. Keanu Reeves is cooler than cool as Neo. The Wachowski brothers skilful direction is brilliant. The special effects sequences will blow you away, did I mention the government lobby scene?The film starts off with a 'what is real?' first half, and then the first kung-fu sequence makes way for an action- packed, John Woo-esque second half with slomo and style cranked up all the way to the top. Did I mention the government lobby scene?Keanu becomes Cool Keanu, Carrie-Anne Moss is a real find and Hugo Weaving is perfect in his against typecasting role as the evil Agent Smith.You may notice in this review that I have not revealed what the Matrix is. Like the trailer says, 'You have to see it for yourself.'Excellent. Best film of '99. 9/10."
    },
    {
        "author": "sysadslive",
        "review_date": "28 October 2018",
        "title": " Top Firm",
        "rating": "9",
        "review": "Matrix till this day is one of my most watched movies of all time."
    },
    {
        "author": "jaimeplaton",
        "review_date": "12 October 2018",
        "title": " Best movie ever",
        "rating": "9",
        "review": "When we will see another movie with the same speed? So deeply philosophical? Sadly, the most likely answer is... NEVER"
    },
    {
        "author": "rik8888",
        "review_date": "6 December 1999",
        "title": " Excellent film, makes my top 5 modern films",
        "rating": "10",
        "review": "Right there with Seven and Silence of the Lambs for me.  I love this film, and rate it a notch above some of the other great action films of our time (i.e., Terminator, Predator) because it has a really well thought out (although moderately unbelievable) story line.  A lot of thought provoking material, and some interesting subtleties. I've seen it 10 times (I don't usually watch a movie more than once), and I'll watch it a few more. Enjoy!"
    },
    {
        "author": "johnfos",
        "review_date": "11 June 2005",
        "title": " The Matrix has Buddhist themes",
        "rating": "10",
        "review": "A large part of the appeal of 'The Matrix' for me was the special effects and action-packed scenes. But, on reflection, part of the appeal is also its philosophical and religious underpinnings...When asked whether Buddhist ideas influenced them, the Wachowski brothers offered an unqualified \"Yes!\" and at a very basic level, the movie portrays two levels of reality: our everyday existence and a deeper, more significant, underlying reality (the matrix). This is very much like the Two Truths in Buddhism: relative truth, in which everything is perception, and ultimate truth which is the way things really are (objective reality). Because of our ignorance, we mistake the everyday world for something real and objective, and this is the cause of our suffering. As in 'The Matrix', breaking through relative truth to direct contact with ultimate truth represents a high spiritual attainment, some would say enlightenment, an awakening. (Remember the message on Neo's computer screen: \"Wake up, Neo!\")Mahayana Buddhism suggests that there are great spiritual warriors (like Neo?) who are walking the path from ignorance to enlightenment, and who can in turn guide us on the path."
    }
]