[
    {
        "author": "bhavninder",
        "review_date": "5 October 2018",
        "title": " Chest Paining, 2.5 hours RollerCoaster Ride",
        "rating": "10",
        "review": "I watched Ratsasan today and was compelled to review and ask movie buffs to add this masterpiece thriller in their wish-list. \nThis is a rollercoaster ride which doesn't let you comfortably sit in your seat. This is the longest rollercoaster I have ever sat on. Very gripping narrative, with a mind numbing, soul quenching background score. From cinematography to editing to acting, all in all a masterpiece.\nMovies first half ends at a point, where you are hungry to discover the killer but the second half leaves you at the edge of your seat until you reach home, still in the reminiscences of the killer, one struggles to sleep. \nYes, all of this despite being completely unfamiliar with Tamil language."
    },
    {
        "author": "saikrishnanramakrishnan9",
        "review_date": "13 October 2018",
        "title": " The edge of seat thriller after a long time which is scarier than many horror movies.",
        "rating": "9",
        "review": "The main advice for watching this film as said in Idharkkudhaane aasaipattai Balakumara \"It should not be watched by 1) People less 18 of age\n2) Pregnant ladies\n3) Heart patients\"Though it's not a Horror film, the movie is scarier, especially second half.Story: The movie started as a usual crime film, but tone became darker when the movie started to progress. The backstory of Psycho was good.Screenplay: The screenplay in this movie is engaging and brilliant. First half seems to be normal. But, the true fear starts in its second half, though there are very few loopholes.Music: The best one about the movie is its BGM. 80% of the fear is because of its BGM. The dark music which completely matched the film. Gibran again proved himself to be the best music director.Acting: All actors did their best. This is the best movie ever for both Vishnu Vishal and Amala Paul in terms of acting. All the other actors dedicated well.Other things: The runtime in this movie is too long which is around 2 Hours and 50 minutes. But one doesn't feel that the movie is dragging, because of the engaging screenplay. Each and every scene in this movie is essential. Moreover, editing was crispier which added more thrill to the film.On the whole, it would be a great movie if you watch it in theatre.My rating: 4.5/5"
    },
    {
        "author": "aravindprasannan1995",
        "review_date": "6 October 2018",
        "title": " A movie made with a lot of heart... 10/10",
        "rating": "10",
        "review": "Great plot, good execution, and great performances made this a memorable outing for me...First of all, would love to see Vishnu Visal going forward selecting good stories like this. Indru Netru Naalai was a similar selection from him. Here too, he selected a proper psycho-thriller, which I haven't seen executed this well in recent years in Indian cinema. Making a 2hr 45 min long movie takes guts these days. It shows how confident the director was, with the content.A lot of set-ups and pay-offs are there in the movie, which spring up every now and then making it interesting. The BG Score by Ghibran was great, kept me glued to the screen. The children performed so well in their respective roles, and so did Amala Paul, Kali Venkat, Nizhalgal Ravi, etc.. The twists were believable, and not the familiar one-twist saves all kindof mediocre stuff. It tests your observation throwing stuff right in front of your eyes, and hiding them perfectly. Worth a watch..."
    },
    {
        "author": "mobf-15020",
        "review_date": "9 October 2018",
        "title": " Outstanding, amazing thriller in Tamil history",
        "rating": "10",
        "review": "Must watch movie.....When i saw the movie, i can feel my hearbeat sounds faster. Each and every short,vishual's is outstanding &amp; perfect, \nNo words to say..., 100%% sucess.....movei,\nspoilers Please dont degrade this wonderful\nMovei."
    },
    {
        "author": "sree_thala",
        "review_date": "8 October 2018",
        "title": " Gibran is the Real Ratsasan - BGM haunts you",
        "rating": "9",
        "review": "After Deeran, yet another highly impactful movie which gets elevated by Gibran's BGM. The antagonist detailing was so perfect and this Indian movie will surely give you goosebumps like hollywood thriller Seven etc., A must watch for any language viewer who loves psychological thrillers. Thumbs up"
    },
    {
        "author": "Fella_shibby",
        "review_date": "7 February 2019",
        "title": " Shud hav trimmed the length n removed the lousy slow motion scenes. Nevertheless, a captivating serial killer film with terrific music n a hot actress.",
        "rating": "8",
        "review": "I came across this title on IMDb n the synopsis piqued up interest.\nAs a fan of serial killer films n aft seeing almost every Hollywoood, Korean, Spanish n German serial killer films, I can vouch that this film is well made for fans of the genre.\nI am not familiar with any of the star cast, director or people involved with this film. The lead actor is decent n the actress very hot.\nThe plot is about a man who is obsessed with serial killers n who wants to join film making business but out of family pressure has to join police police force. At the same time there is a serial lurking in the cops's precinct killing young girls.\nThe female who played the cop's sis cannot act for sure.\nSome of the action sequences were laughable n also the last scene with the cop n the killer face to face n the then hide n seek n the action was a bit lousy.\nThe house of the killer had a creepy feel to it n there is sufficient tension n suspense.\nThe background story of the killer was given too much time, in fact the problem with Indian cinema is that they spoon feed too much but thank God there were no lousy songs n unnecessary muscle flaunting.\nThe film deserves a 7 but I am a bit generous with an 8 cos of the effort."
    },
    {
        "author": "santhoshcoolst",
        "review_date": "9 October 2018",
        "title": " Best psycho thriller",
        "rating": "10",
        "review": "Director maintain thin line without crossing the violence... He conveyed the violence in musics, which makes the movie a real psycho thriller... \nVishnu not played in the role of COP (HE LIVED AS COP)"
    },
    {
        "author": "hanumansreeram",
        "review_date": "6 October 2018",
        "title": " Nailed it",
        "rating": "10",
        "review": "A dictionary to the upcoming suspense/thriller movies."
    },
    {
        "author": "sangamithra-21312",
        "review_date": "8 October 2018",
        "title": " Ratsasan a exhilarating movie!",
        "rating": "10",
        "review": "Great script and congrats to Ram. Watched the movie and was thrilled and felt I was experiencing the scenes along with Vishnu. No flaws and even if there were it was not visible..\nEvery week there are movies releasing, this was not one among them. It's unique and hats off to the entire team."
    },
    {
        "author": "ddhanushram",
        "review_date": "15 October 2018",
        "title": " One of the best movies in tamil cinema!!!",
        "rating": "10",
        "review": "This is a rare kind of movie where in you get hooked to the movie right from the beginning to the end..Movies like this come once in a blue moon in Indian cinemas..Ratsasan is a gem equally as effective as that of hollywood thrillers in terms of technical work\nPositives:\n1.Ghibran:Man!!! He is the backbone of the movie..his music intensified the thrill..Terrific BGm\n2.Story:I don't think find tamil movies with script as strong as this one..You will get deceived multiple times because of the twist\n3.Vishnu:He lifts the movie with his shoulders but I feel bad for him as he is too much underrated..Talented personalities like him should be recognized well by audience rather than praising the few people who does the same kind of role repeatedly\nNegatives:\nAmala Paul:I don't know the reason why she was in the movie..No role for her\nRomantic scenes:Could have been removed to make this as a cult thriller\nOverall this movie was just awesome..Watch it and you will never regret going to it"
    },
    {
        "author": "shibilchavarattil",
        "review_date": "17 November 2018",
        "title": " The best!!! A benchmark set.",
        "rating": "10",
        "review": "A benchmark set for next upcoming psycho thrillers."
    },
    {
        "author": "jgkrishnak",
        "review_date": "3 November 2018",
        "title": " Highly recommended for thriller genre lovers",
        "rating": "10",
        "review": "Definitely gives you the impression of one of the greatest thriller in Indian cinema"
    },
    {
        "author": "krish-lararaider",
        "review_date": "7 October 2018",
        "title": " A Stellar Thriller!!!",
        "rating": "9",
        "review": "Gritty, Dark, Compelling and Unforgiving.... Raam Kumar has done it again!!! This is from the guy who gave us \" Mundasupatti\".. Hats Off Director! And the performances are Top Notch!!! A Milestone in Vishnu Vishal's Career. It has some tiny teeny flaws that can definitely be forgotten.As far as Killer/Slasher movies go in Tamil, this will be remembered for a long Time. Don;t miss it...."
    },
    {
        "author": "narayanan-16120",
        "review_date": "5 October 2018",
        "title": " Best tamil crime movie",
        "rating": "10",
        "review": "An unexpected scene ,crime thriller, back ground music always super"
    },
    {
        "author": "sharaf-innovazions",
        "review_date": "2 November 2018",
        "title": " My head is still spinning !!",
        "rating": "10",
        "review": "What a movie !!! No words to describe the on-screen performances, direction and the amazing background score. Start to end you will be glued to the movie. Hats off to everyone involved. A must watch for any movie lover."
    },
    {
        "author": "barnwal-usa",
        "review_date": "26 December 2018",
        "title": " Haunting, Intense, Best thriller Indian movie",
        "rating": "10",
        "review": "This is amongst the best thriller movie to come out of India. Period.Now I'll rant a little. I'm a Hindi speaker. Why can't bollywood make even close to such movies. Nepotism and Khan kapur nexus has destroyed our movie industry!!"
    },
    {
        "author": "karmjit",
        "review_date": "19 December 2018",
        "title": " Tense thriller",
        "rating": "9",
        "review": "Very nicely written and directed.\nMust watch who like suspense in the movies. Will keep you guessing till the end.\nsome scenes are so powerful, like never seen stuff before."
    },
    {
        "author": "chaitumhyd",
        "review_date": "30 November 2018",
        "title": " Made me nervous.",
        "rating": "10",
        "review": "Excellent movie with great action and script. Made me very nervous though."
    },
    {
        "author": "harisumanth",
        "review_date": "20 November 2018",
        "title": " Exceptional thriller!",
        "rating": "10",
        "review": "Awesome!! The story, acting, music and cinematography, everything is top notch!!"
    },
    {
        "author": "shriharijawahar",
        "review_date": "20 November 2018",
        "title": " Great Direction",
        "rating": "10",
        "review": "One of great Tamil movie based on direction and screenplay."
    },
    {
        "author": "koushikswarup",
        "review_date": "19 November 2018",
        "title": " Must watch",
        "rating": "10",
        "review": "One of the best movie in South india. The way the story potrayed is fantastic with regular twists. Super story"
    },
    {
        "author": "warrior03",
        "review_date": "8 November 2018",
        "title": " Must watch!!",
        "rating": "10",
        "review": "Thriller at its finest !! Till very end the twist and turns are not revealed just when you think mystery solved interval block. Kudos to director and well acted cast."
    },
    {
        "author": "trajkumarkumar",
        "review_date": "13 November 2018",
        "title": " Oh boy!!!",
        "rating": "9",
        "review": "Usually Hollywood movies in my mind all the time, but this movie not getting out of my mind."
    },
    {
        "author": "Amyth47",
        "review_date": "7 December 2018",
        "title": " STYLISH, FAST-PACED AND FULL OF TWISTS. FANS OF THRILLERS DO NOT MISS THIS ONE!",
        "rating": "10",
        "review": "My Rating : 10/10 ♠ MASTERPIECE ♠To begin with, I generally refrain from giving a 10/10 rating to every movie I happen to fall in love with immediately but this here is an exception. One of the main reasons being that not a single second is boring and the speed with which the narrative moves is refreshing for its 2 hrs 25 mins runtime length. The other being that I am always looking and searching for a good thriller that lights up parts of my brain in all the wonderful ways only a thriller can.This certainly went above and beyond my expectations. Watching 'Ratsasan' is like going on an exhilarating rollercoaster ride which doesn't want to end until the viewer is satisfied and has been left completely quenched from their craving for a thriller. It is unique and infinitely creative as far as storytelling goes for the thriller genre.'Ratsasan' defines what edge-of-your-seat really means. It masterfully balances all the elements of a great thriller with an intelligence and style that only a handful of movies have mastered as of yet. 'The Silence of the Lambs' and 'Se7en' come to mind and in recent times 'Gone Girl' and 'The Invisible Guest'.'RATSASAN' IS ONE OF THE BEST THRILLERS I'VE EVER SEEN.10/10."
    },
    {
        "author": "imrahuljan",
        "review_date": "18 November 2018",
        "title": " Fantabulous!",
        "rating": "10",
        "review": "The film is a limited edition.\nIf there's a book of how a thriller film should be made, this movie would be a perfect example!\nFrom story to execution, the film deserves a standing ovation!\nKudos to the team!"
    }
]