[
    {
        "author": "mithesh2020",
        "review_date": "1 October 2010",
        "title": " Superb action packed movie with stunning graphics",
        "rating": "10",
        "review": "Enthiran will keep u by your seats till the end.The movie plot is decent and the superb directing by Shankar along with our superstar Rajini's acting makes this a masterpiece.....I saw this movie on first day at pondicherry and i never seen a crowd like this before.The film's story revolves around a scientist's struggle to control his creation, an android robot whose processor was upgraded to give it the ability to comprehend and generate human emotions, from further sociological mishaps. After setting its eyes upon a beautiful woman, the robot develops love for her, who also happens to be the love interest of the scientist, which creates a conflict between the two. It released worldwide on 1 October 2010...........A must see film..............."
    },
    {
        "author": "kimian",
        "review_date": "1 October 2010",
        "title": " Robo - Man, machine, magic",
        "rating": "10",
        "review": "All is grand and great with 'Enthiran'. From frame one till the last, there is enough thrill, spill and chill that one would normally associate with Rajinikanth. Perhaps it is double here. The magic of Rajinikanth and the aura of Shankar have been combined well to weave a magic on screen.Come to describe Rajinikanth in Enthiran, we may run short of adjectives and adverbs. As scientist Vaseegaran and as robot Chitti, the top actor sizzles. He is cool and suave as Vaseegaran. More intellectual and stylish, he charms one and all.Sporting a stylish beard, Rajinikanth appears in trendy costumes in flashy colours. He has exemplary energy and enormous screen presence quite like any other films of him in the past.Not far behind is beautiful Aishwarya Rai Bachchan, who missed few chances before to act with Rajinikanth. In 'Enthiran', she is cool and casual. The beauty with brains lends dignity to her role.Walking away with applause is Mozart of Madras A R Rahman. All his songs are catchy, foot-tapping and trendy. The songs like 'Kadhal Anukkal.', 'Robo Dance', 'Boom Boom' or 'Kilimanjaro', all evoke thunderous applause. Rahman's mastery in blending orchestration, harmony and rhythm add pep to all the numbers. The lyrics too compliment the songs and the theme of the movie. The legend in Vairamuthu, his novice son Kargy and Pa Vijay deserve applause.Come to master of the ship – Shankar. The man of many achievements, who brought grandeur to Tamil cinema, has lived up to his reputation. His dream project which eventually hit the screens is nothing short of fun, frolic and excitement. Known for handling mass themes with much ease, here he combines such elements with science. A theme never heard before in Indian cinema, Enthiran, is nothing but a milestone movie. Shankar has added one more jewel in his crown."
    },
    {
        "author": "prem-citit",
        "review_date": "30 September 2010",
        "title": " Will make history in the Indian Cinema",
        "rating": "10",
        "review": "Enthiran movie is going to make history in the Indian Cinema. The south Indian superstar once again gonna rock in the Indian theaters as well as in the foreign theaters where superstars fans assemble to witness his extraordinary acting with his attractive style. The ace director Shankar has did his best to make his wild imaginations to come into reality by using his technicians and the Stan Winston studio in US which no other Indian film has made its entry into it. Superstar Rajinikanth is in the negative role again after decades which is going to entertain and fulfill the hype and expectation to all his die hard fans around the globe Aish, Oscar winner AR Rahman have given the best to ensure this movie to make history. The action sequence in the movie is going to keep the audience at the tip of their seats till the end of the movie. Sit relaxed and enjoy the movie!!! Wishing the Superstar and his unit a grand success by making the first Indian Sci-fi movie to compete with the Hollywood blockbusters."
    },
    {
        "author": "mkothamangalam",
        "review_date": "30 September 2010",
        "title": " Rajini...the one and the only SUPERSTAR",
        "rating": "9",
        "review": "Can you always get the best results with the best ingredients? The answer is YES, YOU CAN. Provided you have an actor/superstar who listens to his director, an actress/global celebrity who just glows on screen throughout the movie and if the big budget is totally justified.All the credit for this extravagant movie goes to Shankar Shanmugam. The man is an absolute genius. His creativity reaches great heights with this movie and elevates the Indian movie standard to an all time high. With every movie of his, the scale of movie-making grows tremendously. He got the best technology money can buy. Looks like the majority of the budget is spent on Animatronics and this movie has got plenty of that. Rajinikanth is magnificent in this movie. In fact, he is the movie. He adds life to every single frame created by Shankar. Aishwarya does what she does best, look GORGEOUS.She has some pretty slick dance moves in the songs.The Animatronics are the best you could find in any movie so far and not just an Indian movie. The songs are spectacular. Shankar shows the audience some of the best places in the world all for a few bucks. The locations are mind-blowing and totally unique to this movie. Shankar handpicked the locations for the songs and they are shot on a grand scale. The music is haunting and highly entertaining. This movie will surely become one of the biggest movies ever made in India and without a doubt bring in a lot of moolah to the producers, distributors and the exhibitors all around the world. Rajinikanth redefines super stardom. Truly, a legend of a man."
    },
    {
        "author": "sathish_tom",
        "review_date": "25 September 2010",
        "title": " Endhiran...The Greatest Blockbuster of Indian Cinema!",
        "rating": "9",
        "review": "Endhiran, The Robot is definitely going to be a Biggest Blockbuster of Indian Cinema. 1. Budget is $35m, most expensive movie in Asia.2. 2250 prints, 3000 screens, largest worldwide screening after 'Spiderman'.1400 screens in Tamil Nadu alone including 48 out of 52 screens in Chennai.3.In three language versions, Tamil,Telugu &amp; Hindi.4. The special effects are as good as Hollywood movies like Terminator, Matrix, Godzilla which is composed of 1500 graphical shots.5. Double Academy Award Winner AR Rahman has scored the music.This is a story of android based humanoid named Chitti.The first part in Endhiran movie has lot of surprises and rest half has actions and rides. In Endhiran, Rajni plays double role. One is a scientist and another is a Robot. Scientist Rajni creates a Robot with artificial intelligence like that of sixth sense in humans to help human beings and to the development of the country.But its silicon heart falls in love with Aishwarya Rai. Writes romantic poems and the Robot behave just like a human being. Knowing about the extra ordinary intelligence of the Robot the villains try to get control of the Robot. The last 30 minutes of the film are literally the grandmaster of all make-believe and end up creating a whole new genre of cinema: the 'curry eastern' which stands up as a wholesome alternative to the curry western. For Rajnikanth fans, the climax is definitely a sure-fire way to lose your sanity.For non-Rajnikanth fans, it's a sure-fire way to understand the mystique and magical allure of Rajni sir, a hero who enjoys a demi-god status in several parts of India. Why? Because there are almost a hundred Rajnikanths eating up helicopters, smashing cars, battering planet earth and creating havoc, like never before. If you thought Terminator, Matrix, Godzilla was fun, then we guarantee you'll fall off your chair with glee as our desi T2-meets-Blade Runner-meets Neo-meets-Godzilla sets the screen on fire in a crazy, vengeance bid. Spoofy, yes. But super fun too.Robot is primarily designed as an unadulterated tribute to the charisma of Indian cinema's ageless superstar, Rajnikanth. And it's completely, wholeheartedly, joyously desi. Where else would you find a hero who literally shoots with his fingers! What's more important is the fact that you actually don't mind when the bullet whizzes out of his forefinger and hits the man in front in the head. Instant death! Ha Ha!The high point of Robot are the super quality special effects. All the Spiderman, Batman and Superhero antics of Rajnikanth have been done with exquisite elan by the Stan Winston Studio which reportedly provided the animatrics for films like Jurassic Park and Avatar. And all the stunts have been choreographed by Yuen Woo Ping, the Hong Kong based action director who created the high-adrenalin stunts of classics like Kill Bill and Matrix. Almost 40 per cent of the film's colossal budget (Rs 160 crores) has been spent on special effects, which, at the end of the day, seems all worthwhile. For watching Rajnikanth running horizontal on a speeding train, clambering across burning buildings like Spiderman or mutating into gargantuan monsters does manage to shock and awe the viewer who's out there to have big time fun.But Robot isn't effect alone. It has a plot too which, if you really pay attention, has a meaning and a message. The film carries forward the man-machine war through interesting twists and turns and creates a lively love triangle between scientist Rajnikanth, medico student Aishwarya Rai and robot Rajnikanth. Interestingly, the duo make an interesting pair, what with Rajni sir's sundry wigs and sideburns and Aishwarya's tribal 'Kilimanjaro-Mohenjodaro' attire. You might just overdose on the pungent masala fare. Have a blast.For Tamil audience, this movie is a definite 10 out of 10!"
    },
    {
        "author": "eas-rao",
        "review_date": "1 October 2010",
        "title": " Its Rajni at his best.",
        "rating": "8",
        "review": "Amazing, extravagant, intelligent, beautifully conceived- executed treat for all fans of Rajni and people who understand and enjoy the Indian masala movie!!!! Shankar has hit the jackpot, the mother lode this time with this stunning film which is going to open huge vistas for Indian cinema. Rajni is the soul of the film and my god he delivers and HOW!!! The last 45 minutes are simply cracking for his enactment of the anti hero as only he can and does. My only regret in the film was that they seemed to have required not 200 but 400 crores to really deliver in the stunt sequences in the 2nd half! But even still, magnificent achievement with an absorbing story line which keeps you engaged and rollicking in your seats till the last frame. Aishwarya seems to get more attractive with each passing year! This is the only event (Rajni) apart from cricket in India where absolute strangers on the road, in the theatre ask each other questions on how the movie was and talk like long lost friends on any subject under the sun."
    },
    {
        "author": "vrnr",
        "review_date": "1 October 2010",
        "title": " BEST SCI-FI Movie in Asia - Rajini Rocks...",
        "rating": "9",
        "review": "I just came out from seeing the first day first show....Endhiran at Kasi theater in chennai. The movie started early morning at 4:30. Never seen a huge crowd like this ever before in chennai for a movie, that too early before even sunrise. The movie is 100% adrenalin rush action with Rajini's and Aiswarya's stunning performance. The graphic sequences are awesome. Its very difficult to distinguish graphics from reality. Last 1hr of the movie reminds us of 'the matrix'. The songs are picturised in a spectacular way. The movie is a super-hit in all possible angles. See it before others do. I mean to say watch it to believe my words."
    },
    {
        "author": "psarjun",
        "review_date": "1 October 2010",
        "title": " Not a Master Piece but a Path Breaking with its Breath taking Visuals.",
        "rating": "9",
        "review": "Rajini KanthMagic: Whats Magic? Its a Power to make you sit and watch a Person is doing and here it is... Its Sheer magic of Rajini. He had given us a Completely new Indian film. This Movie will prove in all ways, who is the super star of India.Endhrian Movie ReviewYou would have heard about Western Style, Western Movie etc.. Now, here after there is one more, That is Eastern, its Eastern Style, the RAJINI Style. Rajini and Shankar will always be remembered as the Persons responsible for making a movie that will literally reduce the gap between Hollywood and Indian Movies. They are responsible for the Giant Step Tamil Film Industry had taken.Endhiran is Indian and is Desi meets western and let we call the new genre of film making as Eastern.The Highlight of the Endhrian is its Special Effects, that you can match this movie with any Hollywood movies. Yes this movie is - perhaps the first Indian Science Fiction movie which is successful and high in Special EFX. Here all Spidar Man, Hancock, Hulk, Superman become one man and its amazing that for the first time we are going to accept an Indian Desi Hancock. Its hard to identify Special Efx used in most of the Scenes. The Special Efx in the last 45 Minutes is breath taking and very creative, not taken or inspired from any Hollywood movies like Blade or I Robot or Spider Man or Hancock. He had introduced a new Genre and which is going to be repeated in the future, this movie is going to inspire many and many Future Indian film Directors.The Movie is Big, Grand and Explosive. Final 15 or 20 Minutes will keep you at the edge of your seat. You will witness the greatest ever SP EFX Indian Movie or even Asian movie.Dialogues: Dialoges are very good and easy to understand for anybody. Its simple and convey the message easily. Eg:Person 1: Do God Exist? Chitti: What you mean by GOD? Person 1: Our Creator. Chitti: Then, Yes, (Pointing Vaseegaran) he is my God, my Creator.On the whole: The Movie is going to break all kind of Indian Box Office records. The movie has everything, whatever the Team had promised before. Great achievement by SUN Pictures and S Shankar.Look out for the Final 20 Minutes, the Magnetic EFX, the Giant ROBO, The Snake, Rajini's Dialoges and his Face expressions in the last quarter.This movie is not a Masterpiece but is Path Breaking with its breath Taking Visuals. The film is a Visual Treat and technically way ahead of any Indian Movies."
    },
    {
        "author": "jaganpon",
        "review_date": "1 October 2010",
        "title": " Fantastic Movie",
        "rating": "10",
        "review": "Super Star Again Proved he is the star in \"Endiran\" high Budget Movie in Asia and very good Storyline and Very good Animation. Super star Rokzzzzz Aiswarya Rai Beautiful queen... really as per story Robot ll get love feel after see her... Amazing locations fight sequence and good concept... Writer Sujatha is not alive now but his dream has a perfect shape as \"Endiran \"the robot... Once again Shankar's dream movie ... of course A.R Rahman played fantastic role... Great movie i enjoyed watching it in a first day first show... Enjoy guys... Ella Puhalum Iraivanukae...... :) Sure this movie hit in India . And expectation is high. It released World Wide and sure it ll hit world wide box office."
    },
    {
        "author": "vikram-markiv",
        "review_date": "30 September 2010",
        "title": " 9/10",
        "rating": "10",
        "review": "The movie starts without the usual powerful entry sequence that Superstar Rajini gets. Highly unusual but there's a first thing for everything. A nice sci-fi food for the Tamil audience. Haven't really seen this kind of a story in any of the movies so far. Nice screenplay. Stunts were a bit too much, as-usual, but not ridiculous at the same time. Though the storyline is in sync with that of I-Robot at times, there seems to be lot of original touch to it. Absolutely lovable songs. The graphics are very decent and the work in climax scenes are damn good. Worth a watch !! Even twice. Even thrice."
    },
    {
        "author": "doomsdaycs",
        "review_date": "1 October 2010",
        "title": " Get Ready Folks!!!",
        "rating": "10",
        "review": "When was the last time, you watched a movie and came out of a theatre and then continued to talk about that movie for ages to come? If you have an answer, you have another opportunity and if you don't, you have your first 'experience' here! If you are that die hard fan of Rajnikanth, you wouldn't need a review but you'd still want that loads of lines praising heaps on the Superstar! But here, you'll regret one thing – the invention of the dictionary! You won't really find one word to describe the true charisma and the on-screen persona of Rajnikanth, the undisputed Superstar of Tamil, oops Indian cinema!The Gist of the Story:Rajnikanth is a scientist, Vaseegaran who develops his brainchild, a robot. Names it 'Chitty' and teaches every single thing that this universe can hold. 'Chitty' is programmed to learn and know everything except for human emotions and when that is taught, how would you expect a machine to react? Watch 'Endhiran' to know how! Dialogues:The Superstar's fan following ranges from the villages to international cities and this being a movie talking about technology, one would expect totally technical jargon in place. But that's only a myth, because the dialogues in 'Endhiran' are simple and convey the message quite crisply making sure all the sections of the audience understand every aspect of technology and science. Now did that sound serious? The movie is neatly infused with comedy dialogues that will make you giggle and when rendered by Rajni himself, you'll just scream laughing! Visual Effects and Editing:The teasers and trailers stimulated the curiosity thanks to the splendid visual effects by international technicians. Examples of the dynamic effects are a plenty to talk about in the movie but sample this – a robot with unimaginable powers confronts goons with his electromagnetic property and attracts their weapons, and voila, you get to see, a spectacular scene that probably idolizes Goddess Kali! You'll have to watch it to understand and realise, it is verbally impossible to describe that scene and many other visual effects! Editing by Antony is crisp. Had the length been a little longer, the party would have been a little annoying! Stunts:Not just for visual effects, Shankar has also used the services of international expertise for the stunts in his movie. Yuen Woo Ping, who worked on 'The Matrix', etc, has designed stunt scenes that will make your jaws drop! Our very own Peter Heines has also done his part. A sample to tease your curiosity – an intense car chasing scene with our Superstar making a 'donut' in his Mercedes Convertible! Exhilarating! Music:AR Rahman, the Mozart of Madras, we've seen the response for the music right after the launch! But on screen, 'Kadhal Annukal' and 'Kilimanjaro', not to forget 'Arima', they take you by storm. The background score's decent and tries to receive your attention effectively! The rerecording in the movie is near perfect and sound capture by Oscar winner Resul Pookutty is A1. The Cast:Your eyes are predominantly set on the Superstar but pave way for the other leads. We'll come to the beautiful Aishwarya in a little while but before that it is going to be the gracious Danny Denzongpa, the wily villain of the movie. He is old but he is got grace and is a refreshing change from the usual villains. He adds a lot of freshness to the script, a brilliant choice of casting. The next, comedians Karunaas and Santhanam, though they don't quite have lengthy screen presence, they still manage to receive appreciation for their comic timing. Santhanam will be a proud man to have shared screen with the superstar. Aishwarya Rai – The Miss World, is amazing and truly an epitome of beauty! She forms an important part of the script and hence you'll spot her throughout the movie, perhaps for the first time a heroine is receiving considerable importance in a superstar's movie! The marvellous costumes add to her allure and she's just majestic in few scenes! Rajnikanth aka Superstar:Saving the best (or the ultimate) for the last, Rajnikanth is one man who will not cease to amaze you! If your 6 or 60, doesn't really matter because you will be in awe of the man! you will be in awe of the man! In a movie which shows signs of visual effects riding in the driver's seat, the Superstar dominates every bit to walk away with appreciation! No favouritism here, you just can't stop talking about him, once you come out! As the scientist Vaseegaran, he plays his part uncharacteristically Rajni without Punch dialogues or fights but as 'Chitty – the Robot' you are bound to follow or even turn an addict! Sample this – as a gentle Robot he is precise in acting and when it comes to the evil side, the incredible Rajni has made sure he doesn't waste his opportunity! His evil laugh, his characteristic slick walk, that body language and the dialogue delivery in 'Endhiran' remind you of the golden Rajni time! Look out for the amazing dance moves by the superstar, given his age, a few moves are stunning, credits to the choreographers!My Verdict:The festival of lights, 'Deepavali' is round the corner and with the release of 'Endhiran', the fireworks have already started! Quoting the Superstar himself, 'Endhiran' for the Indian audience all around the world is an 'experience'! Don't miss it!"
    },
    {
        "author": "tamilreviewer",
        "review_date": "18 October 2010",
        "title": " Lips like Zebra!!",
        "rating": "1",
        "review": "With all the hype around the movie Endhiran (the Tax exempt version of Robot), I finally watched it in a theater in US after the theater decided to drop the priceMind you, it was still more expensive than watching Avatar, the 3D version The theater was really small unlike what the name implied, maybe I shouldn't read into things too muchI don't expect anything less from a Shankar Movie than a Top notch entertainer (Top notch by any Tamil movie standard) Without a question, he delivers againBut, the hype was that the movie is up to the international standards! And that's where I felt cheated and disappointed!From the beginning of the movie, somehow questions started popping up in my mind May be the popcorn that I was munching had something to do with it.Why would an accomplished Robotics scientist hire couple of Incompetent Ignorant assistants to such a high caliber job?Am I crazy to think that the Scientist is a criminal as he runs away from the crime scene as his Robot causes a bloody injury? And the whole theater laughed at this scene! May be I'm crazy! Or, maybe it is OK because the injured is just a low level traffic cop as it is OK not to serve even coffee to the assistant as he is only a third level employeeWhy would an incredibly talented Scientist, so callously smash a Robot and carelessly dump it in a dumpster Didn't he know that the Robot had the capability to casually reassemble itself?Also, Isn't an incredible waste of a valuable resource to expect a Robot to tie it's \"Master's\" shoelace when it has mastered to calculate a prime number that would take years for a human to calculate? \"Master of all trades, but a slave for its Master\" This could be an apt subtitle for the movie..How is it when a group of thugs try to molest a girl in a running train for so long and only a Robot is there to save, while, when the Robot kidnaps the girl, there is an army of cops available right away with Machine Guns (I mean Machine Guns!) and 20cc mopeds to save her?!You might say, I'm misreading comedy elements as movie/character flaws..Well, If I really wanted to watch a senseless comedy, I would rather watch Adam Sandler's \"Waterboy\" or the second half of Shahrukh Khan's \"My Name is Khan\"I kept wondering, Why is such a talented (I'm not sarcastic here) director, Shankar, who is talented enough to transition a Robot into a human inconspicuously is complacent enough to transition from a scene to a song so abruptly.Anyway, as a born Indian, Should I take pride in the technical accomplishments of this movie? The last I heard was that the technical work was done by the Hollywood professionals Oh! May be I just should take pride (I'm sarcastic here) in our ability to buy the technical talent from the US and call it our own achievement! As always in a Shankar Movie, the songs were pretty good (lyrics and music) and were picturized nicely But, I wasn't really there to watch a nice music album rather I was there to witness a coming of age movie!I might sound nitpicking on a wonderfully made movie.. May be it is wonderful in its own wayYes, it is an entertainer But, don't expect this to be the cultural crossover movie to be recognized by the entire world! It is not! I hope they don't expect to promote to the world media that way! It will be a disservice to the Tamil talents like ManiRatnam, ARRahman and.. Well, I can't think of anyone elseFor those in India, don't be hoodwinked by all the hoopla about this movie being greatly successful in US It is relatively successful only because the First Generation Indians like me (believe me, there are thousands of them) are flocking to the theaters where they don't mind sharing their seats (with the bedbugs) and sparing their hygiene It'll be more accurate if I put \"only\" again after \"because\" in the above statementIf you can get anyone else (anyone other than the first generation Indians) not to walkout within the first 15 minutes of this movie, then you may have to carry him/her in a stretcher after the movie or during the interval whichever fits youBTW, hats off to the poet who compared beautiful lips of Aishwarya to zebra I guess her teeth are zebra crossings then"
    },
    {
        "author": "prabu-mahesh",
        "review_date": "1 October 2010",
        "title": " Indian cinema's pinnacle of evolution – 'Robot sapiens",
        "rating": "10",
        "review": "With a bevy of machine guns in hand; all triggers locked, Superstar delivers a resounding punch line; 'Happy Diwali folks'. Yes, it was Diwali, minutes before the start of the first show here in Chennai with crackers going off in thousands, flowers flying around and people going delirious with excitement. This is Diwali; no matter even if the real one is still a month away, Superstar has arrived!Overall, Endhiran is a 'robotic, hypnotic, supersonic, Superstar' experience, the first of its kind in Tamil cinema and the only one of its kind for a long time to come. It is going to take a Herculean effort to equal or better Endhiran within the confines of Tamil cinema. Let's hope the day comes soon. For now, an ovation to the Endhiran team, Sun Pictures and Kalanithi Maran for showing faith in Shankar's vision and to Hansraj Saxena for masterful execution of the project. If not for the faith, confidence and vision of these men, Shankar's ten year dream would still have been just a dream.Do Indian cinema a favour, watch Endhiran; let a 100 other Shankars feel bold enough to dream.Verdict: Indian cinema's pinnacle of evolution – 'Robot sapiens"
    },
    {
        "author": "yokikumar",
        "review_date": "1 October 2010",
        "title": " super hit hit.........",
        "rating": "9",
        "review": "Movie is an international Indian movie................ m My rating : 10/10 as one of the guy who is working in Kollywood. My rating : 10/10 as a Rajni fan My rating : 9/10 as one of the publicWhat a making ? What a work ? Brilliant . Enjoyed each &amp; every seconds.I already booked tickets for few more upcoming shows.Above we received some negative comments from few writers. Please don't consider those comments. A 175c Shankar's team can give these much of output, then with the budget of Avatar, Shankar can give a much better 'Tamil' movie than 'Avatar' . This is true - believeThe price of the ticket is in the riveting climax involving thousands of Robo Rajinis joining forces to have their day as part of society. Overall the movie is a must watch Indian movie of 2010 and is an excellent showcase of Indian cinema and what it can bring to an industry that churns out more absurd masal every year than an audience can stomach. Overall 9/10"
    },
    {
        "author": "smart_anand01",
        "review_date": "1 October 2010",
        "title": " Robo -Endhiran Academy Award winner for sure",
        "rating": "10",
        "review": "It will surely get the academy award for all aspects :Best Film ,Best Actor in a Leading Role Rajinikanth ,Best Actress in a Leading Role Aishwarya Rai Bachchan ,Best Original Music Score A. R. Rahman , great movie ,fabulous style ,special effects ,stunts, screenplay, Best Makeup ,Best Art Direction, Best Costume Design, Best Sound Editing, Best Sound Mixing ,Best Original Score ,Best Visual Effects ,Best Film Editing, Best Foreign Language Film ,this movie rocks. I like the style of Rajinikanth, fighting scene in the train ,robo saving the baby and the mother ,robo Chitti falling in love with Sana Aishwarya Rai ,the song Irumbile oru idhayam got me cutis anserina , All the songs are nice ,Rajinikanth is looking so nice in this movie wow his age is decreasing, Aishwarya Rai is so beautiful, will watch it again.Saw the movie 1st day 1st show.Please watch the movie in the theaters . Must watch this movie 10/10 .excellent."
    },
    {
        "author": "ramyaprabhu02",
        "review_date": "1 October 2010",
        "title": " Enthiran review",
        "rating": "10",
        "review": "First of all the film is mind blowing for an Indian movie standard. Shankar has compromised himself in the screenplay just to ensure that this movie reach the common Indian audience. For those audience who don't understand the basics of computers and robotics, this movie is going to be a magic - A Super hero subject. For those fans who have a bit of knowledge in computers, this movie would make them wonder about the robotics technology, though this is a fiction. The first half is fully entertaining with lots of comedy. The second half of the second half is filled with excellent CGs and Rajni's tremendous action. The first half of the second half is where the movie is a bit boring containing lots of unwanted scenes. Second half of the second half is excellent. Nobody would have ever expected such a turning point. The scenes are very thrilling.Songs are just inserted in the movie just for commercial purpose. This movie would have been more better if there are no songs.Photography, stunts are far more excellent for an Indian movie. This movie will be a trend setter for bringing CG related movies in future to India. Though this movie is not up to Hollywood standard and cannot be compared to Hollywood, this is the first step that an Indian movie has taken in that direction.Hats off Shankar and Team. Thanks to Kalanithi Maran for making this possible! None other than him could have given such a movie at this time!"
    },
    {
        "author": "griffolyon12",
        "review_date": "19 October 2010",
        "title": " Bizarre Even for Bollywood",
        "rating": "2",
        "review": "Endhiran roughly translates to \"The Robot\" and what you get in this Bollywood adventure is a big smashing together of nearly every trope ever associated to robotic androids in movies.The story follows an Indian scientist who has created a robotic replication of himself. The robot named Chitti is designed to be a super soldier for the Indian government, but when Chitti starts to feel human emotion and courts the scientist's girlfriend, things begin to go awry.The movie is part action, part drama, part comedy, part romance, part musical, etc. It is a lot of things, and like many Bollywood movies, it doesn't seem to work that well in the transitions. Really, the movie does try to deal with the heavy concept of human emotions and the dangers of them, but these odd transitions between different styles do not aid in accentuating this theme. For example, whenever the characters feel a rush of emotion they burst into song-and-dance to techno glory, but these scenes, much like the action scenes and the infamous mosquito scene (which was ridiculous and just plain weird, where Chitti converses with a pack of mosquitos), they all drag on for far too long, as if the filmmakers could not distill down the scenes to a reasonable length. And speaking of the bizarre, the change in the middle of the movie where Chitti goes from being the good guy to being the bad guy just makes little to no sense, and it feels as if there are two movies here rather than one. Focus on finishing one story before gearing up another.Endhiran may appeal to fans of Bollywood, but to us others it leaves us scratching our heads after this visually stimulating, but unfulfilling ride of human emotion.I give Endhiran a 2 out of 10!"
    },
    {
        "author": "santhosh-rajagopal",
        "review_date": "1 October 2010",
        "title": " Endhiran",
        "rating": "9",
        "review": "India's best Sci-Fi movie, Graphics at its best.Sun pictures have shown trust with Director Shankar on investing close to 190 crores..Shankar best ever - its not the hype that revolves him its the talent prodigy that keeps him going...Rajni - Thalaivar at his best even at this age.. Nobody at this age would have done this much justice to the character Aishwarya - no wonder she was miss world AR rahman - Oscar is a mere starter for him.Overall this movie has created history among indians and hard core rajni fans."
    },
    {
        "author": "parthasarathy-sreenivasa",
        "review_date": "1 October 2010",
        "title": " Awesome",
        "rating": "10",
        "review": "1st thing don't have any imagination based on people who watched erase you mind from those things and just be blank when go to this movie this movie tell us about how robot can go in destructively when it programmed wrongly the acting of Super Star Rajinikanth is awesome,he was acting like tanjore doll in hands of Shankar.He acting as robot par excellent and great he dance equally to aishwarya rai has a robot in the movie Finally the climax graphic is great and fighting sequence is great.A.R.Rahamn rocks in background music i don't where he get turns for the movie all the background music is awesome I would like to say it Shankar and Super Star Rajinikanth with A.R.Rahman music and aishwarya rai as masala for the movie"
    },
    {
        "author": "RjvErnesto",
        "review_date": "1 October 2010",
        "title": " Commercial Sci-Fi Entertainer with Best Villain Performance !",
        "rating": "6",
        "review": "It's worth a mind blowing spectacle for Tamil Audiences especially Rajni Fans , But for the world audiences who witnessed the World of Cyborg Stuffs in Terminator Series ,IRobot ,Surrogates etc ; it'll just be an another effort from Sci'Fi Side .It is entertaining watching Rajnikanth between screaming Rajni fans on First day. Rajnikanth performs with his usual charm &amp; essence to give Indian Cinema a real Hero &amp; a legendary Villain in this Movie .The Visual effects in the First Half was Pathetic ,But as a remedy we will watch spectacular visual effects spilling in front of eyes in the Second Half .Script is Concentrated in a Cyborg with Programmed Emotions falling in Love with his Scientist's Niece &amp; Gradually trapped in Wrong hands yet Re Programmed as a Destruction Tool .The Enthiran is a Total Commercial Entertainer for Rajni Fans &amp; Just a Time pass Movie for World Viewers .This will be the Downfall of Bollywood in Indian Movie Industry . Tamil Industry is gaining some Levels &amp; Standards .Ps :- There is only one Superstar in Entire World , Rajnikanth"
    },
    {
        "author": "GoodFella1980",
        "review_date": "11 November 2010",
        "title": " A Study of Propaganda",
        "rating": "1",
        "review": "The day was finally set. I was going to watch \"Endhiran\", the most expensive Indian movie ever made. The \"Avatar\" of India, the posters claimed. I will admit upfront, I am not a huge fan of either Shankar or Rajinikanth, but there was a glimmer of hope as it was a screenplay by the late Sujatha, a true technocrat whose books and prose I have cherished over the years (would he have coined the term \"Robo Sapiens\"?). As Sujatha had passed away during the pre-production of the movie, I was well aware that the screenplay would have been completed by Shankar (Madhan Karky is also credited as a co-script writer). The initial reviews had lauded the movie claiming it to be a benchmark in Indian cinema and how Indian cinema has improved by leaps and bounds and how the movie will stand up to any Hollywood production of recent years.The movie proved be a huge disappointment (except a few scenes) and it also proved the fact that without a cohesive screenplay, any movie, even the most expensive one, would turn out to be a fiasco and dishearten the non-emotionally-invested viewers. Let's face it; the movie would have never worked with that screenplay, without a huge-name star to portray the protagonist, the innocent robot Chitti (Speed 1 THz, Memory 1 Zettabyte) and the antagonist (Chitti v.2.0). Rajini, a force/star he may be, but it is the actor that I miss, whom I last saw in \"Thalapathy\" (1991). I was subject to over-the-top performances and over-the-top everything that I have come to witness in Shankar movies. Aishwarya Rai, as Sana, is beautiful (as always) but has little else to do, as others, who just appear in the scenes without leaving a mark. It is understandable that Shankar wanted Rajini to carry the movie, but I was used to the Rajini that I saw on-screen; he did not bring anything new to this movie. I was comforted in the fact, that there were no build-ups to the Dr. Vaseegaran character and no opening songs claiming the protagonist to be the all conquering singing, dancing hero of the silver screen.The songs, good as they were, only managed to drag the flow (if there was any) of the already stumbling screenplay and the second half seemed to drag. I believe it is now time for Thamizh movies (or any movies, except musicals) to not have song sequences which just test our patience as I did not gain anything from a song set in Machu Picchu as Dr. Vaseegaran was contemplating the future of Chitti. Plot holes galore in this movie which took two years to complete; we are shown that as Sana is kidnapped by Chitti v.2.0, the police randomly firing at the car; were they not worried that Sana might be killed in the cross-fire or were they all crack-shots? And, did we need to see Chitti conversing with mosquitoes? I felt angry for spending the money and wasting my time watching this utter garbage, which some of my friends have claimed to be the best Thamizh film ever! Shankar has taken elements from \"Bicentennial Man\" and \"I, Robot\" and served up a diarrhea inducing meal on a silver platter. It was really hard to believe that Santhanam and Karunas to be scientists, but even that seemed tolerable compared to the \"romantic\" scene between Aishwarya and Rajini (Sana wants to end their relationship) where Vaseegaran asks Sana to return the kisses he had given during the course of their relationship. The scene takes us to a very artificial looking desert as Rajini plays the guitar (if you can believe his strumming - looked more like he was moving his hands up and down the guitar) and a beautiful song wasted in \"Kadhal Anukkal\".The one scene that I found really impressive, was the Chitti (v.2.0) metamorphosing fight sequence in the climax, supported by the background score with the metallic edge as provided by Academy Award winner A. R. Rahman. I expected more from Chitti (v.2.0); Rajini should have explored more with what makes Chitti (v.2.0) tick, but, as he said in the Endhiran audio launch, he had followed Shankar's directions to a T, which, in my opinion has backfired as Chitti (v.2.0) exaggerates its' speech and gestures as the much-detested Shankarism comes into play in the third act. I did not empathize with Chitti as it dismantled itself; I found it neither moving nor the fitting end to the most expensive movie of Indian cinema. My absolute anger lies in the fact that this so-called-excuse for a movie was marketed as a challenge to Hollywood productions and the announcement of Thamizh cinema on to the world stage. If the rest of the world considers \"Endhiran\" as a token Thamizh movie, I will be among the first to completely switch off Thamizh movies and deny that I ever watched them. Dot."
    },
    {
        "author": "kashraj19",
        "review_date": "24 October 2010",
        "title": " Unintentional Humour, Loud acting and poor storyline all hallmarks of this big-budget extravaganza.",
        "rating": "1",
        "review": "I happened to see Robot (Hindi Version) a few days back. Believe me, I am ashamed to even commit to my friends that I saw this crap. The Movie is silly from the beginning and never delivers anything intelligent, which is expected from a science fiction. I feel sorry for Rajnikanth who has compromised so much, just to please his fan base. It is difficult to believe that he is the same person who stared in the movie-Thalpathi (Mani Ratnam).Coming back to Robot. My question for Mr.Shankar is when he is going to give us an intelligent and a smart film. I have no complains with the special effects, they were very well executed and were of Hollywood standards. Specially the final ten minutes.However, there was nothing like a story in the movie. It was predictable from the first scene and was longer than required and top of it, there were just too much songs. Songs were poor and lyrics were just pathetic. The twists were stupid and did not fit in with theme of the movie.In terms of acting, Rajni is acceptable as the scientist and unbearable as the Robot. Mrs.Bachaan, it seems is signing everything coming at her hand these days, so no complains from her, because we all know what she is capable off. Mr.Danny, I understand you have no work these days, so you are pardoned for being a part of this foolish, dramatic and shameless movie.It is these movies which draws the Indian Film industry backwards. I pity the people who consider this as entertainment and spend thousand of rupees in watching this crap. Stay away, support good films."
    },
    {
        "author": "roshen_isham",
        "review_date": "2 October 2010",
        "title": " Epic FAIL!!!!!!",
        "rating": "2",
        "review": "To start off with , im a fan of both rajini n shankar. My expectations for the movie were extremely high going on the points that this was the most expensive Asian movie ever made. With shankar, rajini, ar rahman, i expected nothing short of a magical entertaining movie.The shock i got when i got to the cinemas to watch this movie was unexplainable. Story wasn't good, music disaster, graphics: maybe the best they could do in kollywood but not worth the money they spent. Rather they spent the money on the songs, they could have spent on polishing the graphics or brushing off the obvious blunders.Well all i can say is the movie 'could' appeal to local fans in India who haven't really seen sci-fi movies before, but internationally its a disgrace to tamil cinema.The only positive is, its the first of its kind in tamil cinema, the first stepping stone for the industry into this genre, and i hope they learn from their mistakes.One thing is for sure, Indian cinema will never reach the heights of Hollywood."
    },
    {
        "author": "rabidachilles",
        "review_date": "1 October 2010",
        "title": " the fans and rajnikanth breath life into robot",
        "rating": "10",
        "review": "the movie could have been only carried by one and only man RAJNIKANTH .he clearly epitomizes the exact kind of old school acting which we cherish.the CGI was used well through the movie ,probably a tad more towards the end .aishwarya Ra looks stunning and the designer clothes used in the movie was quite innovative a definite ten out of ten ...was worth the the grand spent.A R rehman does a good job with the music although the general feeling is maestro is slightly slipping from him own standards. as for the troll gods own country he hasn't seen the movie and clearly is a byproduct of contraception failure i will not abuse u cause if you are from gods own country you are suffering and miserable enough already."
    },
    {
        "author": "rstheboss",
        "review_date": "1 October 2010",
        "title": " Its not a movie.. its an experience",
        "rating": "10",
        "review": "The biggest movie of Asia is finally here and whoa ! its mind blowing. Endhiran the robot is the costliest Indian film to date and it has lived up to all its hype and expectations from all over the world. Superstar Rajnikanth is a household name all over India for his style and punch dialogs but this movie propels him to the big Hollywood league. There are plenty of times where we see Hollywood movies like the matrix, avatar or inception and feel why doesn't Indian filmmakers imagine like that.. the answer has been given by Shankar who has relieved his ten year dream to produce one of the greatest Indian sci-fi movies of all time.. to be honest the graphics is in the movie is not Hollywood standard but as close as it can get..The story is an ordinary love triangle between the lead characters but what is extraordinary is its execution. Shankar is the first one to bring the Hollywood standard storyboard before shooting method to Tamil cinema and his hard work is clearly visible in each and every frame of the movie.. The stunt choreography is top notch and a particularly long climax sequence is \"the\" best sequence ever shot in an Indian movie. There is a license which Rajni gets as a part of his massive fan following all over south India - the Demi-God status.. he can do whatever he wants to do even if it defies logic but in Endhiran he has gone over the limit of imagination delivering awesome acting and top notch commitment. The movie drags slightly in the second half but the screenplay as a whole and climax sequence in particular made my day !"
    }
]