[
    {
        "author": "seshasai-tris",
        "review_date": "29 August 2017",
        "title": "May be the first modern cult classic in telugu",
        "review": "It has been a refreshing experience watching this movie. The romance, characterization is at its raw best. I am glad that the director and his team did not do anything to dial it down. The performances have been great. We all know the story, but it has not been done before in Telugu cinema. In some ways, this can be called modern Devdas with realistic dialogue.  Without spoiling; the story is about a young MBBS student with anger management issues falling in love. Arjun Reddy's character is deeply flawed. I must appreciate the director and crew steering away from the Telugu movie way of showing the lead character in a perfect light. I am glad the character is flawed. There are several instances in this 186 minute movie that shows us the flawed side of our hero. It works out for the story telling. Also in this tale, we see characters yelling swear words when under stress or anger; which does not happen in other flicks.  The physical romance couldn't be more appropriate. It's is present where necessary and only promotes story telling and emotions. Also, the story is also about a bunch of characters constantly caring and supporting Arjun Reddy despite his strong requirement for sole confinement. The sick kick friend is more than a side kick shows real spine in tense moments, also providing subtle comedy in the various situations.  The movie does not commit to one message. The grandma says \"a person who wants to suffer must be left alone and that person will soon get back on his feet\"; But almost all characters related to the hero (Brother, friends) always keep visiting Arjun despite Arjun yelling them to go away. It was the supporting friends and family that bring back a almost lost soul back. When Arjun loses everything, left with no money and thrown on the road; it's the brother and father who spend their money to send Arjun to exotic countries to help him get over the girl.  The movie doesn't seem 3 hour long, but definitely feels lengthy, often straining the eyes. Preethi's character is underdeveloped, but she did a decent job at that. The heroin side track was unnecessary and does not contribute much.  Overall, this is a refreshing change in Tollywood and I can see a lot of directors experimenting by not following the Telugu formulaic trend in the upcoming years."
    },
    {
        "author": "rutwik_reddy",
        "review_date": "2 September 2017",
        "title": "Arjun Reddy is life and not just a movie",
        "review": "Disclaimer: Not for telugu movie lovers who want 4 songs, 3 fights, couple of high budget sequences and 1 freaking mega family hero.  This movie is an awesome mirror to how the present generation in India is. The story line, screenplay and the BGM are top notch.  Movie starts off with the main character looking shoddy (like a modern day devadas) and his only intention is to flirt, f*** and finish off. it is only when you slowly slip into the movie that you realize that either you or one of your friends from college is of the same type. Anger management is the main theme of the movie and the director intelligently shows the difference in mindset of the character per and post falling in love.  The supporting actors are like the friends of ours who are like shoulders to cry on or sit accordingly  Got to give credits to the Director for running the movie for full 3 hours without the distracting love duets/mass songs ( saved 25 mins of his time to convey the story better)  The subject line is raw and to the point with the plot revolving only around the hero. At no point one feels bored (unless someone doesn't like the plot all together).  BGM by the music director is amazing. it goes slowly and smoothly with the mood of the movie  Main let down would be the climax: which looked hurried and commercialized for the movie buffs"
    },
    {
        "author": "manishchilly",
        "review_date": "27 August 2017",
        "title": "Arjun Reddy will be Tollywood's KickA** CULT Classic",
        "review": "Watch the teaser first: JAW DROPPING, then trailer GOOSEBUMPS and then the Movie (A MOVIE THAT'S GOT SOME B**LS). The Love story of Arjun Reddy was portrayed in such a dark & intense way and hence I call it the CULT Classics of the Telugu Film Industry. The movie was goddamn natural (non-commercial) and watching it, i believe most of the people might have felt these emotions at some point of their lives. Its very hard to find such a Beautiful story in this commercialized movie world. Vijay's performance was flawless. His character takes you to your past and makes you cry, blood boil and heart melt. Some brilliant performance from supporting actors like Rahul who plays his best friend Shiva. I just loved Shiva's character as he is the Spinal Cord of the movie. Soul satisfying music. Hatsoff to Director Sandeep Vanga for introducing this kind of a movie to Telugu Film industry. Very good and important messages conveyed, much needed for this generation youth. The movie is a long 3 hour movie but is worth every minute. GO WATCH IT. I am lucky to have watched this movie #UNCENSORED."
    },
    {
        "author": "pratap-kumarreddy",
        "review_date": "28 August 2017",
        "title": "Arjun Reddy is a dam Fuc...g Trend setting movie.....",
        "review": "Impressed after seeing this movies last night. I congratulate Debut director Sandeep choosing such the bold subject and the suitable artists. Another impressive thing is that there are no star kids acted in this movie, there are no star producers produced this movie. The story and narration is realistic and natural. Vijay Devarakonda mesmerized with his acting skills, body language and attitude shown as Arjun Reddy character, Congratulations and this is an award winning performance and your hard work. Background score of this movies is hilarious with respect to the screen play. Expecting more and more this kind of movies in Tollywood."
    },
    {
        "author": "mohanniki",
        "review_date": "9 September 2017",
        "title": "Epic Movie with Deepest Emotions and Content",
        "review": "Kudos ! To the entire team, especially to the director Sandeep Sir, getting all the emotions and feelings aptly. The presentation of the characters are very bold as they are refined products as to be what they are. Grilled each and every character to be yourself. The message is very clear be yourself.Thank You so much sir for a very good film."
    },
    {
        "author": "nageshnataraaz",
        "review_date": "30 August 2017",
        "title": "Arjun Reddy' is not a film; it's an experience that'll stay with you.",
        "review": "The love in Arjun Reddy is pure, unabashedly bold and hard-hitting. It touches the soul in ways it can't be explained. It gives the story a modern-day Devdas twist, while making the overall cinematic experience a journey to remember for a long time.  This is the story of the lead character Arjun Reddy(Vijay DeveraKonda), and yet there isn't a story, a structure to be precise, to follow and anticipate what might happen next. It's the rise, fall and rise of Arjun, and his journey of love and suffering, is nothing short of poetic and heart wrenching.  Sandeep and Vijay, as director and hero, make the film for what it is, and both have paved the way for a new chapter in Telugu film History. If it was Pellichoopulu and Kshanam last year, it's Arjun Reddy in 2017, and these films assure there is light at the end of the tunnel.  As much as the film belongs to Sandeep, who is also its writer, it equally belongs to Vijay Devarakonda, who is the life of Arjun Reddy. Vijay breathes life into the character and it's impossible to imagine anyone else in his shoes. Be it his passion, love, and rage; he portrays these several layers of his character with unparalleled realism.  Vijay's performance as a college-goer with serious anger issues or as the alcoholic surgeon will leave you in awe of his versatility in pulling off such diverse avatars with ease, as if it was child's play.  Arjun Reddy most original, experimental and daring work to come out Telugu cinema in a long time."
    },
    {
        "author": "ratnakarp-69184",
        "review_date": "30 August 2017",
        "title": "Movie is like a slow drug addiction",
        "review": "Any guy can relate to this movie right from starting to end. This movie gives a shot of a drug that gets injected slowly into your body and could take a while to come out of the hang over. I loved the pre- interval scene and the back ground music is just awesome. Vijay's performance is way beyond. Except kids, everyone else can watch this movie."
    },
    {
        "author": "srsaprba",
        "review_date": "11 February 2018",
        "title": "Over hyped film of immersive misogynistic narcissism",
        "review": "This is the story of a guy and somewhat a girl, who are in deep love, develop strong relations, the girl getting married off to another, the guy getting addicted to booze, drugs, and a beard - an essential accessory for any Telugu film hero with disastrous love affair. The film starts with the hero (Vijay Sai Deverakonda) as a doctor in unkempt avatar with unpleasant characteristics. The provenance of the beard can be traced back to a violent fracas on football field, causing a showdown with a colourless dean. In defence, the hero serves up first of many infantile philosophies that pepper the film. He says \"Football is a violent sport\" (it is not), he plays for satisfaction, not medals. His friend who accompanies him, orders the class to stand up and \"respect the champion\". Every student stands up instantaneously as if national anthem has been set loose all of a sudden. They are so supine, scared, and scarred by the braggadocio of the guy who is permanently angry for no reason.  However he is supposed to be great at sudies, excels in sports, eventually would do record operations even when drunk and drugged, and in spare time, when not emitting sexist rants, flies spaceships (I made up one of those). He also administers anatomical drawings on body, as a teaching aid, as if he were a modern day Vesalius. The director's idea of demonstrating keen intellect is to show him staring with keen anger while delivering juvenile banter as some sort of profoundness. Women are supposed to throw at his feet, even when he hits rock bottom, drunkard and jobless drug addict - such are these Telugu films.  Enter, Preeti the first year fresher, who has instant anodyne effect on the hero. Ever since he is besotted with her, he marks her as his property by planting a kiss on her cheek without her consent. Later in the film, we would hear another insipid philosophical babble on his 'private space' that should be respected by others, of course, being a 'free spirit', he could invade others' space at will if they happen to be women. There starts the dog like devotion and aggressive possessiveness of the hero. In time honoured convention in Telugu films, the hero lays claim to her, 'protects' her from ragging predators. Warming up to dog motif, again, without her knowledge, people label her 'his girl', just as one would say 'his dog', which is a good template to understand his attitude towards her. Only thing he does not objectify is one real dog in the film, which is elevated to human, whereas the girl is downgraded to a faithful dog. In many scenes, you might as well replace the dog with the girl, as the dog barely barks and the girl rarely speaks. Then he hears of Preeti being marked rather inappropriately by another male dog during Holi celebrations. That heralds a sequence of rage filled obscene expletives which are now celebrated for being bold, raw, intense never before shown in Telugu films, director breaking the conventions of ordinary films making. The abuse is of course very conventional, targeting women, uttered by the hero (yes the same guy who would prattle pretentiously on how not to objectify women), to avenge the vile touch. The girl falls into his arms for protecting her honour, somewhat in Taliban style. And Telugu hero must acquire another essential accessory - a second heroine, of course with zero dignity. His treatment of her resembles kicking out a dog when he wanted to reject her.  Showdown with the girl's father: The director often needs squalid characters to show hero in better light. The domineering father is a rank casteist stereotype who detests guy. He catches him kissing her at his home and angrily confronts him. By this time the director probably has convinced some good number of audience to fondly imagine that it is perfectly acceptable to visit someone's home, kiss their daughter and demand what the hero later blathers about as 'private space'. The girl's marriage is forcefully fixed and the hero gives her six hours to make up her mind to move out with him. What is the best way to reinforce his point to the woman? Slap her of course. He is medieval, but as we are told, he is a free spirit, so it is supposed to be ok.  Then there is a ridiculous, completely out of context scene about PMS, contrived to show the audience how sensitive he is to female concerns, as if to tell 'I am not a sexist beast, I have this delicate side', crassly exploiting to extract brownie points. In another scene, the director makes him sermonise a moronic NRI not to objectify women. The characters surrounding the male lead are cardboard which is at least two dimensional. The hero is unidimensional, with angry face at one end, and pseudo empathetic drivel on the other.  During his disciplinary hearings, he remembers Hippocratic oath, presenting himself as a guy with integrity. Such pangs of conscience! This guy does not remember the pledge we are drilled down in schools. \"All Indians are my brothers and sisters\". This sounds like kitsch, but intended to reflect fraternal spirit from the three pillars of Indian constitution - liberty, equality, fraternity. There is little fraternal feeling in this pledge loving bloke. When the girl's father asks him to look after his daughter like a \"sister\", he utters \"he does not have sisters\" in a pompous tone mocking Preeti's father for his old fashioned thinking. His own thinking or lack of it towards women is rather antediluvian. Even then, a character admiringly rambles that he has never seen a free spirit like this guy in a democracy. He neither understands free spirit, nor democracy (unless the free spirit means free booze), and spews this arrant nonsense. Coming to think of it, people in lunatic asylum are free spirits too. A man who needs a muse to be a lamb, but deforms into a brute ('free spirit') and loses self control when he loses her is fundamentally a weak person, though his brutishness appears as a sign of strength.  While he is growing a beard, Preeti is growing his child, heavily pregnant. This is going to be film about beard, borne like a cross, not a potentially career ending silly pregnancy. A shawl would have added to the hero's pathos, but is too ethnic for our westernized pseudo progressive. He is an odious sociopath, but since he is handsome, needs escape route. Conveniently grandma dies, creating instantaneous transformation, faster than 2-minute noodles, manifested by the removal of that blasted beard. He is a changed man. Whatever changed, his propensity to deliver incomprehensible gibberish as philosophy does not cease, and his dad, mesmerised, has instant transformation himself (since loss of beard is the \"game changer\" of Telugu cinema). If only his friends found him a decent barber in time...never mind, better late than never.  Anthony Hopkins as Dr.Hannibal Lecter remarks while lobotomising Ray Liotta's policeman that he did not need that part of the brain dealing with good manners. Our hero surely seemed to miss this part, even without a lobotomy, as demonstrated by his crude language with nurses, about patients, friends, especially regarding women. (By the way isn't Dr.Lecter a high end 'free spirit', with impeccable manners?). Once he asks his married classmate 'inkaa neellosukoledaa', enquiring about her pregnancy. When he sees a woman, he sees them as baby making machinery of future Arjun Reddys.  Finally what did this path breaking film break? The dialogues sound casual without bombastic music. Nothing new, if one observed some old Telugu films (e.g. Rojulu maaraayi (1955), shaavukaru(1950) ). Story is banal, narration is dragging; comedy shines sometimes with outstanding Rahul Ramakrishna's Siva, but comic potential in Telugu films is enormous and not particularly novel. Songs: not having been bombarded with pre-release audio tracks to condition auricular senses, did not particularly find them greatly appealing. Much is made of Vijay Devarakonda's action, but superior performances come from Kanchana and Rahul Ramakrishna who transformed normal roles into scene stealing glue that holds this dismal film together. Maniacal roles are not the best yardsticks of performance. They inject more to the character than any acting. Batman's Joker is an example, with the actors having high chance of receiving high accolades! His performance is decent, but no better than in another of his recent films 'pelli choopulu' (2016).  Then what is unique? This differs from others in using cuss words, peppering with obscene gratuitous expletives, under the pretence of showing realism, and the director is showered with epithets of 'bold' 'raw', 'honest'. Perhaps, dicing the film with even filthier language would have been termed \"bolder\". And of course, heavily publicised kissing (creating a very useful marketable controversy) . He also created one of the shallowest female leads, even by the abysmal standards of Telugu cinema, quite a feat. He is hailed as some sort of Sergei Eisenstein of Telugu films for this crudity. Forgot, there is another first by our Eisenstein. Never before seen piddling in the pants. Can any one beat that? Truly, \"bold\", \"raw\" , \"path breaking\" is alive and pissing. If you are not convinced by the dog motif mentioned earlier, this scene should confirm great canine like qualities of the hero, this time marking himself - a symbolic statement of his self indulgent narcissism.  The ultra westernized tenor gives pretensions of modernity covering up misogynist behaviour. We can only expect more of such 'youth' films. On the opposite end, we have traditionalists who want to impose their own authority under the pretext of protecting women from western influences. Women will be caught out in a pincer movement of devil of and the deep blue sea."
    },
    {
        "author": "amruthavoid",
        "review_date": "7 September 2017",
        "title": "Telugu cinema will never be the same after this",
        "review": "Brilliant direction with organically written dialogues and an excellent cast. What stands out most in this film when compared to other Telugu films is the lack of hero worship, a story that lies close to reality and the portrayal of love in its pure form. Vijay uplifted the film to an entirely different level, giving it the kind of craze that it has. Radhan's music has done wonderfully with the frames and the scenes. Films like this would directly affect the Indian youth. The dialogues and the direction has made it clear that it is against the idea of objectifying women like most Telugu movies do with their item songs and unrealistic love stories which barely involve interaction on-screen. The protagonist has admirable qualities despite the fact that he has anger management issues and is, for a particular period, addicted to drinking.  True love is timeless and tireless. No reason is strong enough for it to break, and this film showed us just that."
    },
    {
        "author": "rahmansachin",
        "review_date": "28 August 2017",
        "title": "Drastic change in Telugu Film Industry",
        "review": "Director : Being his first movie, he did the best. Actor : Vijay devarakonda dedication is fabulous. Actress : Simple. Co-Actors : Superb. Songs: All are situational and background play songs (no lip moments of  Actor/actress) Sandeep reddy vanga simply said true love never ends, and he is the first director from TFI to show love in correct way in my point of view. Sound mixing is fantabulous. BGM is awesome."
    },
    {
        "author": "karthikncrack",
        "review_date": "7 February 2019",
        "title": "Absolute Crap",
        "review": "Wasted 3 hours after watching this. The hero thinks he can do anything and act like a complete psychopath and there will be no consequences. He is a DOCTOR for Christ's sake."
    },
    {
        "author": "achanta-41115",
        "review_date": "14 October 2017",
        "title": "Monotonous and lacking sense",
        "review": "The emotions in the love story are nothing more than kissing, and the word \"baby\". The protagonist always has some philosophy to cover up for the situation to prove that he is correct. The father/brother emotions are not sufficiently built. It would have been good if the brother characterization was built better, as to how he attempts to save his brother, or how the family would free him from drug addiction through showing of love. Overall, more of a story that dives deeper and deeper into tragedy. The boy is shown to be an excellent doctor. Even to excel in profession/academics, I believe a person would need to have a lot better self-control than what the protagonist seems to possess."
    },
    {
        "author": "sudhir98",
        "review_date": "28 December 2017",
        "title": "avoid like the plague",
        "review": "Liberate tutu me ex inferis. my goal is to save innocent bakras from watching this movie.I am wasting even more time on this movie posting this to save others. after reading my synopsis if you want to watch this, dont say there was no warning. the \"hero: is an overly aggressive psychopathic Dbag who smokes, drinks, gets high , operates while high. He overdoses while his brother is getting high and shows no feelings when he ignores his brothers and fathers feelings for screwing up the wedding. The cherry on the top being the \"heroine\" is pregnant with his child. she also does not let her husband even touch her dirty clothes- her words not mine. Her father shows excellent judgement in diagnosing the Dbag but she still loves him any way. The people who made this movie seem to have trouble differentiating free spirit and a psychopath who also happens to be a douche. Save yourselves from hell!"
    },
    {
        "author": "ravs05",
        "review_date": "25 January 2018",
        "title": "Strong characterisation .. But story makes no sense!!",
        "review": "Ok, I am lost here, saw this movie yesterday after all that hype and hungaama and I really don't get how this film is truly different and mind-blowing! Are people only talking about the characterisation, which I will agree is quite strong and unapologetic. Vijay Deverakonda lives and breathes into this role. He is soo natural, almost too natural making us wonder if he has the same off-screen personality as well, which is a bit scary.  Coming to the story, I am really not sure what the director wanted to convey. Did he want to tell us that it is bad being rude and acting on impulse .. and that such people strongly needs therapy?? I understand that Arjun Reddy has anger issues and acts impulsively, but it is soo stupid that his love interest, Preeti also does the same, where she was supposed to be the sane one. She gets married to some random dude, despite being totally in love with Arjun because he did not answer his phone for a single day due to a drug overdose!!!??? And this is what people are calling as a revolutionary cult classic!!!  The second half is full of his downward spiral of Arjun Reddy and it is tedious watching this! Despite all his doings, he suddenly has flashes of remorse, especially in front of the lawyers and this is soo unconvincing. The ending saves this film a bit but makes all his suffering almost pointless. At any moment, Preeti could have ended his suffering instead we get a sub-plot with a film star thrown in and also countless moments where Arjun Reddy almost gets to kick the bucket!  Really, all this could have been justifiable, if the conflict point between the two lovers was strong. Unfortunately, as I mentioned, it is the weakest aspect which brings the entire film down."
    },
    {
        "author": "nagaraj86786",
        "review_date": "29 August 2017",
        "title": "This film is a sensation!",
        "review": "Kudos to director Sandeep for coming up with a bold and one-of-a- kind film in Telugu. He sticks to his script without any deviations. Sandeep is definitely a daring director, who has shown a new way forward with Arjun Reddy.  This is Vijay Deverakonda's film all the way. He is sensational as Arjun Reddy. He completely transforms into the character and lives it. Undoubtedly, he is going to be the future poster-boy of Telugu cinema. He acts effortlessly, just like an experienced star. Rahul Ramakrishna as Vijay's friend is another surprise find, mouthing his dialogues in a natural way. Shalini makes an excellent debut, and shows no signs of being a newcomer. She is perfect for her role, which she carries with grace.  Arjun Reddy, it sure is a sensation for Telugu cinema, and all the credit goes to director Sandeep for coming up with a subject like this. Although this is his debut film, one feels like he is an old hand. On his part, Vijay Deverakonda brings Arjun Reddy alive. A film not to be missed!!!"
    },
    {
        "author": "dema-59548",
        "review_date": "5 October 2017",
        "title": "Glorifying",
        "review": "This movie glorifies drinks, drugs and an aggressive angry young man. This movie doesn't have any sense and in my opinion it's a very average movie like a country movie where locals are portrayed as big hero who drinks and does throw tantrums but around in a modern look. I hate this movie being rated too high for nothing."
    },
    {
        "author": "Geeta352",
        "review_date": "2 November 2017",
        "title": "Very Disappointing",
        "review": "This film IMO is one of the worst South Indian films I've ever seen in a long time. The protagonist, a would-be successful surgeon, looses it when his physician girlfriend is married off to one of the local boys. He spends months in a downward spiral, which only halted after his grandmother dies. Although Vijay is a favorite of many, I found his character in this film to be very irritating. I also thought the story line was disjointed and unconvincing. This is not real world, it is plain and simple nonsense. I got a headache watching it. What a disappointment!"
    },
    {
        "author": "ravi9",
        "review_date": "3 September 2017",
        "title": "raw, bold and honest it may be... but its just 3hrs of torture to our souls",
        "review": "I get the intention of this story but its just too lengthy and tests your patience in every minute after first 30 minutes, the lead character Arjun Reddy is highly unlikable and keeps us questioning why his friends stay 'friends' with him/ keep up with him, despite his retarded attitude towards everything.. which only should belong to an asylum. People are just praising this movie because they were just put into a corner and asked them to judge it by its advertised \"raw- bold- intense- and honest\" bull-sh*t words, which they have used it everywhere where ever the movie got advertised. Audience just couldn't decide what the F this movie is about. If you really ask an individual as to why they liked it, they will start searching for words and reasons and to their rescue the makers of this movie already have given them those words to public from day 1 of its trailer and they will start by saying \"its raw\" \"its bold\" \"its intense\" \"its honest\" \"its emotional\". People are out and out shy to admit that \"there's nothing much\" in this movie.. just F***n admit that this is a piece of SH** Just at least learn not to feel ashamed and admit that you do not see the point of this horrendous film."
    },
    {
        "author": "krmaheshvit",
        "review_date": "30 October 2017",
        "title": "If not THE worst, it's one of the worst",
        "review": "The movie is too raw. Also, there's nothing too great about the story. For the most part, it's nothing but smoking and drinking-plain. Movies have a profound influence on the society and I believe that the directors should feel responsible when they're portraying situations or activities that leave a deep impact on the young impressionable minds. If it wasn't for the ending I wouldn't have cared to give this a negative rating. Pain exists when things don't turn our way but it need not be shown in a vulgar fashion to say that the pain is intense. And the 3* I gave was for the ending. For the rest, its 0. I know that most of the readers who go through this may not agree with me, at all. But, this is what I feel."
    },
    {
        "author": "vanivijay-g",
        "review_date": "4 September 2017",
        "title": "Arjun Reddy on the couch.",
        "review": "A window to peek into the mind of a brilliant medical student who fits the description of bipolar disorder and or borderline personality. Yes, a flawed personality. But, what's perfection anyway? The naming of the illness is unfortunate and when one can make a leap over and look past that, it's all about emotional dysregulation. When it comes to the naming of the film, it's apt as it narrates the story of the namesake and does just that, without judging or glorifying. Here too, one needs to look past the reservations against profanity, substance abuse, sexual intercourse etc..and better yet, come to terms with all of the above. A romantic at heart, passionate about what he loves, an idealist who can be reckless, arrogant and entitled too. A person who can see what could be and is conflicted with what is and can't deal with the reality with a calm composure. One who has little tolerance towards nonsense and lives by high expectations. A perfectionist who isn't perfect. A bipolar journey, where your mood dictates. The intensity of emotions is high. The art of embracing emotions and doing what is effective is absent. There is no consistency, as in life. The behavior is out of scale to the triggers as per the usual norm. A parted love draws him into a sombre place; a departed soul shakes him and sorts him out.  Explosive, obsessive and compulsive, intolerant, substance-abusing, refusing help, humiliating people who help, belittling friends, failing to apologize - these just characterize his cries for help. When it comes to a medical surgery, he can get through successfully even when he is intoxicated. But when it comes to an emotion, he can't handle gracefully as expected by the society. His friend - who almost doubles as his therapist - knows his pain, helps him cope with the hurt especially when he doesn't like his choices or agree with his behavior and in spite of the insults he receives. He separates him from the behavior. It's hard to see that way and stay supportive. Which is what everyone deserves. Especially people with a mental illness need that kind of empathy to survive. It's hard to care for such an intelligent yet turbulent being. It's an imposition. There are no bad people, there is only bad behavior. There is always a cause. And a consequence. The lesson here is to understand pain, help to alleviate the suffering and then the biggest of them all...to forgive. It's all about empathy. He thinks he could have been a neurosurgeon if not for love and other distractions. I wish he were, he could've known the brain anatomy better, how his amygdala, hippocampus, insula or the prefrontal cortex work. The mere knowledge wouldn't help to prevent any behavior but that would definitely help handle the consequences better and might help manage his mental health better. A person who understands objectification of women and talks like a feminist, but at times, when it comes to his own love life, he acts like a predator, choosing his mate, making his moves, and marking his territory, almost abusive, dictating even who she needs to be friends with and violate her taking advantage of his senior status, almost coercing her to accept his stance. She doesn't fight back either and falls in love too. It almost feels like glorifying a lion and the lamb kind of a story. Almost doesn't count. So, let's give some benefit of the doubt. I wish there was more to the girl's characterization before their break up to clear any ambiguity.  In a society where you are expected not to lose your virginity until you are married, where the concept of dating is still frowned upon and the religion you're born into (whether observed or not), caste system (whether you care or not) and financial status of your parents (which is irrelevant), food habits (by birth or by choice) even become objections to love. PMS is mentioned (although the failed mention that it's not always physical), pre-marital sex which is still a taboo is depicted, this movie is a litmus test to a society that still attributes virginity to women even more so than men, also, pregnancy which is normally attributed to the mother rather than the couple. A society where a mother can almost never have a conversation with her girl along the lines \"Have you guys kissed? Are you guys being safe?\" Above all, the terms and technicalities of the subject of mental health are completely alien or beyond comprehension for those who don't have first person exposure, which is the majority of such society. Despite the cinematic cop-out of a climax (except for the strength of the character to accept the baby before the truth is revealed ), it's not after all a promise to a \"happily lived ever after\" life. There will be more episodes in his life or he may not relapse at all. That's the nature of such disorders. There is no taking control or grit when comes to the ways of a brain. People do need to understand this. More than any other emotion, anger is the most complicated to fathom and to accept. Knowledge is out there for those who seek but wisdom is not a guarantee. And dare I say, this story holds true with a female protagonist too. A bipolar woman breaking up with her partner, suffering through the aftermath, making choices against the norm ...pregnant or not, who tries to move on or not, gets back together or not..it's all the same.  I dream of the day when the world is no longer in need of feminism. I dream of the day when the intangible pain of the mind is given the same credence as bodily pain, if not more, and any disorder is mentioned without a negative connotation, and the stigma around mental illness truly disappears, and seeking therapy need not be a secret, resulting in better mental health."
    },
    {
        "author": "shobanchittuprolu",
        "review_date": "26 August 2017",
        "title": "Arjun Reddy is a raw and honest take on youthful love stories with award-winning performance from Vijay Sai Devarakonda.",
        "review": "Arjun Reddy (2017): Arjun Reddy got immense craze which is no less than the craze Kabali got.Youth went crazy after watching its trailers and posters especially because of its cuss words and kiss scenes which are quite bold to Telugu audience.But what came as a surprise is its realistic and honest portrayal of love stories.  Plot: Arjun Reddy (Vijay Devarakonda), an ortho doctor has issues with alcoholism. He is an efficient ortho surgeon, but on the personal front, he is an alcoholic. And the reason for his turning into one is his love failure during his college days in Mangalore Medical College.While in college, he falls for first year student of MBBS. Preeti (Shalini) too likes him and their edgy love affair begins. Her father doesn't agree to their relationship and a huge tussle happens between Arjun Reddy and Preeti's family. This results in Preeti's father marrying her off to another person.After knowing that she got married, Arjun Reddy turns alcoholic and his anger issues further escalate. He becomes a modern-day version of Devdas who takes to alcohol, drugs, and tries to distance himself from the society.Rest of the story showcases the journey of Arjun Reddy as to how he regains his senses and gets back to normal.  My Review: Arjun Reddy may have attracted audience with all the cuss words and smooches but it is one of the most realistic love stories in recent times.Arjun Reddy is like Kumari 21f of males.Sandeep Vanga has chosen an unconventional way to give new feel to audience.  This is the story of the lead character Arjun Reddy, and yet there isn't a story, a structure to be precise, to follow and anticipate what might happen next. It's the rise, fall and rise of Arjun, and his journey of love and suffering, is nothing short of poetic and heart wrenching.Sandeep presents Vijay's character from different perspectives and from each point of view; we get to understand Arjun even better. For Arjun's father, his son's actions are stains on his prestige. For his friends, Arjun's actions show his recklessness and free-spirited attitude. For Preethi, Arjun's actions show his madness and unwillingness to change, which she eventually embraces.  There are lot of amazing scenes in the movie which has immense depth in it.Especially the scene where Arjun rejects a guy who came to marry his friend's sister because that guy talks cheap about females.That shows the true nature of Arjun Reddy.The scene where heroine tries to calm down infuriated Arjun is one of the best scenes of the year.  It's not the number of lip-locks or the use of expletives that make Arjun Reddy a brave film. What really makes it a brave film and its director, a man with guts, is that it ventures into a space Telugu cinema has dared to enter and I doubt if it will ever. It shows that any story, when told with conviction, will be accepted and celebrated.  But the major drawback is its lengthy duration which is 3hr 06 min.Almost 30mins of the movie can be edited out as most of the scenes feel repetitive in second half.It is clear that director did not want to lose any detail of Arjun reddy's fictional life but he should have written some strong scenes which are entirely missing which make us feel Arjun's pain.  Vijay Devarakonda stuns you with his performance which is surely award winning. The way he brings the pathos and pain in his character is something else and drives the film completely. His dialogue delivery, the aggression he shows and the emotional manner in which he showcases his love is superb.Vijay's performance as a college-goer with serious anger issues or as the alcoholic surgeon will leave you in awe of his versatility in pulling off such diverse avatars with ease, as if it was child's play.  Rama Krishna who played Arjun's friend is brilliant as he entertains with his witty dialogues reactions.Actress Shalini may not look pretty but gave good performance.Yesteryear actress Kanchana is very good in the role of free-spirited grandma.  Songs are good but its the BGM which is the soul of the movie.It elevated proceedings in brilliant way.  So,Arjun Reddy is a raw and honest take on youthful love stories with award-winning performance from Vijay Sai Devarakonda.  My rating 7.5/10"
    },
    {
        "author": "disizzgsk",
        "review_date": "9 September 2017",
        "title": "Arjun Reddy Master Piece, Path Breaking, Trend Setter of the Decade",
        "review": "The movie is all about the attitude of Arjun Reddy,his love,ambitious way,especially anger guy. In telugu industry we don't seem this kind of movies for past decades. A trend have to introuduce as of moment in telugu.  Vijay Devarakonda and Direction,Story,Screenplay are the Heart of the movie. We cant take down any of these. Vijay perfection acting felt us a different guy in T'town and finally got Star crazy. Direction appreciable, new guy to industry where he puts whole heart and has given master piece to telugu people. The movie is out standing of every character so many characters relative to real life especially telangana local language used in very descent. Actress wow she is good supporter and Friend Character of Hero was impressed us so much. All elements put in the movies. only thing is Its a youth movie A Certified but all centers people loved this and smash hit this time.  I hope to get so many awards and rewards to this film. Till so many appreciations from critics also. I hope so strong Vijay will be the Best actor in filmfare awards where he missed the award with pelli choopulu. Vijay acting in a failure lover character is really great much"
    },
    {
        "author": "gugan94",
        "review_date": "6 September 2017",
        "title": "A simple story told in a different way!!!",
        "review": "Arjun Reddy from the starting scene tells us that this movie is not going to be a normal travel. Be it the actors looks, attitude,dialogues the movie will go places. Vijay Devarkonda kills the performance and he has perfectly executed the 3 roles in the film. The film dialogues are good it increases the engagement of the movie. The movie is a bit lengthy and they have managed to engage the audience throughout the film but in some places the melodrama becomes very low. The director needs to be appreciated for his way of telling the story and handling of emotions. Supporting cast have done their job perfectly and to sum it up Arjun Reddy is a normal story but told in a different way which will make the audience worth the money."
    },
    {
        "author": "Shashiishere",
        "review_date": "26 August 2017",
        "title": "Flawed Devdas..again!!",
        "review": "It's a sad feeling that you get coming out of the theater, similar to what the main protagonist experiences throughout majority of the running time of the movie (whopping 3 hours). It's sad because such an unconventional, daring,bold, courageous movie couldn't come out if the shackles of a typical mainstream climax. Wish you could erase the final few minutes of the movie and rewrite the script to something mature and inspirational. But having said that, you would have experienced something that very rarely comes out of Telugu or Indian Cinema already which deserves rich applause to mainly the director and the male lead( which I'm sure is coming).  The movie just takes off from the word go where in flashbacks, we're introduced to a good looking,hot headed, topper in the final year of his medical college. He openly dares the dean, other medicos, gets violent very often and has all the habits a doctor shouldn't have. Still he is feared and revered by all. The scenes in the college where he falls for a fresher, the ragging, romance are all shot boldly with immense realism and shock value. But somehow you connect with the male lead who is his worst enemy. The director displays the same \"I care for none\" attitude throughout the film and you hardly get time to digest the new age, open and bold dialogues (majority beeped), PDAs & fights, but still you feel for the love story when it goes awry. That is where the hero and the film start a downhill course. You don't get to feel the real reason for the separation and subsequent pain, suffering, indulgence,recklessness, but that only a minor flaw because Vijay Sai makes you feel his pain and gives a character to root for even as he slides and slides into a deep pit.it is probably his best lifetime performance. The sidekick is fantastic as well even through the dark phases of drugs, alcohol, women and the rest. Alas,we don't get any perspective from the female side which is fine till out of nowhere you get a story which is unrelatable at the end. The music and background score are one of the highlights,so are the performances of all actors. The editing makes the movie overlong & repetitive. Kudos to the director to have done research about the medical field and for a very intelligent yet realistic premise which is hugely promising. It is flawed on a few counts but if you could wipe out those parts you will be thoroughly entertained."
    },
    {
        "author": "reddyneeraj",
        "review_date": "3 September 2017",
        "title": "This is a great movie.",
        "review": "If I would describe this movie in one word. I would describe it as RAW. Raw emotions, Raw anger, Raw jealousy. You would feel it , you would be involved in it. Props to the director and the actor Vijay Deverakonda who plays Arjun reddy. Their brilliance makes this movie amazing. A master piece in its own right to the Telugu cinema industry. The story line is believable, the characters while extreme at times come back as real people with their own flaws. While there wasn't enough depth to shalini pandey's character, It makes sense to not have it as the movie wasn't about her character.  The direction is top notch. Im not a big fan of the background score but it wasn't distracting and kept me involved at the right times. Props to the actor Rahul Ramakrishna who played Shiva. We are you sometimes, in the movie, with your reaction matching mine.  In an industry stale by big names, the same directors. Which prints out the same old move with a \"twist\". This is a refreshing change."
    },
    {
        "author": "praveenwudayagiri",
        "review_date": "29 August 2017",
        "title": "Vijay Devarakonda all the WAY!!! Beginning of a Cult...",
        "review": "Met expectations and was in line with the plot which trailer conveyed. Performance of VSD as Arjun Reddy was amazing as a crazy lover boy with anger management issues... the characters were well written and convincing performance from the others...Shiva, Gautam, Dean, Preeti, her Dad. Arjun's Dad, Granny, Preeti's Mom n Sister were not convincing compared to others. Music score was good...3 songs registered in mind and the background score was too good at certain portions of the film. Screenplay was captivating...St.Mary's college, Royal Enfield, the beach house, Alcohol, Preeti. Dialogues were very enjoyable and had a free flow mostly...comic bits were natural. No vulgarity and no obscenity. The portrayal of emotions for the lady love by the protagonist and the attention to details was very impressive. A thoroughly researched effort by the writer. Medicos and their fraternity have a film in their kitty and have a score of 1: n (engineering). \"A\" rating is justified keeping our societal norms in mind but for millenials it's acceptable in general. Congrats to the entire team!!! VSD has evolved from YvdSubr to Pellichoopulu to #ArjunReddy and is become a promising actor in the Telugu film industry. The climax was all Happy Endings....which could have been different....an abstract ending would have been much more apt...for all those who cant talk good about this flick - will sign off saying...Em matladuthunnav raaa... *#£"
    },
    {
        "author": "empressoftheflames",
        "review_date": "22 July 2018",
        "title": "Slow boring movie that makes no sense and hero has no likability",
        "review": "The hero is born into wealth and without any effort becomes a great surgeon who has a drinking/drugs problem and anger issues. Due to his unreasonable brashness, he looses his girlfriend and sulks about it for months. Even how he got the girlfriend is disturbing; from the second she steps foot on campus he tells everyone she is his and protects her from bullying. Their difference in personalities (she's shy) and age (he's a senior) makes it seem like he is taking advantage of her rather than a natural mutual attraction. Meanwhile, in present day, he has no respect for anyone, performs surgeries drunk and brings misery to everyone in his life. However there is a happy ending as he magically gets over addiction when his grandma dies and gets back his girlfriend who turns out to be pregnant with his child. The miscommunication and reactions of the hero and girlfriend are illogical and unbelievable. Even when he have lost everything, the audience may find it to sympathize with such a terrible human being.  Also the director applies slow motion to scenes often, even when it doesn't make sense. The background score is edgy and features English songs, probably inspired by Hollywood soundtracks. I agree that this is different from a typical Telugu movie but it also lacks proper plot and pacing. It glamourizes bad behavior and is more of a temper tantrum than a love story. If you want to waste 3 hours or are in the mood to hate-watch something, be my guest."
    },
    {
        "author": "rammus-10793",
        "review_date": "8 March 2018",
        "title": "Worst movie ever!! Encourages stupidity in society! 0 for content, 5 for stuff less style",
        "review": "Movie is hyped and may have been a hit in the eyes but in reality its a useless movie. Self created garbage and self created pain and non sense. Every seen looks interesting but in reality it so gross to encourage the culture recklessness and stupidity. Any person with common sense won't rate this more than 5."
    },
    {
        "author": "Takethispunch",
        "review_date": "15 September 2017",
        "title": "Awful turkey.",
        "review": "Arjun Reddy (Vijay Deverakonda) is a surgeon who is successful but also an alcoholic. His breakup pushes him to the verge of breaking down.  The story begins with Arjun practicing medicine in Hyderabad. Despite being high-functioning Doctor he is in a lot of pain and using various coping mechanisms, such as abusing drugs, sex and alcohol to deal with the pain."
    },
    {
        "author": "winner-98765",
        "review_date": "15 March 2018",
        "title": "This is what cinema should be!",
        "review": "Sitting in my room, my mind is still probing the edges of this one of a kind, beautifully executed, epic journey of a deeply flawed character that the director wanted to take us on. He has one message - love in any form is pure and free from any constraints that our culture might seemingly shackle us in.  In the first act, I hated this character that was supposedly the movie's protagonist. In fact, you will like any other character over him apart from the girl's father, and that sure is a warning sign for any story. I thought I would end up disliking the movie, which almost everyone has praised. But as the film progressed, I found myself getting hooked. This director, almost implausibly, made it work, and I couldn't praise him more for handling such a tricky, controversial plot so seamlessly.  With every scene, the director drags you into the messy life of Arjun Reddy. You will disagree with most of his actions, yet you find yourself relating to him. The director makes it work by focusing on the things which we all share, his emotions, his love for Prithi, and his passion for his field, the sincerity and candor in his dialogues. Every scene was shot beautifully, was interesting, and was important to the film, which is impressive considering the film was 3 hours long. It is also very easy to fall into the trap of using commonplace, hackneyed characters as your supporting cast with such a complex main character. You won't find any of that here. Each character is unique, and feels like a gust of fresh air in today's movie industry. More importantly, they all seem real. Not once, do you find any of the characters acting out of the personality and role the director has fleshed them in.  Kudos to the whole team of Arjun Reddy. You have sculptured a wonderful picture! You are the guys who are keeping cinema alive."
    },
    {
        "author": "ajay-92672",
        "review_date": "24 October 2017",
        "title": "Not a cult classic",
        "review": "I heard a lot about this movie but for me it is a just another average movie with a different plot and there are lot of negative things being promoted like taking drugs,drinking liquor,smoking cigarettes using abusive languages and making it look like cool and there was never a love story in this movie it feels like a forced love story where heroine falls in love after hero chases her"
    },
    {
        "author": "santosh-palkol",
        "review_date": "1 September 2017",
        "title": "This movie marks evolution of Telugu Cinema.",
        "review": "I live in Ahmedabad and I was desperate to watch the movie since the movie got released on 25th August.  Let me tell you, this movie marks the \"Evolution\" of Telugu Cinema. This movie is nothing but a cult classic.  Though Arjun has issues with anger management, he is a truly whole guy. He understands what true love is.  Kudos to the writers of the story."
    },
    {
        "author": "saqibhameed",
        "review_date": "31 October 2018",
        "title": "WATCHED YESTERDAY ITS MASTERPIECE from Pakistan",
        "review": "Each bite of the movie enjoyed .... freaking awesome movie.... specially the guy steals the show"
    },
    {
        "author": "piyushsarkar",
        "review_date": "22 September 2018",
        "title": "The best love story",
        "review": "Watched it with the subtitles, but not for a single moment did i lose the connection and the feel. One of the best love stories ever made. What a performace by both the lead actors. Commendable Job. Best film ever. Go for it guys even if you do not understand the language. After 10 minutes you won't even feel that language is a barrier.."
    },
    {
        "author": "harishchityala-39678",
        "review_date": "22 July 2018",
        "title": "Absolutely stunning !!!!!!",
        "review": "Not a film for everyone if you are a Telugu movies fan with fights, slow motion entry of a hero and with two item songs then it's not for you. No one can say it's a film of a debut director. Awesome direction by Sandeep vanga Reddy. Acting of Vijay devarakonda was just fabulous his acting will make you attached to the seats from start to end. Telugu industry has just reached a new level of cinema by this film ."
    },
    {
        "author": "subhaprakashsatyam",
        "review_date": "25 June 2018",
        "title": "Arjun Reddy is not just a movie. it thrives in every dimension.",
        "review": "Don't hold back but express. This is what this movie is all about. This movie is not about the script, It's about the character which Vijay Devarakonda has played. He did justice to the character. I would watch it 10 times and still crave for more."
    },
    {
        "author": "chirukiranu",
        "review_date": "22 June 2018",
        "title": "My take on AR !!",
        "review": "By now, around 100% of you might have watched the latest telugu movie called Arjun Reddy. 70-80% have liked it and around 20-30% have been nagging, mocking and loathing it in various platforms either because of religious bigotry or cultural divide or their teeny tiny brain can't comprehend on how to watch a movie or total lack of movie sense or sheer stupidity or some other BS. Whatever may be the reason, I'm not going to butter up here and profess that yeah, people have different tastes kind of mundane stuff. Arjun Reddy is raw, bold and intense story telling criterion. It mocks the age old commercial format in telugu cinema and razors every conventional way of story telling in TFI.  Here are some specific scenes and details which I adored in Arjun Reddy. These are a true testament to Sandeep Reddy Vanga's capability as a narrator. And btw, who's Vijay Devarakonda? I only saw Arjun Reddy setting screen on fire :). Absolute brilliance.  Scene 1 - Holi Fight: One of the best confrontation scenes between two characters. Pure adrenaline rush. Arjun creates the required impact thru his angry tears after that 'angerorgasm'. Shalini expressing her love, Amit's promise after flashing his ego and Arjun's victory all have been etched exquisitely into one episode.  Scene 2 - Interval bang: It was a WTF moment in a spellbinding way. The way the scene shifts from 'the spread on the bed' to the glaring title with blood dispersed in background is too good for a telugu movie. Such nuances make movie watching enthralling.  Scene 3 - Shalini's minor injury: Arjun gets injured by a piece of glass on the floor. He tries to pluck it out and the scene cuts to Arjun's friend removing a piece of glass from Shalini's leg in the flashback. Again, this is one more deftly crafted episode. Amazing screenplay overall.  Scene 4 - Football fight: Amit abuses and hits Arjun. And how does Arjun respond? He first smashes the referee who had fixed the match, then goes on with Amit. Not instantaneous. Well thought and controlled outburst like a fusion in a nuclear reactor.  Scene 5 - Shalini trying to calm down Arjun (6 hrs deadline): After the big fight with Shalini's dad, Arjun's arrogance and attitude comes out in brute force. His BP could have broken the sphygmomanometer. Shalini's tries her best to calm him down, soothe Arjun in every possible way. Does Arjun come back to his senses? Hell, No. This is Arjun Reddy. His characterization is linear throughout (always in the peaks). He still reminds Shalini of the deadline and storms away.  Scene 6 - Arjun snorting coke before trial: This is a direct lift from Denzel Washington's Flight. But what stands out is the BGM composed for this episode by Radhan. As Arjun snorts and gets high on coke, audience do get the same high curtsy BGM.  So, what are you still waiting for? If you are true movie lover (keeping aside all your religious and cultural limitations) go watch it again and again and get absorbed into the riveting world of Arjun Reddy. Welcome to new age Telugu cinema !!!"
    },
    {
        "author": "user-209-61939",
        "review_date": "5 June 2018",
        "title": "Anger management to the extreme!",
        "review": "Telugu cinemas are designed for keeping the audience glued to seat till the end. And if there is no comedy it's not entertaining. And the protagonist/hero has to fight off hundreds of antagonists/villains. If the movie has no happy ending then there will be less turn out in theaters second day after its release.  This movie tried to break above stereotypes except the happy-ending part which was quite predictable. Most movies in South India are trying to break the typical run-of-the-mill action-comedy love story flicks and looks like this is one of the rare movie made in Telugu language. Relatable to Kannada movie Kirik Party(2016), where the protagonist has transformation of his face from clean shaven to sporting beard and clean shaven at the end. Also the college rowdyism is somewhat similar.  As far as I counted there are 5 languages spoken in this movie: Telugu, Tulu, English, Kannada and Hindi. Since the college story takes place in Mangalore and the lead female character's family is from Mangalore, Tulu language is used in multiple occasions and maybe rare in Telugu movie to share good space for other languages. Most of the South Indian movies try to keep it strictly for one language.  On the locations used around Mangalore, the college building(red building) shown is actually a government run Arts, Commerce and Science college and so no medical course taught there. The girls hostel is probably a historical house behind the busy street of Jyothi circle. The house where Arjun and his friends stay is probably Summer Sands beach resort at Ullal.  As most reviewers wrote, can't agree on Arjun trying to control Preethi as a ignorant toy and Preethi loving Arjun just like that as he treated her when she got injured. He goes to extent of threatening juniors of staying away from building a relationship with her. Also initially kissing on cheek without her consent. Then after breakup with her when he is not able get permission from Preethi's father for their wedding, the character goes into path of self-destruction. This becomes highlight of the movie. At this stage, even though he is a successful doctor, he indulges in women, drugs and alcohol abuse.  The role of antagonist Amit is very short. Can't make out whether he is a localite(which is more likely) or North Indian because protagonist Arjun communicates with him in both Tulu and Hindi even though Arjun also knows Kannada and English. The second encounter was one long take and is very well done. If it was as claimed on film articles, done in a single take, then really a good acting demonstrated by all the actors in the scene. Also Vijay acting as Arjun spoke in three languages(i.e., Tulu, Telugu and Hindi) all in one take.  At the end it's just another Telugu movie based on love story minus the nonsensical action and comedy. The movie is 3 hours long but will keep you hooked. Expletives used on all the 5 languages used in this movie. And some bold themes and scenes. So not a family entertainers. This is an adult only entertainer."
    },
    {
        "author": "shravanbelde",
        "review_date": "5 March 2018",
        "title": "Just watch it",
        "review": "The best there was, the best there is and probably the best there ever will be. Arjun Reddy is a 5/5 film and rating all the remaining films in the industry below 2.5/5 will do it justice. Vijay Sai Deverakonda delivers the best performance ever seen by a male lead in 75 years of our cinema. Thanks a ton for giving us this film Sandeep!"
    },
    {
        "author": "jawedjhms",
        "review_date": "30 January 2018",
        "title": "Arjun Reddy Vijay Deverakonda on of his best performence",
        "review": "What is the specialty of this movies is you cannot come out from the story till end lights will on in the theater. Director Sandeep and Vijay's best combination. worth watching."
    },
    {
        "author": "siddurox",
        "review_date": "29 December 2017",
        "title": "A R J U N . R E D D Y",
        "review": "Love story of a free minded, ill-tempered and impeccable doctor by unraveling the chapters of his life in detail, through a journey of love, loss and suffering."
    },
    {
        "author": "Ansango",
        "review_date": "9 November 2017",
        "title": "Brilliant!!!",
        "review": "Holy s**t!  This is the best movie i have seen in this year so far. A great movie depicting love, loss, pain, heart-break, anger management, suffering, coming to terms with life and blends everything seamlessly in a nice package.  Storytelling is brilliant and revolutionary. Direction is splendid. Screenplay is brilliant barring some stupid mistakes especially during the ending. Not every story needs to be a happy ending. The whole movie was a gritty depiction of suffering due to heart break and has been build seamlessly but is sacrificed in the end only for having a happy ever after ending. The writer could have gone some other way to end the story. That would have looked more realistic. The whole film was so pragmatic but ending was out of the sync and turned every buildup into a non-viable mess.  The character of Arjun Reddy is well written but somehow falls into unrealistic zone. Admit it, He was a contemptible fellow yet director revers him almost like a superhero. That somewhat vexed me.  Other than that everything is superb. Innovative story telling, Stylish and deft direction, adroit cinematography, Beautiful music and bang on performances, everything was so proficient in its place. The depiction of love and its suffering is so raw and naturalistic. Three cheers for the director (forgive me, i don't know his name) for addressing such a novel issue in his very first directorial attempt, that too in such a bold way.  Overall a landmark in the Telugu cinema and a must watch film for every one for its cynical nature and its unique take on love, life and loss."
    },
    {
        "author": "ssrajshekhar",
        "review_date": "23 September 2017",
        "title": "Genre defining movie",
        "review": "By far the most intense and realistic love story told in Telugu cinema. This is how movies should be made. Everything about the movie clicks, right from the background music, the setting, supporting cast, the way the characters interact to the performances of the lead cast. Vijay has just nailed his part. You can't imagine anyone else doing this role better than him. I hope it is not an aberration but a sign of good things to come because Telugu cinema deserves such stories to be told in this fashion. My hats off to the entire team of the movie sir."
    },
    {
        "author": "freewebstennis",
        "review_date": "16 September 2017",
        "title": "Thought provoking movie👍",
        "review": "Great performance by Vijay Devarakonda... I think he will be called as Arjun Reddy from now on. His performance is of such brilliance. This movie is one to watch with an open mind. Don't watch it if you are those close minded fools who think kissing and sex is vulgar. However its not a movie for kids. So be matured before judging the movie. There are good and bad qualities in the lead role. That's what makes it interesting. The lead has some anger issues, an alcoholic, then becomes a drug addict. So he faces lot of problems because of such addictions and anger issues. But the lead has many good qualities like self confidence, free spirited guy. He has some great human values however the movie really projects how worse a person can get if he can't control his anger. Youth must not blindly follow Arjun Reddy's mannerisms because it can lead to very bad consequences but must understand that the importance of anger management and also how dangerous addiction can be to oneself. So please watch with a clear mindset and don't impersonate Arjun Reddy's anger and addiction. All actors did great job. I appreciate the lead's friend character. That is a true friend for life. Recommended to watch!"
    },
    {
        "author": "akaithy",
        "review_date": "15 September 2017",
        "title": "Excellent Movie",
        "review": "This movie directed and acted very natural language and usual street dialogues and native to Hyderabad slang and impressive story. Must watch it for fun, there are so many controversies regarding this movie. Vijay Devarakonda acting was amazing and this is 4 the movie but all worth watching of it."
    },
    {
        "author": "pracash-venkata",
        "review_date": "13 September 2017",
        "title": "One of the best all time telugu movies",
        "review": "We should appreciate the young director Sandeep Reddy Vanga for bringing such a wonderful movie. Vijay D is 100% fit for the role he played. He has done exceptionally good as a Arjun Reddy.  Good for college students and youngsters. Not for families who want to go with their kids."
    },
    {
        "author": "iravavastav",
        "review_date": "6 September 2017",
        "title": "ARJUN REDDY: Mission Undefined",
        "review": "This movie spins around a character Arjun Reddy(as titled), an orthopedic doctor lacks emotional regulation in a broad sense. Situation becomes worse when her loved one since college Preethi(character name) getting married to other person. Rest of the movie continuous on how he handles this phase of life and clearly depicts the thought process of a younger generation in a similar situation when they come across.  Definitely, an unconventional Telugu film with a lot of freshness and strong characterization. Casting for the entire movie lived up to the hype, brings a great deal of positive reviews to the movie esp the performance of Vijay Sai(Arjun Reddy) and Rahul Ramakrishna(Shiva) was amazing. Goosebumps for the background score in the theater with a feel good music.  However, movie lacks conclusion. The way climax ends lack the maturity of the character Arjun Reddy. Majority of the audience understand that movie is all about how Arjun Reddy fails to handle the situations in his life overcoming anger. As such, this movie justifies the negative shades of the Arjun lacking solution or message driven which may misguide the youth by imbibing the character of Arjun Reddy in to themselves."
    },
    {
        "author": "karkakrishnareddy",
        "review_date": "6 September 2017",
        "title": "Super movie with fresh stuff and natural acting",
        "review": "Super movie with fresh stuff and natural acting, Vijay deverakonda nailed it with his natural and daring acting. he is a future superstar to TFI. Vijay shown immense maturity in all the aspects of his acting skills.  Shalini and all other friends characters are lived up to the hype."
    },
    {
        "author": "mynameisrakesh",
        "review_date": "5 September 2017",
        "title": "Arjun Reddy - Vote for the Attitude Love this Movie ♥♥♥♥♥",
        "review": "Arjun Reddy is a 2017 Indian Telugu language coming of age-black comedy drama film written and directed by Sandeep Reddy Vanga, produced by Pranay Vanga for Bhadrakali Pictures. The soundtrack is composed by Radhan. The film was released on 25 August 2017. The film tells the story of a young and brilliant medico Arjun with anger management issues.[3] The film received critical acclaim and gained a cult following among youth in Telangana and Andhra Pradesh. The film has faced controversies and censor issues but has received positive reviews.  Very natural and commonly used words among friends. Love this story..  True love never fails."
    },
    {
        "author": "appetitefordestructionkam",
        "review_date": "12 November 2017",
        "title": "Could be much better",
        "review": "One more typical LOVE STORY that ends \"happily\" in totally unlikely circumstances. The problem is that some parts of the movie were very realistic (especially the dialogues but not how they were delivered) so gave me hope that it might actually end with a realistic point of view but again the director chose to please the general crowd.  Happy that the real issue of drug abuse and alcoholism among youth was shown (but now that I think of it, it seems like it was just added to make the movie appeal to the young crowd and not really to address the issue in the society) and some characters were sticking to speaking their native tongue (not seen much in Telugu movies).  One more disappointment."
    },
    {
        "author": "pavansaigadde",
        "review_date": "3 September 2017",
        "title": "SHIVA!!!!!! for our times",
        "review": "Yes, Arjun Reddy is the Shiva for our times. This movie has created suck a huge impact and gained cult following among the youngsters. Even though they is lot of criticism surrounding to it, I feel the movie has taken out Telugu film industry ahead. This movie has shown how the content makes the difference. Vijay Devarkonda has taken the movie to next level through his acting skills. He has gone into the skin of character and loved his life. We can call Arjun Reddy a trendsetter in terms of acting, directing, and concept.This movie is for those cinema lovers who were waiting for a refreshing movie. This movie has given a hope for audience that there is a new kind of cinema coming for us and for sure this is a beginning for upgraded version of Tollywood."
    },
    {
        "author": "Manish_Jha",
        "review_date": "15 April 2019",
        "title": "Arjun reddy = me + inhibitions",
        "review": "First things first.. Screw all parents who cry about caste.. Just all of you burn in hell..  I have never had such adrenaline rushing h moments in my life in any movie which I had in a few scenes in arjun reddy. The intensity with which vijay played the character in these scenes is commendable.. The lad in these moments shined like a star...  The college life's intensity was the fantasy of middle class.. Parental pressure ridden kid like me..I lived a life through him.. A life which I could lnt live on my own due to the unexplainable complexities of the matter around us..  In all the two Phases in the movie.. The college and surgeon phase was what did the magic for me.. I just loved it.. These two phases was the genius of Sandeep Vanga.."
    },
    {
        "author": "user-33237",
        "review_date": "4 March 2019",
        "title": "Welcome change",
        "review": "Nice movie. Saw very few telugu movies . They weren't my cup of tea. Been waiting for movies like this , Rangasthalam ws one such movie. Its a long movie but worth the hours. Recommended for people who like stories that go beyond & bring forth subtleties in relations surpassing all norms & prejudicial thinking."
    },
    {
        "author": "mjaveed-82918",
        "review_date": "11 February 2019",
        "title": "must watch movie in your lifetime",
        "review": "If this movie come at when complete my sslc definitely im going to become a doctor, what a movie and vijays act is more strength of this film , good to hear the news about tamil remake and also bala not to sdirect is too good, he doesnt give the originality of the movie cause bala is worst director ever seen"
    },
    {
        "author": "rafsangoni007",
        "review_date": "14 January 2019",
        "title": "Story of heartbroken guys",
        "review": "People who never had a relationship or have a successful relationship / love marriage will never understand the pain this movie tried to show. Those who get to lucky their loved ones are the most lucky people in this world. And those who are suffering in pain, I convey my deepest condolences to the people who have seperated in love. Hope things have worked your way."
    },
    {
        "author": "pranaykumarmaggi",
        "review_date": "4 December 2018",
        "title": "A \"MUST WATCH\" FILM 👌👌",
        "review": "There Are very few movies that makes u feel soo Emotional, This is One Among Them!! Comedy + Romance + Reality + Emotional + Great Performances = ARJUN REDDY 👍👍 This a a \"CULT CLASSIC\" of This Decade..!! Take my Hug Man \"ROWDY\" Vijay Deverakonda."
    },
    {
        "author": "nkj-vsp",
        "review_date": "3 December 2018",
        "title": "Superb movie with emotional touch of love & life",
        "review": "I cannot forgot this movie while watching i was reminding my old days. I was exactly like him not that much rude but yes it reminded old memories a lot. Vijay played such a nice role he is the lead in the movie as well. He is superb actor with phenomenal acting. Story is about collage days how we are spending time and he got involved in love with junior that was deeply touches his heart. Suspense open at last when he met she."
    },
    {
        "author": "saptarshig",
        "review_date": "1 December 2018",
        "title": "Best Tollywood movie of 2017",
        "review": "I have not Seen A better Movie than Arjun Reddy in Tollywood in 2017.Be it Acting,Writing,Screenplay all are neat and perfect.Even Though This Film Is 3 hrs long,You Will be easily In your Seats Watching Every Bit of The Movie.Vijay's Acting, Mannerisms, Attitudes are worth watching.He Deserves A Standing ovation for His Performance.Shalini Pandey's Acting Was Brilliant.The Climax of the Movie Is Perfect.Rahul Ramakrishna's Performance as best Friend Was Awesome.Society,Love,Career are Brilliantly Presented in this Movie. Kudos To the Director"
    },
    {
        "author": "tdanji",
        "review_date": "22 November 2018",
        "title": "More needed!",
        "review": "The pertinent point here isn't whether or not Arjun Reddy is a good movie, but whether it has dented the existing star-power driven ecosystem prevalent in the Telugu film industry. My verdict - I believe it has managed to make a good-sized crater!! A solid and meticulous screenplay, brilliant acting by Vijay Devarakonda, and a directorial effort from Sandeep Vanga that doesn't pull punches and stays away from typical formulaic hypocrisy!"
    },
    {
        "author": "cutekrishu",
        "review_date": "15 November 2018",
        "title": "English subtitle??",
        "review": "I watched this movie in telugu lang...i want to see it with eng subtitle..is this movie with eng subtitle here??"
    },
    {
        "author": "naveendude",
        "review_date": "21 October 2018",
        "title": "Angry young man's love story",
        "review": "Raw hard hitting love story of a angry man.. Arjun Reddy played by Vijay Deverkonda. The way he potrayed the role is top notch.. nobody can replace him. I can simply boost about this movie just because of it's rawness like speaking bad words, using drugs, wanting a sexual relationship, but it will be shown beautifully.. like u will love the way it has been picturized.. Overall Arjun Reddy is a good movie..🙂"
    },
    {
        "author": "mpnish",
        "review_date": "19 October 2018",
        "title": "Great movie",
        "review": "The movie is great.vijay devarakonda had done a good job in his role.sandeep had directed this movie with a lot of emotions.this movie is one of the best experience."
    },
    {
        "author": "Azanspy",
        "review_date": "10 October 2018",
        "title": "Deverakonda, rise of a new star.",
        "review": "The movie overall is not so good as the social media and critic's say. It's just an okay movie. What was so good was Vijay Deverakonda. He was so good that he maybe the reason why everyone liked this movie so much. Shalini Pandey did a very poor job on the other side. Three hours is long for any movie. But it is necessary here. Direction was also good."
    },
    {
        "author": "premjs",
        "review_date": "3 October 2018",
        "title": "Great acting let down by a poor climax.",
        "review": "No doubts this is one of the best movies ever made in Telugu Cinema, having said that what could have been a great ending was ruined by the climax. Vijay Deverakonda lives through the character and Rahul Ramakrishna as his friend is amazing. There's not a lot of importance given to other characters as all of them get equal screen time."
    },
    {
        "author": "mohitgediya",
        "review_date": "23 September 2018",
        "title": "best movie ever , Just watch it .",
        "review": "Vijay deverakonda acting ,emotions , dialogue are very impressive ."
    },
    {
        "author": "shouthri",
        "review_date": "23 September 2018",
        "title": "Pakka",
        "review": "Love Angry Sad Feeling Styles Smoke s Drinks Friendship Relationship Alone Pet Sports Fight Bike Tears Magical Kiss Expressions Role Family Caste is that waste Strong Marriage Twist Profession Reaction Living together __________________ And more.........."
    },
    {
        "author": "dr-prasannashetty",
        "review_date": "6 September 2018",
        "title": "Good one time watch",
        "review": "Good story overall but bit lengthy,slow paced. Both fight scenes could have been skipped. Many unwanted scenes in between without adding much to the story. Also hero suddenly remembering about Hippocratic oath in front of the judge is unbelievable. Coming to the climax , I was expecting him to move on with his life but they made an happy ending which is fine but the heroine remaining untouched by her husband and the kid being his own was intact regressive. May be the director waned to show her side of love too in the end . Overall enjoyable. Special mention to the part played by his friend. His advise and comedy enjoyable."
    },
    {
        "author": "geoffinxavier",
        "review_date": "29 August 2018",
        "title": "Good movie",
        "review": "Good movie really loved it...liked the way they made the film....good acting....feel like a real story"
    },
    {
        "author": "iamrrv",
        "review_date": "4 August 2018",
        "title": "Watch it.. You will Love it",
        "review": "A superb Acting and a Fantastic direction. Vijay' best performance ever. Actress was also acted and looks really good. Everything is perfect. I personally don't like to watch normal Telugu action movies but one of my friend suggest me to watch this. I lobe this movie"
    },
    {
        "author": "atef-04088",
        "review_date": "2 May 2018",
        "title": "Arjun reddyyyyyy.... An extraordinary Movie",
        "review": "Arjun Reddy (Vijay Deverakonda) is a vintage Bullet-riding, football-playing, angry, young final year medico who believes his actions are always justified. Preeti (Shalini Pandey), a first year student, walks into his life and it is love at first sight for the protagonist. She is a stark contrast to everything he is and at first, it seems like he bullies her into spending time with him. But time passes, love blossoms, passion roars, and nowhere does his fire lessen.  But things change; circumstances force Arjun away from his love and he seems to hit rock bottom with a force that's surprising, yet expected. He turns into a modern day Devadas, complete with a dog by his side. From a brilliant young man whose only issue was his anger, he turns into a raging alcoholic who smokes pot during his downtime and does coke whenever it gets too much. Despite all this, he continues to practice as a surgeon at a hospital till life threatens to throw him on his back again.  There's one dialogue in the movie that perfectly sums up the character of Arjun Reddy. Priyadarshi, who plays a cameo in the film, calls Arjun a 'free spirited individual in a democratic world'. There's nothing more apt than that to describe a character that you would both love and fear if you met him in real life. With 'Arjun Reddy', Sandeep Vanga has managed to tell a story that is seldom told, without sleaze or cheesy lines or OTT drama.  The protagonists of this film refreshingly refuse to confirm. All things scandalous to the world become but a way of life for Arjun. He questions the righteous middle class morality that society keeps throwing at his face, and lives his life without giving a damn. Even while turning to drugs, alcohol and casual sex, there's an I-don't-give-an-eff attitude about Arjun. For him, these are just means to an end -- an escape from his heartache. The writing is so real, the acting so raw that you forget Arjun Reddy is a character played by Vijay Deverakonda. You feel this the most when in a key scene before the interval you face a heartbroken Arjun Reddy and realise you too are left with a broken heart and lump in your throat as well. After a light-hearted film like 'Pelli Choopulu', Vijay Deverakonda has proven he's more than just a pretty face, by carrying off a character as complex as this.  Preeti, on the other hand, starts out as a timid student you believe is being bullied and transforms into a woman who's right in her convictions and strong enough to stand by them.  While Vijay Deverakonda is hands down the star of the show, and Preeti manages to come a close second, it is the character of Arjun's friend Shiva (Rahul) that deserves a special mention. He manages to be the sunshine in a world that keeps getting darker for Arjun. Kanchana who plays his grandmother in the film pulled off the role with beautiful ease too.  The dialogues, characters, instances in the film are so raw and realistic, one almost does not mind the long run time that drags in the second half. What also deserve a special mention are the beautiful songs, with music director Radhan doing a brilliant job of them. 'Arjun Reddy' is simply put, the dawn of a new era of films for the Telugu film industry."
    },
    {
        "author": "ayushomerao",
        "review_date": "8 April 2018",
        "title": "Truly a Masterpiece...",
        "review": "I have watched it with english subtitles, as the movie was in telugu (or whatever is it ), Please watch it ... It is a request."
    },
    {
        "author": "travist-44900",
        "review_date": "4 April 2018",
        "title": "Great movie",
        "review": "It was a brilliant performance delivered by Vijay and his friend Shiva sinma fame . outstanding background score is an added advantage. must watch movie. 3 hours will pass like that"
    },
    {
        "author": "sourov011",
        "review_date": "13 January 2018",
        "title": "A True Romantic Masterpiece",
        "review": "An angry man can also love and how pure that can be have been perfectly expressed in this movie. The actor did a tremendous job! In the first half of the movie, the actress could have said few more words. But everything was overpowered by the story-line and madness of love.  The director and writer did a pretty good job. So did the actor. This movie is a masterpiece and masterpieces. And the ending plot twist was also praiseworthy.  Highly recommended for all the couples who are going through a hard time."
    },
    {
        "author": "kotiyadav",
        "review_date": "17 October 2017",
        "title": "Arjun Reddy!now it's better than other movies.",
        "review": "Nowadays in the Tollywood every movie is common plot and repeated scenes,we expect what is next and also expected everything. But coming to this movie it's better than other movies. Plot: This is not a different story,many films are released with this story in Tollywood.hero see a heroine and love her she also loved him and next what happened and finally how they got married,this is all are common.so no different plot. But this is 3hours film.Present all movies are maximum 2:30 hours, coming to this director is great because he leads the way of movie is awesome when we watching the movie every scene is awesome,no slow narration and not we expected scenes.but only one or two times we fell lags the film than coming another scene. So finally this is good film when compared to other movies in these years.Go and watch this film.it is worthble for money."
    },
    {
        "author": "shrikantforu",
        "review_date": "15 November 2017",
        "title": "Cheap and lacks sense and essence",
        "review": "Really stupid movie. The male protagonist kept mastrubating on the set while audience were watching (some who gave a 8/9 star here) and at the end the director just quoted some silly love Friendly quote and called his lust/sleeping with other girls justify love at the end. Just tells me how low the Indian crowd has stooped"
    },
    {
        "author": "Themoviebuffster",
        "review_date": "18 June 2018",
        "title": "Overhyped.",
        "review": "It can definitely be considered as a breakthrough film in the TFI but it lacks realism. It is established as a bold, raw and an intense film which it is but I don't think a character like Arjun Reddy exists in the real world which implicates the rawness and the realism of the film badly. It almost felt like a try-hard film trying to break all the barriers at once which is good for entertainment but bad for any sort of message or symbolism. The highlight of the movie is with no doubt Vijay Devarkonda who shows his brilliant skills as an actor etching the role of 'Arjun Reddy' into the list of characters of a lifetime so its worth the watch to view his acting brilliance, but the story is definitely overhyped and monotonous which kind of feels depressing to watch but I guess that's the \"rawness\" they are talking about. Don't watch it with your parents ;)."
    },
    {
        "author": "ahooda-85743",
        "review_date": "17 April 2018",
        "title": "Worst movie on the planet",
        "review": "It's such a bloody waste of time. The actors should jump in the river."
    },
    {
        "author": "kkv-92213",
        "review_date": "19 December 2018",
        "title": "Flop movie",
        "review": "Really flop with some average talk it became just hit waste movie"
    },
    {
        "author": "goremaheshm",
        "review_date": "30 September 2018",
        "title": "Boring",
        "review": "At first story doesnt move at all. Why dont they create a web series out of it? Very slow moving and worstly written telugu movie."
    },
    {
        "author": "dassmi",
        "review_date": "28 September 2018",
        "title": "Overrated",
        "review": "Highly overrated. Is this never ending confused mess of a film a cult classic as claimed by a section of people? On one hand the hero Arjun rebukes someone for objectifying women and on the other hand treats a girl as his own property. Cringe-worthy double standards. All stars are for the actors who have put their whole and soul into the movie."
    },
    {
        "author": "arunprasathcdg",
        "review_date": "25 September 2018",
        "title": "Worst movie - bad influence",
        "review": "Worst movie ever garbage ! Drugs sex abuse agrression disrespect for women which these days women love ! Pornstar vijay devarkonda"
    },
    {
        "author": "hemaabcde",
        "review_date": "5 September 2017",
        "title": "Nice Concept presented in an unconventional manner",
        "review": "One of the amazing performances on the screen. Background Music is amazing. These days big heroes movies are coming with routine commercial stories but this type of movies are changing the way the Telugu film industry has to adapt to. The only negative thing is too much of drugs, alcohol and cigarettes. Teenagers may get carried away and spoiled otherwise it is a good movie and fell in love with Vijay's action. His natural action is fabulous."
    },
    {
        "author": "kenneriuagan",
        "review_date": "18 October 2017",
        "title": "Arjun Reddy takes Tollywood to a whole new level",
        "review": "Seeing the teaser takes you into a whole new movie experience. The trailer comes with a complete twist that rejects the ideology of the teaser which is a twist most audiences wouldn't expect. The movie is an excellent love story portraying all the deep feelings of a love story. Mr. Radhan really outdone it with the BGMS. The songs are excellent. This movie shows that a movie can really stand out even if it has a low budget.Overall, This film is a must watch for adult audiences though not for below 18 groups due to the intense dialogues and the continuous use of alcohol, tobacco and drugs. A movie like this is what youth needs. The film industry needs to show the world what a Telugu film can do at it's best.  SPOILER ALERT!!!!!!:  The first half of the movie is absolutely perfect. Director Sandeep Reddy Vanga made the first half excellently. But, it is the second half where I feel that the story is being dragged a lot. Even though, the climax scene is highly emotional.If, the second half was not so boring then the movie would have amassed a record success in the box office. The portrayal of an excellent medico with a failed love story is a dangerous combination shown in the movie. The way Arjun speaks, the way he warns, the way he warns Amith to not mess with his girlfriend is what shows Arjun's intense feeling. This is in no way a movie, it a whole new experience into the life of Dr. Arjun Reddy Deshmukh"
    },
    {
        "author": "xchintu",
        "review_date": "7 April 2018",
        "title": "A modern cult!!!",
        "review": "Arjun reddy is an unorthodox film which does everything the right way. The lead character himself is enough to take you through the entire movie even if there was no plot or anything at all. pure brilliance is-are the only two words that can use critic this movie in the most simple and modest way. A beautiful story, a different kinf of love story laced with fresh and insanely ralistic and awsome characters and the dialogues and screenplay is a level higher than any other south movie till date. A lot to learn and cherish from this movie. Just watch it. Now!!!"
    },
    {
        "author": "nateshmbhat",
        "review_date": "24 December 2017",
        "title": "No words to describe how I am feeling after the moment the movie ends",
        "review": "This is a gem of a movie which has a lot of deep messages which are worth seeking in life . Not to mention the phenomenal acting , the movie has message to all those who have gone drug addicts and drinking addicts in life and serves as a kind of hope for those who have lost each other in love . If you have't watched it and reading this review , I suggest you watch it first coz its worth it."
    },
    {
        "author": "siva-khanderao-899-480987",
        "review_date": "25 November 2017",
        "title": "Best Telugu movie of this generation",
        "review": "Amazing movie. Bold, Honest, Kickass & Entertaining !!! Great direction & acting - complemented by awesome background score, songs & cinematography. Made for the cult audience & best Telugu movie of this generation.  Vijay Deverakonda rocks as Arjun Reddy - one of the best performances ever by a Telugu actor - with amazing style and attitude. Once in a lifetime role for any actor.  Sandeep Reddy Vanga put his heart, soul, skill & life experiences into the making of this movie - and is perhaps the most promising young director to watch out in the Telugu Film Industry. No one can believe that this movie is his debut directorial venture.  It's a MUST WATCH movie !!!"
    },
    {
        "author": "riteeshbommaraju",
        "review_date": "24 November 2017",
        "title": "Dawn of new movie era",
        "review": "One of the best movie in the recent past. This movie can be taken in 2 ways 1. We can take out negativity like smoking , drinking and all those stuff  2. We can feel the feelings expressed by Arjun and love between them and those kisses of Love.  Overall this movie is a movie which is near to reality and VIJAY, SHALINI and SANJAY REDDY VANGA Rocked the film"
    },
    {
        "author": "Jithindurden",
        "review_date": "15 November 2017",
        "title": "Spoiled to chaos with heart",
        "review": "In the first act, we see Arjun Reddy as a spoiled rich and brilliant brute who does whatever he wants without any consequences. I hated the protagonist at that point. But then it started making more sense, he got a lot of negative aspects, he is nowhere near perfect even with all of his acts of righteousness, machoism and philosophy but he is honest in a society that tells you to lie at every turn of life. The misogyny and objectification through context (usual Telugu films directly do that) exist but it is also part of the world we live in and it is necessarily a part of him that makes the character more realistic that goes along perfectly with his toxic masculinity. Arjun Reddy succeeds where Kaatru Veliyidai was a failure in that sense. Vijay Devarakonda brilliantly portrays Arjun Reddy going through all those transitions. Even with all the familiar tropes at every point in the plot, the film keeps you engaged and gives some fresh perspective which may not be easily relatable but part of the world we live in."
    },
    {
        "author": "pokhrelnarhari",
        "review_date": "25 October 2017",
        "title": "Modern day Devdas",
        "review": "The story and the performance of the entire crew makes the movie so believable you want to keep watching it again and again. Or just once because you can't handle the content this movie has to offer. Preeti might not be the most beautiful Paro, but she sure is a better actor than many in the industry.  you will not regret watching this movie for its entirety."
    }
]