[
    {
        "author": "dimple-hirani",
        "review_date": "15 February 2019",
        "title": " Masterpiece of indian cinema",
        "rating": "10",
        "review": "Was never a fan of rap or ranveer singh but this film has totally floored me. On the surface it seems like a rags to riches story but it's so much more. Truly poetry on celluloid. Ranveer does a Bhachan esk performance. It's all I'm his eyes. Just masterful acting cannot believe this is the same guy who played Khilji? ??"
    },
    {
        "author": "bharatkgump",
        "review_date": "15 February 2019",
        "title": " To all the reviewers who are saying Gully Boy is copied from 8 mile",
        "rating": "8",
        "review": "NO ITS NOT COPIED FROM 8 MILE. Did you guys watch 8 mile and Gully Boy both?if you do think they are the same, then you need learn how to watch movies before you compare them. You also need to understand what a movie genre means. May be search in google to get better understanding.you all are saying 8 mile and Gully Boy are the same based on just few things as both movies are about rappers and their struggles. its like calling all the love stories are same because there is a boy and a girl in the movie.From the above rating you can see I liked Gully Boy, music and performances are very good. rapping looks natural. Alia Bhatt is a fire cracker in the movie. I just wish there is lot more to the story. its a worth a watch. Please dont listen to anyone who says its copied from 8 mile, watch both movies to decide for yourself."
    },
    {
        "author": "kunder-akshay3",
        "review_date": "14 February 2019",
        "title": " Slow and Calm Masterpiece",
        "rating": "9",
        "review": "Gully Boy merges into you and makes you feel as a part of Murad's journey (Ranveer Singh).\nDharavi 17 is where he stays and his daily struggles,his exposure to rap, his love life, a mistake in relationship,his guide,his well-wisher,his bonding with parents..\nA common man's journey actually.\nWe all have such stories in our life.\nZoya has brilliantly captured the gully life here and shows how it moulds oneself with the amount of time you spend with people around you.With every movie this guy gets better.So once again Ranveer does his one of career's best.\nAlia is the show stealer with dialogues that gets the whistle. We have three supporting Vijays here in this movie Vijay Raaz(father),Vijay Maurya(Uncle),Vijay Varma(Friend) and they are spot on.\nAmruta Subash(mother) expresses her life's melancholy brilliantly.Kalki as sky gets limited screen time but packs a punch and last but not the least\nthe game changer Siddhant Chaturvedi(MC Sher). He overpowers Ranveer in many scenes.I won't stop if I start mentioning how apt and brilliant is the screenplay here..\nCinematography by Jay Oza and crisp editing by Nitin Baid are felt on the screen as the movie even being slow in pace doesn't be a boring affair in 2 hrs 35 mins.\nZoya has struck a win win here.Finally, what made it more lively was screen time for real life rappers like Emiway Bantaai,Stony Psycho and Dope Daddy from Dopedealicz , Kaambhaari and also a second of Brodha V.Just felt like saying this that how well the hip hop culture has been able to connect with our generation. Emiway Bantaai's one second presence in first half and the crowd erupted like never seen before. Also , his acts in second half are treat to watch. Not to forget Kaam Bhaari is there too.All in all 9/10 from my side.\nGo for it folks.\nWatch it for a beautiful journey of the guy from streets."
    },
    {
        "author": "amitkowe",
        "review_date": "14 February 2019",
        "title": " It's not about a one person,it's about many,who struggles in their own.",
        "rating": "10",
        "review": "It's not about only a rap,it's about every person who struggles their own inside.its the story about every struggling person who trapped under the bloody society.who want to fly,who want to go outside,who want do something.its not a rap movie,it's truly a inspirational movie."
    },
    {
        "author": "salamkhel",
        "review_date": "16 February 2019",
        "title": " Ranveer ka time aa gaya",
        "rating": "10",
        "review": "This is such a beautifully made film. It's very rare that one walks out of a film thinking of the world in a different way. When the film starts to the end, the director(Zoya Akhtar), makes sure the audience is hooked. Dialogue writer Vijay Maurya, also played by Murad(Ranveer's uncle) wrote some amazing dialogues and a script that not only neatly ties on the gully boy himself, but his love interest, relationships with his family, friends, and his inner demons.\nRanveer has slowly become Indian's Daniel Day Lewis. There is no trace of him in Murad. He is sensitive, daring, intense, and quiet. He breaths fire as he sits in his car, and raps his heart and arms out. He is brooding as he sits and writes after he sees his father's second wife come in his home. He doesn't miss a beat. Alia is growing from strength to strength. After, Udta, Dear Zindagi, Raazi, and now Gully Boy, is the latest in her kitty of great performances. A special mention to Siddarth and Vijay Varma for giving us such lovely characters to root for. Also Vijay Raaz as the abusive father. I hated him and that's a testament to how great Raaz is as an artist.\nThis movie is a must see. Go in and you'll be happy to spend Valentine's Day with Zoya and her team whom have gifted us this extradinary film. Hard Hai Boss!"
    },
    {
        "author": "Ankit_69",
        "review_date": "14 February 2019",
        "title": " A film for mumbaikers: hard hai bantai",
        "rating": "9",
        "review": "Its an entertaining movie to watch for and is worth watching too..\nMostly the mumbaikers can relate to the movie as the whole movie is based in Dharavi.\nEveryone is good with their character and it was great to see Vijay Raaz as always. He is indeed a very good actor.\nTo the one who don't understands the rap culture, the movie will be quite overrated but trust me its not.\nTo the one saying the movie is a copy of 8 miles must watch the movie, this is how the story of rapper can be exactly displayed.\nAnd Ranveer was outstanding with his part and \"Apna Time Aayega\" is just outstanding work by Ranveer, If you feel the character then its also an inspiring story..\nAccording to me its definitely worth watching :)\nAnd the one calling Ranveer Singh's character as overacting are the one who don't understand Mumbai's local language"
    },
    {
        "author": "aboutfootball",
        "review_date": "14 February 2019",
        "title": " One of the best movie.",
        "rating": "10",
        "review": "Must watch direction, screenplay ,acting everything is good in this movie"
    },
    {
        "author": "mr-shekhar88",
        "review_date": "14 February 2019",
        "title": " it's not a copy of 8 mile you morons",
        "rating": "8",
        "review": "Almost every rap star came from hardships and poverty and that is what rap is, poetry of your life with awesome beats so what the hell were these morons expecting, a guy with no issues becoming a rap star - what was copied from 8 mile? i dare you to justify yourselves you stupid morons. Every part of the movie was awesome."
    },
    {
        "author": "dwijkulkarni",
        "review_date": "14 February 2019",
        "title": " The Perfect Underdog Story",
        "rating": "9",
        "review": "A story which justifies the hype it created before even releasing. There's alot to the other than just big names. The contribution of Zoya Akhtar's whole team is brilliant and is visible throughout. The film has a gripping narrative. It has a lot of parallel stories which are quite clear due to Zoya's brilliant directing. Ranveer Singh and Alia Bhatt have delivered great performances which were expected. Siddhant Chaturvedi is also a delight to watch. The authenticity of the film if commendable."
    },
    {
        "author": "sohailparvaiz",
        "review_date": "15 February 2019",
        "title": " Zoya akhtar best movie till date",
        "rating": "10",
        "review": "This is a perfect collage of stories told in the best possible way by zoya akhtar, it is also ranveer singh best acting ever. every frame is a treat."
    },
    {
        "author": "Tejas_Vinda_AITS",
        "review_date": "13 February 2019",
        "title": " Entertainment ekdum hard hai bhai..!!",
        "rating": "7",
        "review": "Zoya Akhtar has done it again. After helming some brilliant films like Luck By Chance, Zindagi Na Milegi Dobara and the underwhelming Dil Dhadakne Do, Zoya changes gear with Gully Boy. It's the story of Murad (Ranveer Singh), his aspiration, ambition, his family, his love Safeena (Alia Bhatt), his friendships and the path he takes to fulfil his dream. At the forefront, Gully Boy may seem like a movie about the underground rappers but actually, it is much more than that.The movie is mainly about human relations, connections, emotions and dynamics. There is no filmmaker better than Zoya Akhtar who can portray and handle human complexities in such a brilliant way. Gully Boy will surely be counted amongst her best work.Ranveer and Alia's chemistry is too cute to be true. They are like a house on fire.If the writing of the movie and Zoya's direction is of the highest order, Ranveer Singh, Alia Bhatt, debutant Sidhant Chaturvedi and other actors compliment it with fabulous performances.Alia Bhatt, is the scene stealer. Every scene she appears in is a riot. She is endearing, to say the least. This is one of her best performances and her character is a crash course in women empowerment. I am sure everyone's gonna fall in love with her.On the downside though, the pacing takes a dip in the second half. And also the story in whole is quite predictable. The editing should've been tighter.Gully Boy is one of the best movies to come out of Indian cinema in recent times. Watch it for Ranveer Singh, Alia Bhatt's dazzling performances. And moreover, watch it for the master filmmaker Zoya Akhtar. Hats off to her. This one's a winner."
    },
    {
        "author": "kalainonstopnetting",
        "review_date": "15 February 2019",
        "title": " A FLAWLESS MUST WATCH MOVIE",
        "rating": "10",
        "review": "Saw the movie yesterday.. what an amazing and flawless film. I don't think I've truly experienced a film this close to heart. Every charcter, every frame is etched and performed to perfection. Murad, Safeena, Sher, Moeen - they all win your hearts. Brilliant supporting cast Amruta Subhash Vijay Raaz and others. Go watch it and give the movie Box office validation as such world-class film are made in rarity in the mainstream cinema. Gully Boy is an experience with music and Murad at it's core."
    },
    {
        "author": "pradeepvashisth",
        "review_date": "15 February 2019",
        "title": " Mind blowing entertainment",
        "rating": "9",
        "review": "The movie is really beautifully directed, the best part of the movie it shows the sad reality of our day to day life but regardless the movie is full of \"Junoon\" haha I forgot this word almost, love the music, love the direction, actually loved everything in the movie, every character is nicely played. Ranveer and Alia acting is deadly, vo kya bolte hai \"hard hai bhai\" :)\nI understand this movie could be copy of 8 mile but hey trust me this is very different and can't be compared. In indian cinema it's hard to find a movie with natural acting and nice music and Gully boy is the one. Highly recommended movie!!"
    },
    {
        "author": "cksharma418",
        "review_date": "14 February 2019",
        "title": " Must watch",
        "rating": "10",
        "review": "Don't read any reviews just go and watch the film....And judge it yourself.."
    },
    {
        "author": "naik-06471",
        "review_date": "14 February 2019",
        "title": " All time blockbuster",
        "rating": "10",
        "review": "Ek number bhot hard bhot hard hattrick of blockbuster movies\n1.padmavat-585.86 cr\n2.Simmba -400 cr and on\n3.Gully boy -???"
    },
    {
        "author": "sumitlakhani",
        "review_date": "14 February 2019",
        "title": " One word: blockbuster",
        "rating": "10",
        "review": "Acting direction screenplay especially music everything is just 👌👌"
    },
    {
        "author": "Avanti16",
        "review_date": "23 February 2019",
        "title": " Good, but a bit overhyped",
        "rating": "7",
        "review": "Was happy to see a new style (rapper-based) movie being produced by Bollywood. I am not a fan of such music, but can always appreciate a movie. And, honestly, that was the good part of the movie. Then there are side stories which were more like the 60's style and dragged the movie down - making it boring at times. Alia and Siddhant were the best. Ranveer decent. The finale was a bit let down. Just too much of celebration which didn't emotionally connect with me. I was happy that it was finally over. Compare this movie to Dangal, Secret Superstar, Chak De India, etc. and you will see that it lacks life."
    },
    {
        "author": "vishal-kamble96",
        "review_date": "14 February 2019",
        "title": " A must watch for everyone who dream",
        "rating": "10",
        "review": "Everyone have one movie in life which make them do something, change them, and help them discover themselves and for me GULLY BOY is that kind of movie. This is Ranveer Singh's best performance and best movie till date. The best part of this movie was there was no unwanted gimmicks done to show the character that 'only one' and who had gotten everything ready in his plate like one other recently released movie that came ;~)\nAlia Bhatt like always was fabulous although there was not so much for her to do in this movie. All other cast were also great. And special mention for the writers of this movie who brought such a terrific plot in accordance with the character."
    },
    {
        "author": "Jithindurden",
        "review_date": "14 February 2019",
        "title": " Apna tine aayega",
        "rating": "7",
        "review": "The similaritieswith 8 Mile is just in the basic premise and whatever was shown in the trailer. This film does stands on its own.\nSimple story filled with complex characters (well all the characters from the Gully anyway) beautifully directed. Ranveer Singh is fantastic as expected. The only issue for me was that the climax could have been a bit more intense for such a story."
    },
    {
        "author": "rajatmahajan-17024",
        "review_date": "14 February 2019",
        "title": " It's a decent watch",
        "rating": "6",
        "review": "Dude I watched it , its overhyped believe me , it's a good movie , that's set , not the movie that u have to watch before you die , movie felt flat in between , &amp; seemed boring at times , boy honestly speaking alia , &amp; that second dude sidhant , over shadowed ranveer Singh , he has again overacted at times , so it's a good movie , but the way these critics &amp; specially people in screening are portraying it it's not like that , so go watch it but just lower your expectations , its a damn honest review"
    },
    {
        "author": "rohitladha",
        "review_date": "15 February 2019",
        "title": " Great act put together",
        "rating": "9",
        "review": "Somewhere in between I felt as if it is copy of 8 miles and slumdog millionaire. However, the similarity is just in premise."
    },
    {
        "author": "soumya-46426",
        "review_date": "15 February 2019",
        "title": " 👍👍👍👍",
        "rating": "9",
        "review": "Terrific movie! Lead actor Ranveer Singh 's performance is top notch and accolades worthy. Superbly directed movie"
    },
    {
        "author": "dmostwantedbaccha",
        "review_date": "14 February 2019",
        "title": " Fabulous",
        "rating": "10",
        "review": "Left me speechless!!\nAmazed by the actors\nEverything is just perfect you should watch this for sure"
    },
    {
        "author": "samaiyra",
        "review_date": "13 February 2019",
        "title": " Awesome movie😘😘😘",
        "rating": "10",
        "review": "The thing I liked about this movie is Everything 😄😄it is so perfect, enthusiastic, heartwarming movie with no plot holes..the song the story the acting the supporting characters are very perfect...just go and watch it!!!"
    },
    {
        "author": "lamemoviesguy",
        "review_date": "14 February 2019",
        "title": " Watchable but very predictable",
        "rating": "6",
        "review": "The film is watchable for Zoya's direction and Siddhant's performance. There is nothing new in the film - it is the age-old underdog story, and I have seen much better depictions of the underdog story in world cinema. Some sections/ communities of the society may be able to connect with the film and its characters, but I could not. Also, if you are from Mumbai, you may like the film. In terms of performances, Ranveer is better here than in some of his last films. Alia has acted like she always does - just being the normal herself. The real performance for which to check out this film is Siddhant's. This is an actor to watch out for.\nDisclaimer: There is too much rap in the film. I have tried to be as impartial in my review as possible - if you are not a fan of this so-called \"music\" like myself, you may not like it."
    }
]