[
    {
        "author": "theHulk655",
        "review_date": "18 October 2018",
        "title": " Save yourself",
        "rating": "1",
        "review": "Movie isn't worth watching. Save your time and money. Movie is boring slow and gives a free headache."
    },
    {
        "author": "msdianforever",
        "review_date": "18 October 2018",
        "title": " A Must Watch! Please read the full review.",
        "rating": "1",
        "review": "2018 has been a year of ups and down for Bollywood. While we've got masterpieces like Padman, Padmaavat, Andhadhun, Sanju, Tumbadd, Raazi etc. We've also got some films that are utter crap! And if you thought Race 3 was the worst of the year, you are wrong. Namaste London has beaten it!\nThe plot is senseless, in fact it makes me wonder why did they even think of making this movie. I don't have any words for the performances because nobody acted. Arjun Kapoor was horrible, I mean he's starring in a comedy film when he can't change a single expression! How did Vipul Shah even imagine him as a replacement for Akshay Kumar? Parineeti is annoying and her dialogues are one of the worst you'll ever hear.\nThere are some movies that are bad so you skip them but Namaste England comes in the category of films that you have to watch just to know how cringy Bollywood can get"
    },
    {
        "author": "roger6615",
        "review_date": "19 October 2018",
        "title": " Fantastically wonderful movie",
        "rating": "1",
        "review": "Wow what an amazing movie. Perfect story. Great acting. awesome dialogues. an Oscar performance. Totally believable plot. A must see for someone planning a quick exit from LIFE! Hats off to the writer, director, producers and c all involved in this film for successfully achieving the worst movie ever !"
    },
    {
        "author": "kinshuk-gaur",
        "review_date": "18 October 2018",
        "title": " The best Horror movie ever.",
        "rating": "1",
        "review": "I was itching to write something about this movie with 15 min into it. Trying hard to restrain myself, but after a pain striking hour watching this junk I was left wondering. Why? on earth I am watching the king of nepotism Arjun Kapoor and the puerile Parineeta performing their histrionics on screen.I was away from this movie to regain some sense and breath. I don't know what happened in that hour because it was scary. I got an impression of watching some get together scenes of a couple of people.I am sure of never being so magnificent in my writing ever. Please save yourself, this gives a sense of Armageddon.The best Horror movie ever."
    },
    {
        "author": "elixir024",
        "review_date": "18 October 2018",
        "title": " \"Only comparable to RACE 3\" in terms of worst film of the year",
        "rating": "1",
        "review": "The whole time I was thinking, how can the same director makes such a bad movie.\nMan..I'm a bit optimistic that this movie will do well not because of the cast but the director is well known and gave few good movies(Holiday, Nameste London) in the past. But this movie, it's a total let you down. I seriously recommend to watch any good rom-com on Netflix or watch ANDHADHUN or TUMBBAD.\nBakwaas... \"Utterly non-sense\" movie of the year ONLY comparable to RACE 3.People who agree with me please vote Y or N. Thanks"
    },
    {
        "author": "anchalverma-23512",
        "review_date": "18 October 2018",
        "title": " Boring movie",
        "rating": "1",
        "review": "Bad acting..weak story line.. And copied music... Plz don't waste your time and money on it..."
    },
    {
        "author": "amith-36145",
        "review_date": "18 October 2018",
        "title": " No option to give 0 stars",
        "rating": "1",
        "review": "Bhagwan Bollywood Ko bachaye. Namaste Bollywood could be a better title."
    },
    {
        "author": "SarvagyaBhargava",
        "review_date": "18 October 2018",
        "title": " Wait what?",
        "rating": "1",
        "review": "This will be your reaction to everything. Literally everything in this movie is for people who like leave their minds at home and come to eat pop corn and drink pepsi at the cinema halls. \"Bhai matlab, director ne FIITJEE ki coaching li thi kya?\""
    },
    {
        "author": "dpshrs",
        "review_date": "18 October 2018",
        "title": " Beyond Pathetic!!!",
        "rating": "1",
        "review": "Wow i mean what a movie Woaah!!!..\nIts a masterpiece Chutiyap film of 2018..\nand yes it beats Race 3 in both cringe level and Stupidity.."
    },
    {
        "author": "sararasaku",
        "review_date": "21 October 2018",
        "title": " Don't watch",
        "rating": "1",
        "review": "Don't watch don't watch don't watch don't watch Don't watch don't watch don't watch don't watch Don't watch don't watch don't watch don't watch Don't watch don't watch don't watch don't watch Don't watch don't watch don't watch don't watch Don't watch don't watch don't watch don't watch Don't watch don't watch don't watch don't watch Don't watch don't watch don't watch don't watch Don't watch don't watch don't watch don't watch"
    },
    {
        "author": "nikhilmanali",
        "review_date": "18 October 2018",
        "title": " Worst of worst",
        "rating": "1",
        "review": "Useless songs and both lead actor have no clue about acting."
    },
    {
        "author": "n_dhruv",
        "review_date": "18 October 2018",
        "title": " Probably worst movie of this year",
        "rating": "1",
        "review": "Do we really need this kind of crap when Bollywood is making such a remarkable movies these days!? There is nothing good in the movie from beginning to end including direction, acting, screenplay.What's Good : Nothing.What's Bad : Everything.Last Word : This is a kind of movie which you can skip on television too."
    },
    {
        "author": "mishrajikiboli",
        "review_date": "18 October 2018",
        "title": " Worst movie of the Year 2018",
        "rating": "1",
        "review": "Don't waste your time watching such crap movies....Bollywood thinks that indians are fool and all idiots will spend their money on those nepotism actors and actress like arjun and parineeti....Its better to watch Badhai ho..."
    },
    {
        "author": "dsujitk",
        "review_date": "30 October 2018",
        "title": " If you want a revenge or want your girlfriend to leave you. Please go to see this movie",
        "rating": "1",
        "review": "If you want a revenge or want your girlfriend to leave you. Please go to see this movie. Parineeti chopra is losing on good movie, acting and hindi movie industry."
    },
    {
        "author": "anitij",
        "review_date": "22 October 2018",
        "title": " Pls help Bollywood and retire you 2",
        "rating": "1",
        "review": "Movie is a shamble, nepotism at its best - non sense movie with no story, zero acting skills.And for god sake, stop putting unnecessary songs specially stupid raps"
    },
    {
        "author": "aprabhakar-76847",
        "review_date": "18 October 2018",
        "title": " super flop film",
        "rating": "1",
        "review": "Arjun kapoor means flop film . same as before . pari is xerox copy of arjun . both waste their time in acting a film ."
    },
    {
        "author": "karanjokj",
        "review_date": "19 October 2018",
        "title": " WORST MOVIE",
        "rating": "1",
        "review": "Do yourself a favor and don't watch this movie! Rather watch Namastey London again on TV. Disaster."
    },
    {
        "author": "munnavar016",
        "review_date": "19 October 2018",
        "title": " Adrenalin released...!",
        "rating": "1",
        "review": "Worst movie ever in hindi film industry creating an distratrous environment.in the threatre between the audience actors over action made me to write this.....anger harmons released a couple of times"
    },
    {
        "author": "sachinsalve-30049",
        "review_date": "19 October 2018",
        "title": " A must miss film",
        "rating": "2",
        "review": "This is a must miss film. Arjun Kapoor should work on his acting. We have many talented people in India but they merely get chance, and instead non talented people are served in our dish who torture us with their so called acting. Bollywood is developing &amp; making masterpieces like Padman, Tumbbad, Andhadhun, and at this level you cannot come with a worthless acting &amp; story. Work a little hard on acting and story, and we Indians will definitely support you. Please watch Namstey London instead of watching this movie."
    },
    {
        "author": "kummulnkprk",
        "review_date": "21 October 2018",
        "title": " Damn!!",
        "rating": "1",
        "review": "Don't waste your money on this pathetic. .............Instead go and watch badhai ho badhai."
    },
    {
        "author": "SouravChakraborty_P1",
        "review_date": "19 October 2018",
        "title": " Arjun Kapoor is giving tough competition to Jhanvi",
        "rating": "1",
        "review": "Horrible movie, what is wrong with Vipul, he used to make some quality movies like Aankhein, Namastey London.\nhe degraded so much, who gave him idea to make this crap, thank God Akshay didn't starred in this movie.\nArjun Kapoor is pathetic, no expression, zero acting, how can someone cast him, even people from dubsmash acts betetr than him, he is really giving tough competition to Jhanvi, I thought dhadak was the worst movie of this year, and she couldn't act at all, now Arjun is going to give tough competition to her.\nNamastey London was a classic movie, a great story with emotions, comedy, a complete package\nNamastey England might be on IMDB's bottom list soon.\nAvoid"
    },
    {
        "author": "pranaya-38384",
        "review_date": "18 October 2018",
        "title": " Bkwas",
        "rating": "1",
        "review": "Bkwas bkwas bkwas bkwas waste of time and money to help them if you have lots of money and time to collect film making money"
    },
    {
        "author": "punumehta",
        "review_date": "22 October 2018",
        "title": " Very bad movie",
        "rating": "1",
        "review": "No chemistry, no story, no good songs, senseless dialogues, not recommended"
    },
    {
        "author": "tejaswipanda",
        "review_date": "21 October 2018",
        "title": " Wow... An absolute tragedy",
        "rating": "1",
        "review": "Avoid it and just save your money... You can't even tolerate it till the interval."
    },
    {
        "author": "ishank-77263",
        "review_date": "20 October 2018",
        "title": " This movie has made history in terms of the worst movies ever made!",
        "rating": "1",
        "review": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮"
    }
]