[
    {
        "author": "saurabhjustu",
        "review_date": "26 May 2016",
        "title": "This is more than just a mere football movie",
        "review": "PELE is probably the biggest name in the soccer history that has shaped & shifted the current playing style of modern day game. The extravagant career speaks for itself. The movie shows us the making & coming to be of PELE.  I see a lot pf people saying this movie is predictable, not so good & what not. to all of them & most importantly to all of u i say, this movie is more than just a football movie. Not every movie is supposed to be a thriller or an Avenger movie. simple things in life have a way of getting to us.  This movie is about small & humble beginnings, its about friendship , its about believing in one self, taking the risk. Movie shows us that is does not matter if u have all the resources or opportunities in the world. if u keep at it, if u find something that you are passionate about & stick to it, day by day, night after night, the results speak for itself.  Movie has amazing moments, really great camera work. one of the best for all the soccer movies out there. Even if one know nothing about the legend that PELE is, once you are into the movie, you cant resist to feel the journey he is going to make in life. I was finding myself constantly tears of joy rolling down my cheek coz i was hooked into the movie. had soo many of those watering your eyes moments that once the movie was over, i was filled with joy and happiness to have witness such a good work of art.  Acting & direction is simple & stunning. camera-work is amazing , specially in those moments you want to fell the greatness of the legend, the movie gives you that.  I'll keep going back to watching this movie , just to feel that joy of watching something beautiful in the making again & again."
    },
    {
        "author": "erick-palacios04",
        "review_date": "30 March 2017",
        "title": "Ginga or Joga Bonito, both mean: Pelé",
        "review": "I grew up watching Football, i loved it and i still do, and of course i love my nation (Venezuela), but you just can't denied that you like Brasil for their style of playing, their amazing Joga Bonito, it's just masterful and beautiful that makes you think, can i do that?, there are 2 correct answers: you work all day, every day for a very long time to accomplish it, or just wait until another life and born with it like Pelé.  This is the guy that every Football player looks up to at least one time in their life, and of course for us Fottball lovers to know there is a movie about this legend it's like saying, there is a movie about Michael Jackson and you think: They better don't mess it up, because he is the best in the business and he deserves it. Trust me they have done it right in this film, the kid playing Pelé is really good with his ginga (freestyle of playing) and does honor to the man himself, he really capture the essence of what he means to every fan, player and Brazilian in the world. Makes me think, can he have Pelé's blood, yes he does, but not by family, but by nationality, they just have it in them.  The movie it's solid in the cinematography, it really shows the feeling of the country and their culture and the sport itself, the casting made me think some times about overacting, but i just forget about it and kept watching a great film. What i really loved is that Ginga is explained and gives real knowledge of what it means, it's now that they call it Joga Bonito, but they are the same: One amazing player. Donpt believe me? just take a good look yourself this movie and experience what Soccer (that's how Americans call it) it's really about, and you will have the most amazing teacher, Edson Arantes do Nascimento, or as is best known: Pelé."
    },
    {
        "author": "subxerogravity",
        "review_date": "24 May 2016",
        "title": "Turning a legend into a saint",
        "review": "Pele is one of the most spiritual sports movies I've ever seen and is more heart than anything else.  It's more about the pride of Brazil and Edson Arantes do Nascimento being a beautiful symbol of it.  Pele is a poor kid form a poor part of Brazil who was good enough to use football to start building a better life by being a part of the 1958 Olympic team. More to the story, is that from the place he is from , his father taught him the ginga, for the purpose of the movie, the ginga is a celebration of Brazil's African heritage focus through football, a system that most of Brazil feels lost them the last two Olympic games, but Pele realized they were not doing it right and shows them the path that leads to the gold and Brazilian pride.  The acting itself did not bring on this spirit, but I did like the acting. From the trailer, I was not sure if Vincent D'Onofrio could pull off the role as the team's coach, but indeed he does a find job. It's one of the few sports movies in which the coach's inspiration is a very small part of the movie, but D'Onofrio does well with the little he's got.  The spirit comes more in the film making itself , as they use small special effects like slow motion to make Pele look divine every time he gets the ball, inter cut with scenes of people watching in total ah of what he can do. At first it seems cheesy when they first start doing it, but after a while it gets into a rhythm that gets you into it, and you can't help but to let it touch your soul.  I don't think it's better or worse than any other sports movie. What makes it unique is that they're are very few of these about Soccer (and so many about American Football), but it does the trick of inspiring you and having you cheer for the underdog, though I feel I did not really learn much about Pele in the process."
    },
    {
        "author": "elyobj",
        "review_date": "28 April 2016",
        "title": "If only every film could have the star in the audience!",
        "review": "I was invited to the world premier of this film at the TriBeCa Film Festival, in New York. I say invited, as if my life is some sort of glamorous affair. In reality, a mate at work couldn't make it, and he knew I'd have no actual plans, so I eagerly obliged.  Just before the movie started, the 350 or so people in the audience got what they wanted, as the man himself stood up and raised his hand to the instagram happy crowd. Just knowing Pele was in the audience gave the room a little extra energy.  Perhaps a little naive, I knew a little about Pele's playing career but little of the man and, the journey to what he became. The film follows his early years with friends at home, up until he becomes 17 and plays for Brazil in the 1958 World Cup in Sweden. There's enough humour, big laughs, drama, and passion in the film that will translate to fans familiar with the legend and those who may have only heard of him.  The real treat, were the applause, and cheering from the audience when the on-screen Pele scored. His hand went up in recognition and the cheers got louder. I was pleased that despite the film keeping my attention he may have nodded off, he's knocking on a bit.  I waited outside afterward and managed to get a signed Santos shirt from him, which kinda gave me goose pimples, and rammed home the magnitude of who this man was, and what he had done for the game. My dad would have been proud. Sadly the shirt is the guys from work, so I'm currently deciding whether to buy a replica shirt and say I didn't get it, or beginning to practice the man's signature! That's okay, isn't it...  I did snap a selfie. Insta - Jamesbydesign"
    },
    {
        "author": "ferguson-6",
        "review_date": "7 May 2016",
        "title": "It's a kick",
        "review": "Greetings again from the darkness. From rags to riches  a common expression that often leads to a paint-by-numbers movie. Co-directors Jeff Zimbalist and Michael Zimbalist are fortunate in that their \"coming of age\" subject is the globally famous Pele' – often considered the greatest soccer/futbol player of all-time.  Rather than revisit the career of the transcendent player who later dedicated his life to humanitarian causes, the film kicks off with a 17 year old Pele trotting out onto the pitch at the 1958 World Cup. It then flashes back 8 years to when 9 year old \"Dico\" was growing up in the slums of Sao Paulo. We get to see his relationship with his family  his dad taught him to play, and his friends were loyal to him and encouraged him to pursue his dream.  There are some similarities to \"The Sandlot\" as we watch the joy these boys have in playing the sport whenever and wherever they can  plus the origin of the somewhat derogatory and now immortal nickname. It seemed that Pele' was able to carry this love of the game throughout his career. We see boys huddled around a radio listening to the 1950 World Cup as Brazil's team was humiliated  an event that played a role in Pele' returning pride to a bruised country.  Kevin de Paula plays Pele' as he works his way up through the age groups and national teams. Often the youngest and shortest player, the film depicts him as a shy kid often out of his element  the polar opposite to the beaming superstar we so often saw later in his career. There is an explanation of the roots of the \"Ginga\" style and its ties to the Brazilian culture and martial arts.  For some reason, Vincent D'Onofrio is cast as Brazil's Coach Feola and we are forced to endure a tortuous accent that is basically inexcusable these days. There are also some exaggerations in the crowd scenes and shots of the press, though young de Paula underplays the lead. Colm Meaney plays George Raynor, the coach of Sweden in that infamous 1958 World Cup, and we do get a cute little cameo from Pele' himself.  The film does a nice job with the young man's childhood and progression towards superstar (the IOC named him the athlete of the century). He is presented as close to his family, and inherently quiet and calm. The match clips of Pele' that play over the closing credits are proof that a movie just can't capture the transcendence of his talent. Pele' is truly the reason it's \"the beautiful game\"."
    },
    {
        "author": "agreatstory",
        "review_date": "8 August 2016",
        "title": "The Pluses Outweigh The Minuses",
        "review": "Like the excellent Kevin Costner film: \"McFarland USA\" this movie sensitively shows how sport can significantly alter a people's identity (in this case the entire nation of Brazil was uplifted from a sense of inferiority within the world community, to a pride in their own uniqueness). The acting is good. The sports action scenes are remarkable (how did they get an actor with such great soccer skills?) and the music is by the great A.R. Raman. A lot of care was put into the making of this film, but a lot was lost, I feel, by having the actors speak mostly in English. And it wasn't dubbed English, it was the Brazilian actors trotting out their heavily accented English. That had the effect of taking away much of the authenticity the film had worked so hard to achieve. (That the real-life Pelé has a cameo appearance - and thus takes the viewer out of the scene's intended verisimilitude - is, perhaps, excusable - I can cut it that slack). One more grumble: the movie trailers announced: \"With Rodrigo Santoro\". I will see anything with him in it - he is a terrific actor. But he appears for LITERALLY FIVE SECONDS! Really! That is unacceptable marketing...'bait and switch', actually. But see the movie anyway. (BTW, I met Pelé in 1984. We talked for about ten minutes, and at one point, after we had been briefly interrupted, he put his arm around me and said: \"So, my Brazilian-American friend, where were we?\" He had a golden air about him, and yet was completely down-to-earth even though we talked about cosmic reality. To listen to my five minute audio recording about meeting Pelé, search for \"Pelé And His Brazilian- American Friend\"."
    },
    {
        "author": "sebastian-suss",
        "review_date": "13 April 2017",
        "title": "Did I watch a Disney story?",
        "review": "I really started watching this movie to know something about the story of this football legend... But... Is this the real story? Honestly, a lot of fantasy. If this story is true I can say Disney stories exist in the real world. So, its not a biography movie, its a very good inspirational/fantasy movie maybe with some seasoning of a real life story. And why, why in the name of god they made a Brazilian movie in English? WHY??? 2 less points for that... Movie message: We are proud to be what we are, Brazilians. You must be proud of what you are no matter what... But we made the movie IN English??? No dude... Why???  So... 10 - 2 (not in Portuguese) -2 (lot of fantasy) = 6 points. A movie to see and enjoy and say at the end \"Did this story really happened like this\"?"
    },
    {
        "author": "coolaniket-w",
        "review_date": "8 June 2016",
        "title": "Truly inspirational !!",
        "review": "The direction cinematography and music is just amazing. It is emotional and motivational.Didn't know about Pele so much before .Too good I am going to watch this movie whenever i fell down ..Thanks a lot.the movie was so emotional at times made me cry.The whole movie moves in a flow and you feel how much pain he has to take to get there.The movie also shows the situation of Brazil during 1950's.Music by A.R.Rahman was magical it blended so well with the theme.My respect for Pele has grown too much.The world cup scenes are accurate comparing with the score board of 1958 world cup.Hope to see more such movies .The movie is little bit similar to \"Bhaag Milkha Bhaag\" if anybody of you have seen it.I recommend you to watch the trailer first and then the movie \"Pele\""
    },
    {
        "author": "ColinZealSE1",
        "review_date": "16 August 2016",
        "title": "I can't believe this has been reviewed so highly...",
        "review": "...because I don't remember when I saw a movie that was so highly clichéd... Wow.  It looks really good but the story has every cliché that you've ever seen. It's remarkable really.  All the tropes, clichés and tragedies are there. From rags to riches. Skipping the football shoes in a pivotal moment to play bare feet. Getting ridiculed for that. Somber music in notable beats. Beating the over class. Getting ridiculed for that before that. Friends that lose their lives. Promises. Full Metal Jacket style training. Losing faith, only to regain it..  Christ almighty. Why do people like this movie?  I need to read the other reviews."
    },
    {
        "author": "granlo_walle",
        "review_date": "16 September 2018",
        "title": "A compelling narrative, but factually inaccurate and unfair",
        "review": "I want to state first that I do really like Pélé, he is one of the best athletes in history, not only in his athletic performance but also in his conduct outside the pitch.  His compelling personality is well displayed and I cannot speak with certainty about his background, but I suspect that while it was challenging it was perhaps not quite as bad as it is displayed at times.  My main problem with the movie is the display of the national teams aside from the brazilians. It was at this time and unlike the depiction of the movie well known that Brazil was a good team, perhaps not the favorites to win, but by no means a complete underdog. The favorites to win were West Germany, France and the Soviet Union. Sweden who is antagonisticly depicted was a nation with many players at the very end of their career and though the population was excited at their nations participation and that for the first time (for the swedes) professional players playing in clubs abroad would be permitted to play for the national team. So people were hopeful that with homefield advantage and the addition of a handful of worldclass professionals though perhaps past their prime(Niels Liedholm 36 at the time and Gunnar Gren 38) that maybe possibly Sweden could win.  So the primary factual error here is that Brazil was by no means colossal underdogs and the Swedes were not as massively favored as depicted and certainly not as arrogant and demeaning as they are shown. Though there is some truth in their strategy in the final game, the swedes did hope to try and score an early goal hoping the brazilians would be unable to recover.(According to Niels Liedholm).  I also find it unfortunate that while racism is horrible and was certainly present even amongst my own swedish ancestors. It is very unfortunate that this media never depicted some of the really inspiring moments of people in this tournament. Because in the end Pélé have stated that the swedish king at the time went down to meet the players on both sides and shook everybodys hand and chatted with them regardless of what they looked like. For many people just like the king football have no color and whilst Péle has had to deal with his fair share of racism he has seldom dwelt on the negative, but almost always uplifted the positive.  For my parents who vividly remember this tournament and who have always held Pélé in very high regard as both a footballer and a person. It was rather difficult to swallow the depiction of his opponents(our national team in particular) and that of the tournament as a whole which is perhaps one of the most memorable world cups in history with Pélé the 17-year old wunderkind and Just Fontaine who set a record of scoring goals that to this day stands."
    },
    {
        "author": "gpknopp",
        "review_date": "19 July 2016",
        "title": "Nearly Cinematic Perfection",
        "review": "Consider - how interesting can a movie be about the success of a sporting legend? Obviously the material is begging for some musical montages, and it does not disappoint. I mean, we're talking a powerful cultural legacy here - football and Brazilian culture and music This movie serves up a full platter of sentimentality and showmanship, not to mention an army of condescending Swedes. Simply put, some of these scenes are majestic in their color and rhythm, and there is a palpable feeling that the creators of this felt passionately about the subject matter. The simple themes of transcendence, struggle, and family (topos?) often fade behind the theme of simple, graceful, perfect movement. How many movies about sports movies have succeeded with such a simple, yet grand, exposition of the sport itself?  I watched it in dubbed English I wonder what was lost in translation? I may watch it again in Portuguese. To be fair I'm an American who has recently been bitten by the soccer bug, so I have a profound appreciation for the elegance of the sport. I found that some scenes motivated this feeling as well, with a sense of sublime cinematic portrayals of the beautiful game.  Surely this movie is marketing for the Rio Olympics. It doesn't matter. This is a very beautiful movie, and I hope that many Americans watch it, as this younger generation has probably not even heard of Pele, let along seen him play (or is it dance?)."
    },
    {
        "author": "tonyfor",
        "review_date": "18 July 2016",
        "title": "Horrible anachronistic rubbish",
        "review": "I watched this film (or at least as much as I could take) on a plane journey today, and was appalled how what was clearly an amazing story of (literally) rags to riches was given a total Hollywood make-over, for example, the bullying, much older rich kids making fun of the poor kids and (almost) getting their comeuppance as soon as the poor kids took off their football boots (OK, Pele did start playing barefoot, but why overdramatise it? Oh, let's not forget the inevitable fat boy and the compulsory short-sighted kid. And it was full of anachronism - I mean, Brazilian kids in the 1940's getting together for pre-game American- sports-type huddles? Pele's story was fantastic enough without the overdramatic hype."
    },
    {
        "author": "digitalbeachbum",
        "review_date": "11 June 2016",
        "title": "Good for for the entire family",
        "review": "This PG rated movie is about the greatest futbol (soccer in USA) player that ever lived. Pele. It covers his youth, in the slums, learning to play futbol in the streets using socks and other clothing stuffed together to make a futbol so they could play. Then progresses through hardships encountered on his way to playing for one of the many futbol teams.  What most Americans won't know is that in Brazil (as with all futbol countries) there are massive leagues on multiple levels of the society. They all play against each other or against other Latin American teams for various awards and cups. Pele played for a team called Santos.  From Santos he was picked, like other great players from other teams, to play on the National Team. I don't like that they don't show this process in the movie because it shows the level of competition. We are talking thousands of players rather than a few dozen which they show in the movie.  The movie doesn't show any love interests. This biopic covers only his youth and his journey to play in the 1958 World Cup. Then the movie ends and gives short mentions to the what he did afterwards. Then there is a collection of his game skills shown in a small window as the credits roll.  Overall it was pleasurable to watch and I knew that he would have a small cameo in the movie. Did you see him?  8/10 stars for good clean entertainment"
    },
    {
        "author": "dave-mcclain",
        "review_date": "23 May 2016",
        "title": "\"Pelé: Birth of a Legend\" is a flawed, but inspiring film.",
        "review": "Brazilian teams play a style of soccer all their own. (Yeah, I called it soccer. Gimmie a break. I'm an American.) They call that style \"ginga\". It's a very fluid kind of play that emphasizes creative ball control. Some call this style of play \"flamboyant\". Others dismiss it as \"trick plays\". Brazilians simply think of it as their heritage. The Urban Dictionary's definition of ginga states, in part, \"Ginga is creativity... the opposite of mechanical soccer. It is having fun with the ball. It is grace. It is being fluid and coordinated. IT IS SOUL. IT IS DANCE.\" A June 15, 2014 \"New York Times\" article explains the development of ginga this way: \"an imaginative style of play that made competition and gratifying playfulness inseparable, with blacks and people of mixed race rising from exclusion and becoming its main protagonists.\" Ginga is a unique mixing of the skills of samba dancers with Brazilian martial arts fighters, all applied to the game of soccer, turning it into, as the Brazilians call it, \"the beautiful game\", while also celebrating Brazil's different races and cultures. The focus on ginga in the biopic \"Pelé: Birth of a Legend\" (PG, 1:47) educates its audience, celebrates that style of soccer and captivates Movie Fans with the true rags-to-riches story of the greatest soccer player ever, a man known all around the world simply as Pelé.  As the film opens, the nearly 10-year-old Pelé (born Edson Arantes do Nascimento, and called \"Dico\" by his family and friends) is watching a television broadcast as his native Brazil loses the 1950 World Cup to Uruguay. Brazil's loss was a huge upset, a phrase which also describes the emotions of Brazil's soccer fans (which was basically everybody). The entire country was shocked, humiliated and demoralized. Dico (Leonardo Lima Carvalho) promises his father, a former soccer player known as Dondinho (played by Brazilian musician/actor Seu Jorge), that he, Dico, will one day bring Brazil a World Cup Championship.  Dico's family is so poor that Dico doesn't even own a soccer ball – or even a pair of shoes, but the kid manages to develop his natural talent anyway. Under his father's tutelage, he learns ball-handling by juggling and kicking grapefruits and he plays on a local team with his friends. Their team is literally called \"The Shoeless Ones\" and is mercilessly mocked by the town's rich kids, who single out Dico for a special measure of abuse and start calling him \"Pelé\". It's a made-up name which is meant to be an insult, and Dico hates the name, but as he works through his anger by helping his team play better than expected on the soccer field, the name sticks, and \"Pelé\" becomes synonymous with Dico and his amazing talent.  Continuing to hone his skills on his own time and play brilliantly on the field in spite of having to endure prejudice and personal tragedy, Pelé (played as a teenager by Kevin de Paula) is recruited and mentored by former player Waldemar De Brito (Milton Gonçalves). Pelé's talent gets him a spot on a professional soccer club, Santos FC, and then on Brazil's national team, all before he reached the age of 17. On the national team, Pelé's coach is Vicente Feola (Vincent D'Onofrio), the latest in a series of coaches who tries to beat Pelé's individuality out of him and force him to play a more traditional and \"sophisticated\" European style. Many Brazilians blamed the ginga style of play for the 1950 World Cup loss, but ginga is Pelé's strength. Pelé finds himself struggling with his coach's instruction, and an old adversary turned teammate, plus a significant knee injury, all while the national team prepares for the 1958 World Cup tournament and a possible championship matchup against the heavily-favored team representing the host country of Sweden, coached by the arrogant and condescending George Raynor (Colm Meaney).  \"Pelé: Birth of a Legend\" represents formulaic and unrefined filmmaking, but still manages to inspire on multiple levels. Co-written and co-directed by brothers Jeff and Michael Zimbalist (both working on their first feature film), the movie follows the tried-and-true pattern of most sports movies, but suffers from some minor issues of technique. The script sometimes stops short of completing its thoughts and the film is a bit over-edited, making the viewer feel like something is missing in a few of the scenes. Some characters are underdeveloped and some of the acting is shaky, but the main characters (especially D'Onofrio, Jorge and de Paula) all give strong performances. The film spends too much time on Pelé's childhood and not enough time on his rise through the ranks of Brazilian soccer, but does convey why Pelé was so good and wisely culminates with the '58 World Cup, at which point it's clear that all the pieces are finally in place for Pelé's eventual worldwide fame and unparalleled success. In spite of the film's lack of originality and other relatively minor problems, the Zimbalist brothers and their cast and crew give us plenty to shout about during the film's third act and leaves us with important lessons about determination, resilience and playing to our strengths, as well as the importance and strength of diversity. As much as I enjoyed \"Pelé: Birth of a Legend\" (especially its emotional ending), after fairly weighing all of its strengths and weaknesses, the most I can give it is a mild recommendation: \"B\""
    },
    {
        "author": "ThisIsJammy",
        "review_date": "2 July 2016",
        "title": "Pelé: Birth of a Legend has the heart to inspire, nothing more is needed to make you watch the film.",
        "review": "Pelé: Birth of a Legend follows the life of Pelé's meteoric rise from the slums of Sao Paulo to leading Brazil to its first World Cup victory at the age of 17.  Needless to say this film is same like any other biographical drama that focus on the star's raise from bottom to top made with the intention only to inspire you. The director tries nothing hard to focus anything but a biographical drama.  The story inspires you every bit like any other inspirational film would, From the childhood to winning the 1958 world cup the wish to succeed the struggles, the leap of faith, the support and love from your parents, the difference we have from the others which should be accepted to make it best, the final winning smile. These clinched moments keep you entertained throughout the film and 1 hour 47 minutes is worth spending.  Unlike the usual sports films the film focuses on something that is different from others 'The Heritage', The need to keep us in the space we are comfortable to and the adaptation from others which aren't comfortable of is itself a good small message that can be conveyed.  Background score by A.R Rahman feels a little bit underplayed, scoring music for an Hollywood film ARR has set a benchmark with Slumdog millionaire but the expectation is too high for him to satisfy our greed. One of my favorite themes from the film 'Oh Ginga' comes only at the end of the film and with the way it escalates the theme could have been used in the other parts too.  Concluding it, Not calling is better or worse than any other sport film, Pelé: Birth of a Legend is an yet an another clinched sport film that is made to inspire us and does as promised."
    },
    {
        "author": "My-Two-Cent",
        "review_date": "6 August 2016",
        "title": "If you like slow motion shots you'll LOVE this \"film\"",
        "review": "This is one of the worst films I've EVER seen & that's a shame because I grew up & fan of Pele' & looked at him as almost a mythical character with his ability to make opposing teams look as if they are playing the game for the first time so when I saw it was a film about the life of Pele' I couldn't wait to watch but then I pressed play & all that excitement went out the window..! First off, it's the life of Pele' so of course that start with Pele' as a child & instead of showing us his childhood they tried to make it funny in which that & a lot of the scenes just didn't work.. Especially the part where they have a play by play announcer on a PA at a game that Pele' & his teammates are so poor that they aren't just barefoot but shirtless as well then the \"my Mother & father both have horrible low paying jobs & since I don't want to end up like them Id better make this football/soccer thing work\" shtick was agonizingly painful to watch as was the rest of this film but as with all films that I start I show the respect to watch until the end no matter how badly I want to gouge the eyes outta my head with a rusty screwdriver & sadly I've lost an hour & forty three minutes of my life that I would have rather used staring at the sun as I poured rubbing alcohol into paper cuts..! But that's just My-Two-Cent"
    },
    {
        "author": "Prismark10",
        "review_date": "14 January 2018",
        "title": "The Ginga Game",
        "review": "Pele was a great footballer, he won three World Cup with a Brazil that played an exciting and extravagant form of football known as Ginga.  This films charts what to me is a fictionalised account of his boyhood days playing football in the poor area of São Paulo that seems to be cliched to the extreme. Being made fun off by the white kids for playing football with his bare feet. Then later on being criticised for his flamboyant style of football.  The film comes to life as see the rise of Pele in the 1958 World Cup in Sweden where he played at the age of 17 and still remains the youngest player to score at a World Cup final.  It is a rather superficial film, it only concentrates on Pele up to his first World Cup win. The young actor playing Pele shows great football skill. Some of the recreations are well done and the great man himself makes a little cameo experience."
    },
    {
        "author": "dangeloalex",
        "review_date": "10 October 2018",
        "title": "Imprecise and Obvious",
        "review": "I was expecting a movie exploring a little more than just poverty and dribbling. Not impressed. Pelé and Mazola (Altafini) didn't live in the same town as kids and they were not rivals as the film shows. The arrival at Vila Belmiro, Santos' Stadium, shows it in the middle of a town made 100% of slum. Quite a joke, specially in the early 1950s, when Santos was quite a pleasant place. I liked the acting, specially of Pelé's father. And this \"ginga\" BS. As a Brazilian football fan I say... don't buy it. We have great players, but that is useless without good tactics and discipline."
    },
    {
        "author": "javsmedina",
        "review_date": "28 May 2016",
        "title": "Pelé by Stan Lee",
        "review": "The worst is that Pelé is the executive producer of this thing. I think he is totally delusional. How can this be a biographical movie?  I didn't know if I was watching Matrix, Schlinder's List, Ip Man or Ben-Hur. This movie is Hollywood to the extreme. Or maybe Bollywood to the extreme. I can't really think straight after watching the most of this movie last night, I just had lots of nightmares with Pelé Potter, Pelé Wallace, Pelé Balboa...all of them showing me all theirs skills and magic... I wonder, if this is the biography of Pelé, would Messi be capable of destroying planets when he dry heaves in his own movie?  I couldn't finish this masterpiece (of sh..) but probably before the end of the movie you'll find that Pelé saves the world flying Air Force One over the Kremlin while throwing Amazon t-shirts of the wolves howling at the moon on top of the Russian's missiles.  I totally recommend watching this movie. Especially if you are fan of Will Ferrel, Donald Trump, Patrick Star, Bruce Lee's movies, banana skin sandwiches, pulling out your own nails, nails on a chalk board... Best movie ever."
    },
    {
        "author": "sildarmillion",
        "review_date": "18 April 2019",
        "title": "A Hidden Gem!",
        "review": "Yes, I know this movie follows every beat of every cliched sports movie about the underdogs. And I know it's a heavily fictionalized version of history.  But  1. They didn't make that stuff up about the actual World Cup games - that stuff is up on Wikipedia to look up. 2. Football really is that big a deal and part of the culture of Brazil. 3. Pele really was a football wunderkind. 4. My dad used to tell me stories about Pele and his ginga style of play. We're from Bangladesh. A country that is madly in love with Brazil (and also Argentina) every time the World Cup rolls around. Brazil is a huge deal to the people of Bangladesh because here are some folks who look like us, who grew up in the slums, who are beating these white European folks whose ancestors colonized us all.  I wasn't expecting it from this movie, but it touches on race relations, class relations, and the effects of the Portuguese colonization in Brazil. The fact that so many of them are mixed race is constantly brought up by the Europeans. (This is the 1950s, so of course it is.) But despite being mixed mixed race, those who are black are aware of their African heritage (and we learn a brief history of the ginga style) and those who are white are aware of their European heritage. The scene were Altafini realizes that the rest of Europe looks down on him for being Brazilian despite his Italian heritage (which may be fictionalized, but probably happened to some other Brazilians at some point) directly spoke to the movie's theme about Brazilian identity. And the underlying theme of \"be yourself; be Brazilian\" was present throughout and somewhat heavy handed.  But none of the cliches felt cliched because it was all being applied to a new context. There aren't that many football movies or that many World Cup movies. And there are not that many movies about Brazil.  I actually don't even support Brazil that much during the WC because they've won just way too many times at this point! But back then they were underdogs, and this movie shows how they became legends."
    },
    {
        "author": "jain-723-953368",
        "review_date": "27 January 2019",
        "title": "A movie of a 17 year boy creating wonders",
        "review": "Pele a must watch movie. An inspiring movie of the legend Pele. A movie showing a person with talent, hard work and vision can create wonders not for himself but also for whole team an of country. Brazil."
    },
    {
        "author": "imdb-58910",
        "review_date": "25 January 2019",
        "title": "Goal!!",
        "review": "Name Pelé is one of the biggest names in footbal history. I think that eveybody must know this name. Edson Arantes do Nascimento, know as Pelé, is a little boy, who live in a poor part of Brazil. He likes to kick into the ball, playing some ball games with his friends. Some years later, after training with his dad, he join into Santos FC, and afer one year, at age 16 he become a part of a Brazil olympic team. From the start it is tough for young Pelé, because the pressure is unbelievable strong. When your coach don't like your style of play, your teammates are watching you during match, it is really big pressure, trust me. However, when you get into rhythm, nothing can stop you. Acting wasn't the best part of film, but it wasn't even the worst. Film doesn't have a lot of special effects, just some slow motions, when Pelé have the ball. The film is mainly about not giving up ,hardwork and surpassing your limits and surpass fear. Especially, when you like football, you can feel the pressure from this film. It is really gripping and exciting film. I really enjoyed it."
    },
    {
        "author": "goldfussmikey",
        "review_date": "31 December 2018",
        "title": "Fútbol scenes brought this down",
        "review": "I really wanted to give this a high rating. The fútbol scenes totally took me out of the movie with the quick cuts and fancy editing. With modern day technology and great film techniques, I was hoping that the soccer scenes would carry the story to an even better payoff.  Besides that, the Pele story is remarkable and fully justifiable for a movie. The history of it was accurate and the acting was great. I just felt a disconnect with it that I didn't feel with well made sports films such as Miracle, Secretariat, The Greatest Game Ever Played. In those movies, the sports action scenes drive the message of the movie even more. Sad that it was missing in this film."
    },
    {
        "author": "gtmkumar766",
        "review_date": "7 December 2018",
        "title": "Pele: Legend are not Born They are MADE!",
        "review": "Pele: Legend are not Born They are MADE ! Pele: Legend are not Born They are MADE !"
    },
    {
        "author": "adsqueiroz",
        "review_date": "20 November 2018",
        "title": "Great and inspiring film.",
        "review": "Pelé has been an inspiration to thousands of people around the globe for his achievements in football and the way he has motivated so many young boys to pursue their dreams. A great, inspiring and motivating film for all the family."
    },
    {
        "author": "Kirpianuscus",
        "review_date": "9 November 2018",
        "title": "a great film",
        "review": "For message, for plot, for a cameo role or just for the inspired manner to remind a historical event. A great film is the only honest definition of it. Great for the wise manner to present a moral lesson in the right terms. For performances. For atmosphere. In fact, maybe, for the inaccuracy in few scenes. Because it is the film of a state. Simple, provocative, great. Like a film about Pele and his first magnificent victory."
    },
    {
        "author": "wildowski",
        "review_date": "14 September 2018",
        "title": "Great soccer movie",
        "review": "Big fan of pelé and thought the movie was great.Good way of showing his live and was also shocked those all the things he had been through."
    },
    {
        "author": "ste-34",
        "review_date": "26 August 2018",
        "title": "You need a montaaaaaaaaaage....",
        "review": "Imagine every cliche you've ever seen in a sports film made to pander to an American audience. Now imagine someone pretending to be Pele in the middle of all that. Congratulations. You've just saved yourself 100 minutes of your life. It's too late for me. I'm never getting them back. Save yourself."
    },
    {
        "author": "canoarbr",
        "review_date": "14 July 2018",
        "title": "Pelé didn't deserve this movie",
        "review": "I grew up having Pelé as my greatest hero, the closest figure to the Superman i've ever seen. I thought this movie would be a Pelé's biography, but I was totally disappointed, not only by the cliches, but also by the incredible mistakes about his history. Pelé was already a star in Brazil in 1958. He. didn't play the first two games in that World Cup because he was recovering from an injury. He was nationwide recognized as Pelé, not as Dico Nascimento. Feola wasn't the mean guy as shown in the movie (by the opposite, in fact) and so on. Don't waste your time."
    },
    {
        "author": "xeddelgado",
        "review_date": "26 May 2018",
        "title": "Fantastic",
        "review": "Historic and relevant. If you are black you will love this movie. Period."
    },
    {
        "author": "fontaine-30501",
        "review_date": "30 April 2018",
        "title": "not good",
        "review": "Not well made movie, Clichés after Clichés, emotion compassion. Pelé deserve way better than hat. Don't waste your time. typical Hollywood movie"
    },
    {
        "author": "thwheeler-44699",
        "review_date": "19 April 2018",
        "title": "Stretched beyond necessity",
        "review": "What could have been a really great movie was ruined by ill-timed and lengthy flash-backs and entirely too many gratuitous slow-motion edits, and choppy camera work. Had the movie been created by seasoned professionals, it would have been 50 minutes long, instead of an hour and half plus."
    },
    {
        "author": "samratmitrafeb14",
        "review_date": "10 March 2018",
        "title": "A Good Football film that needs to be seen!",
        "review": "I did enjoy this film on many levels and it ticks the boxes for the audience this film targets! The music makes it's presence felt and I looked up the composer: no other than AR Rehman! I am buying the DVD and the CD once they are out!"
    },
    {
        "author": "arturmachado-29588",
        "review_date": "22 August 2017",
        "title": "Only a small portion of Pelé's great story",
        "review": "Pele's rise from the slums of São Paulo to Brazil's first World Championship conquest at the age of seventeen is portrayed in this biographical drama.  The story of Pelé goes much beyond his 17 years and the formidable conquest of Brazil's first World Cup. While the film serves to get a sense of how the slum's kid became an instant legend, it's only a small portion of his great story. One decision that I consider terrifyingly unfortunate is that although the actors are mostly Brazilian, the language used is English, which removes part of the realism and authenticity of the film and almost seems to have been 'dubbed' in a really bad way: it becomes very distracting and certainly downgrades the acting! The dialogues are very bad especially in the first half of the film and surely the writers used some 'historical freedom' for cinematic effect. A very positive point is the cinematography full of vivid colors. On the other hand would have preferred a less Hollywoodian style and a more traditional one, but taking into account the target audience I understand that decision. Good as entertainment and even an inspirational film, but I do not know to what extent it is a totally reliable biography, even with Pelé himself among the producers - always keep in mind the cinema industry' shenanigans regarding 'historical accounts'.  I know it's not a documentary and it's just a movie serving well its purpose for entertainment, but it's also far from being the ultimate videobiography, at least for me. So, while I consider this movie to have many problems and truly feel like rating it 4/10, as a fan of 'the most beautiful game in the world' and due to its inspirational tone I'll give it a pass and score it 5/10. - pun intended ;)"
    },
    {
        "author": "nicholls_les",
        "review_date": "22 June 2017",
        "title": "Wonderful film not just for Football fans",
        "review": "This is a truly wonderful film that all the family can watch. Kevin de Paula is excellent as Pele and all the supporting cast were just brilliant. the early parts of the movie were very entertaining and showed Pele's early life with his friends and the antics they got up to. There are some truly funny moments and also some sadness. The actors who played members of the Brazilian football team were first class and looked like they could genuinely play, but Kevin de Paula's skills were outstanding and it was like looking at the real Pele.  Over all a wonderful movie about a man for whom the word legend really does apply.  Loved this movie so much and I am sure I will watch it many times."
    },
    {
        "author": "charmaments",
        "review_date": "25 January 2017",
        "title": "A football film for everyone, for the whole family, but maybe not football fans",
        "review": "This is a family film more than a football film. In case you were unaware, family films are not just movies that can by watched by anyone of any age, but specific genre film that can be watched by everyone at the same time, as in a family, often at home.  As such, don't expect much depth or drama. There is a death, but it's early on so that it doesn't \"hurt\" too much. The Lion King and Bambi had early deaths too. This is just like that. The story has a lot of clichés, poor-vs-rich, black-vs-white, South America vs Europe, players too poor for shoes, children committing minor theft, parents against the game (but then changing their minds), Pele's style criticized (but then it turns out to be the best style), the bad (evil, not quality) players turning good, child Pele promising to win the World Cup for his crying dad, practicing with fruits, etc. I'm not going to list them all, but if there is a cliché in this film, they most likely have used it.  Although they are clichés, it's not a bad thing that they mentioned them. The rich-poor divide is real, so as the racial divide in Brazil, but this film doesn't shy away from these issues. It comes out as a Brazilian nationalist film \"We're all Brazilian, rich or poor, black or white, born here or elsewhere\" but it's more heartwarming than chest-thumping. Europe still thought of South America as a colony and Italy, for example, was notorious for poaching South American players with Italian heritage to play for the Italian national team. The even poached previous world cup winners from Argentina, which is illegal now.  This film is more like one of the many films of orphans or street kids doing cute things, but with a football flavor.  I don't blame this film for this family-oriented direction. Brazil also made a dark football film, Heleno, but it did not receive a lot of success. The family-oriented market is a lucrative one.  Watch Heleno if you want a real biopic about a footballer, even though there's even less football there.  If you like a feel-good family movie about the adventures of street kids, watch Bekas (2012).  If you want a football movie from the same era (also set in South America in the same time period) then watch Montevideo: Taste of a Dream (2010).  These are my wine-pairing recommendations.  As for Pele: Birth of a Legend, it is what it is, a cute, family football film about poor kids that speak English. The fact that they speak English tells you about the target audience more than anything my review ever could."
    },
    {
        "author": "voxrockulis",
        "review_date": "8 December 2016",
        "title": "Cute feel-good film, one insignificant spoiler to help you decide",
        "review": "A generous 6.5 for a Disney-fied feel-good drama of Pele's life story.  The story goes exactly as you would expect it.  The writing is a bit weak and lacking experience. For example (This is the spoiler), a young Pele plays with a bunch of rich kids who daydream of playing like famous footballers, each saying \"I'm this guy\" \"I'm that guy\" - Pele interjects and says \"and I'm Pele!\" to which the other kids ask: \"Who?\"  Pele explains that he's pretending to be the Vasco de Gama keeper and the kids laugh at him and correct him, \"It's Bilé.\"  Then they say \"Hey, let's call this boy Pele\" - in real life (or in a better script) they would not have this \"decision\" moment, but would just start calling him Pele, like a \"see you later, Pele!\" not something as contrived as \"Hey everyone, we have decided to call this boy Pele because it's funny. This is a good idea.\" Poor script-writing. The did this same thing with \"Hey let's all call this team the shoeless ones\" instead of just going straight for shoeless jokes like \"lace up!\" or more cruel jokes like \"If you beat us I'll lend you my old boots.\"  An even better story for the Pele name sticking would be for the rich kids to completely forget the boy until they meet him in a tournament match. When they were talking about him, the rich kids could say \"Who?\" (are we facing?) because they didn't actually know his real name and one of them could say \"that Pele boy\" which is the way people actually talk.  This movie was filled with these lots opportunities and weak moments with unnatural dialogue. The scriptwriter can't hide behind language issues because the dialogues sound contrived even in Portuguese. Bullies don't say \"hey, what do you guys think of this nickname for this boy we could all start using? Do you agree that it is a good one to use to taunt him?\" They just use it, they don't have a meeting or vote about it.  It felt like those anti-bullying educational videos they show to kids where the bully says \"I do not like you because you look different. From now on I will do this to you.\" \"I want to smoke because I feel like an adult doing it and it is cool.\"  Pele's football skill also makes no sense. His skills fluctuate from world class to garbage class and back with no explanation whatsoever. They could've made it about the pressure of the national team, locker room problems, family problems, love, something that explains his drop, but nopes. His skill just drops in the second act so that it can come back at the right time \"because 3 acts.\"  Even as a Disneyfied feel-good story, they could've done a better job.  I started the review giving this film seven stars, but the more I thought about it the more it felt too generous. I dropped it to 6.5.  Don't get me wrong. It's enjoyable, but it's two wasted opportunities - they could've made a great, hard-hitting dramatic biopic (something similar to, but better than Heleno) or they could've made a better feel-good film. They didn't do either. They chose the easier option and still failed.  This film will surely have cooled any interest in making a better Pele movie of either variety."
    },
    {
        "author": "luciaferreira-69768",
        "review_date": "3 December 2017",
        "title": "Crap movie , that is a lot of lies...",
        "review": "That was the worst movie I saw lately. Very bad made. I don't know how Pele aproved it...It doesn't represent anything real about Brazil. Maybe the mangos and bananas trees are real... It s an American movie with American artists( afro-American, Indian American)that don't know anything about Brazil. It is nothing about football in Brazil or Brazil... Very disappointed."
    },
    {
        "author": "clearbluesky-36985",
        "review_date": "27 August 2016",
        "title": "Must watch for Football fans!",
        "review": "First off, I am a Football fan! Football is the greatest show on earth! More people watch football world cup than any other event in the world. But to capture the magic for a movie is tricky business.  Pele is as good as it gets when one makes a movie about football. I feel the movie did not do enough to do justice to \"The Man\". It also had a \"dubbed\" movie feel.  It was a good movie with some great moments capturing some of the magic of Pele's rise to stardom.  The movie was overall good, although it had the potential to be great. It was enjoyable and emotive at some points."
    },
    {
        "author": "vmani_mca",
        "review_date": "8 September 2018",
        "title": "Good",
        "review": "Good one to show it to kids. At rahman music is very much strength for this movie"
    },
    {
        "author": "odawg_007",
        "review_date": "25 June 2018",
        "title": "Great soccer movie",
        "review": "A great movie to understand the beautiful game. Really well done!"
    },
    {
        "author": "coverplex-12802",
        "review_date": "17 May 2018",
        "title": "Very inspirational",
        "review": "Very inspirational. Absolute outstanding talent portraited very well here in this movie"
    },
    {
        "author": "scottshak_111",
        "review_date": "21 July 2016",
        "title": "A very light sports entertainer that fails to capture the game in its truest form",
        "review": "It is not a good sports movie, but it is definitely a great entertainer if you are looking for something really frivolous to go with your frolic mood. It seems to have been helmed for those who aren't really big fans of the game.  PELE: BIRTH OF A LEGEND IS BASED ON PELE'S LIFE Pele: Birth of a Legend will let you have a glimpse into the life of Pele the true legendary footballer and throw some light towards his madding fad. Things that were pulling him down were all around him, and despite all the odds he shone through.  The movie tries to capture his street football shenanigans, adds in some humour, a pinch of dramatic spices and tries to bring in the forefront the popular Brazilian Ginga style that was Pele's USP.  DOWNSIDES OF THE MOVIE Despite how Pele: Birth of a Legend lodges in you some good vibes, it falls flat owing to its pathetic depiction. You constantly see drops of frustration on Pele's brows, which really takes a toll on your spirits. If you are really looking for something extraordinary to happen given the mammoth sports figure he is, the movie lets you down so many times, you constantly wonder if something out of the box is going to happen. Even though it does, it is nothing akin what happens in a gut-wrenching live sports match.  Leonardo Lima Carvalho was a pleasant find. He made young Pele really endearing. His group shenanigans were a delight to watch. The starting bits of the movie were the best moments I would say. Even Seu Jorge who played Dondinho was great. Vincent D'Onofrio unfortunately had very little to play with in his baggage, but he performed his bits nicely.  SPOILERS DRIBBLING AHEAD Melodrama has been deliberately pushed in its frames and there is so much of it that it becomes really exhausting at times. When in the middle of the game players go in bullet mode to have a look at each other, you can almost imagine how implausible its dramatic elements must be.  THE LOST PELE CAMEO There is a guest appearance by the legend himself at one point, which will bring a smile to your face. But that's about it. Eventually you get to see one game in Pele: Birth of a Legend, but then it is smitten with so much melodrama that sports simply gets lost in those pointless close-up frames. Nothing wrong with watching it once though.  Read all my reviews here: http://straightfromamovie.com"
    }
]