[
    {
        "author": "loismustdie125",
        "review_date": "28 February 2005",
        "title": " Seth MacFarlane, YOU'RE A GENIUS!!",
        "rating": "10",
        "review": "I cannot even begin to discuss how ridiculously smart and outrageously funny is this show. Not only does this program far surpass most of the comedies on television, it has the guts to hit topics that most of the overly sensitive public shies away from. I never understood why it was taken off the air in the first place. Fox can show something as tawdry and humanly degrading as Temptation Island, but Family Guy was too racy? Riiiight.I absolutely must comment on the incredible voice talent done for this show, most especially the amazing creator himself, Seth MacFarlane. First of all, his versatility is unlike anything I have ever heard. When I discovered how many voices he actually performed, I was floored. I am currently receiving my masters in speech pathology so I find his ability particularly interesting. Not only can he speak in these individual voices, he can sing in them, and very well I might add.The musical numbers in this cartoon revive a dying art. The \"Road\" episodes are a hysterical throw back to the Crosby/Hope movies, which is a reference I usually have to explain to my friends though they often must explain a few that I miss. In fact, the scope of the references range from cheesy 80's TV to political commentary to Broadway. This is why everyone will find something funny about this show. Everyone in one form or another can relate to it.Most of my guy friends think I should be offended by the show because I am a woman and this is a \"guy's show.\" Let me tell you, this is not the case at all. Lois Griffin is a freakin role model. I like to think I have half of her savvy when dealing with my ignorant boyfriends.Absolutely excellent television. Edgy, funny, intelligent and extremely creative. This show was a breath of fresh air for mundane television and will soon awaken the network again. Seth MacFarlane, you are a genius!!"
    },
    {
        "author": "denizcemkararkoca",
        "review_date": "7 March 2019",
        "title": " NO, it is STILL so funny",
        "rating": "7",
        "review": "Unlike the Simpsons, the new episodes of the family guy still is highly entertaining and definetely funnier."
    },
    {
        "author": "maxi-bell",
        "review_date": "24 January 2015",
        "title": " Like many, it has fallen into a downfall spiral.",
        "rating": "9",
        "review": "Well, Family Guy has garnered my attention, until recent years.Like many shows, it has taken a serious dip in quality. I found the more recent episodes/seasons have been more political, and less about the characters.I remember watching a recent episode, and then watching the very first episode, 'Death has a Shadow'... Did I then realize that the show isn't once what it was...I loved the earlier seasons, as it was Family Guy the way it was meant to be... Offensive, disgusting, crude, you name it. This show has taken a step away from that, and that was the very thing I loved about the show.Don't get me wrong, there a couple good episodes in the newer seasons, such as 'Road to Multiverse', or 'Back to the Pilot', but I wish the newer seasons were more consistent in good content, such as the latter and/or the former.As a Family Guy fan, I recommend only watching up to season 4. Anything past season 4 is where the quality takes a dive.The first 4 seasons are pure comedy gold.Regardless of the lackluster quality in newer seasons, my thoughts in seasons 1-4 are that the show is fantastic. It is the reason why I give this a show a watch, and a high rating. The characters are so crude, and humorous, that I remember almost losing my breath, since I would laugh so much.The parts that 'kill' me, are when Peter would have flashbacks or made up thoughts in his head about prospects of his life... Pure genius.If you are a person that wants to watch this, again, I would only watch up to the end of season 4. Past that is mostly irrelevant."
    },
    {
        "author": "RPullen",
        "review_date": "20 December 2002",
        "title": " Farewell",
        "rating": "10",
        "review": "I've heard that \"Family Guy\" has been pulled from television? Don't know if it's true or not, but \"Family Guy\" has/had so much potential, the difference between \"Family Guy\" and \"The Simpsons\" is that \"Family Guy\" isn't really based for all ages, it's far more crude and less subtle. I really like \"Family Guy\" it is original in places, and in a world where cartoons have to compete with \"The Simpsons\" that's saying something."
    },
    {
        "author": "kyle-hannah",
        "review_date": "25 July 2007",
        "title": " We're All Lucky There's A Family Guy",
        "rating": "6",
        "review": "Family Guy is without a shadow of a doubt an intriguing, funny, and unique experience every week it is aired. This television series has survived through adversity and overcame challenges after being canceled twice and brought back.The humour of Family Guy is definitely something the future will call \"family guy humour\" it's random off the wall antics generally focus on priceless flashback sequences and stammering over awkward sentences to keep you laughing. The once very promising series is beginning to wear down however as season 5 was full of very dull and humourless episodes and i believe it is because of Ricky Blitt temporarily leaving the show to do The Winner which coincidentally flopped. Seasons 1-4 have been as pleasure and the first six or so episodes of Season 5 as well but only time will tell if this series stays as consistently funny as it's almost always been.Many criticize it and claim it as a Simpsons rip off which is totally inaccurate and unfair. Homer Simpson is a dim witted easy angered character while Peter Griffin is a pop culture obsessed moron who always means well. Marge Simpson is an intelligent, nagging, wife while Lois Griffin is a good hearted mother whose party girl side is always emerging. Bart Simpson is a little hell-raiser who loves to cause trouble and pull pranks while Chris Griffin is a slow, dopey, lummox. Lisa Simpson is an intelligent, kind, liberal while Meg Griffin is a self pitying, neglected, border line suicidal loser. Maggie Simpson doesn't speak or do much throughout the show while Stewie Griffin is a quick witted baby bent on world domination with a lot of homosexual tendencies. The shows are very different and share few similarities.The show revolves around family and the struggles and over the top things that occur throughout their daily lives. The humour is totally random with irrelevant and hysterical flashback sequences occurring throughout the episode and contains a ton of satire that is both offensive and true.Seth MacFarlane reminds me of Quentin Tarantino with the way he pays homage to things he loved or remembers growing up and the pop culture references will make you think \"oh yeah i remember that\". I believe Family Guy will become a classic and in my personal opinion already has but i see a very sunny future for this great animated series. Watch out for it in the fall of 2007 as it enters it's sixth season with Ricky Blitt back on board."
    },
    {
        "author": "safulacod",
        "review_date": "20 February 2019",
        "title": " duh huh family man",
        "rating": "10",
        "review": "Family man stars bETER griffin, one of the most iconic sex symbols of all anime. This automatically makes this one of the best shows ever made. But even more great moments come from the show like when bETER griffin met sans undertale and when brain died in the series finale. Every time bETER Griffin fALls down the stair haha so funny or when bEter does the bird is the WORD HAHA. overall family man is the best thing ever made by humanity."
    },
    {
        "author": "animalfanatic",
        "review_date": "25 March 2007",
        "title": " My favourite TV show",
        "rating": "10",
        "review": "I love everything about family guy.My favourite characters in family are Brian and Stewie and I like the episodes when it mainly features them such as \"Road to Rhode Island\" (Season 2), as they interact very well. The comments they make just have me in stitches. Peter's behaviour is also very funny as some of the things he does \"are just so brilliant they're retarded.\" The voice acting is excellent, especially Seth MacFarlane as he provides the voices for half of the Griffin family as well as their perverted neighbour Glenn Quagmire and how he manages this range (particularly with singing) I just don't know. He deserves his two Emmy's for providing the voice of evil baby genius Stewie. Adam West also steals the show with his funny and completely insane regular character the mayor of Quahog. What I like about Chris (voiced by Seth Green) is the things he says show that he takes after his father when it comes to intelligence and common sense.The only thing I have found annoying is that in the UK Fox has decided to change the seasons to increase DVD sales, which in no way reflect the programme itself but rather the marketing.If you enjoy Family Guy then I would thoroughly recommend Seth MacFarlane's other project American Dad which uses a different style of humour but is still extremely hilarious."
    },
    {
        "author": "Tonyboy",
        "review_date": "26 September 2005",
        "title": " Losing its edge",
        "rating": "8",
        "review": "While I know that I run the risk of being chased out of town for saying this, I feel that since the beginning of Season 5, the show has lost its edge.90% of the jokes in \"Family Guy\" fall into one of 3 categories: 1) Jokes making fun of pop culture (especially old TV shows and celebrities) 2) Gags that run so long that they become absurd 3) Flashbacks, most of the time introduced with \"This is more ___ than that time I ___\"I'm sure that a lot of people find this stuff funny, but after 4 seasons with this kind of humour, it just becomes so expected that it ends up being routine. This doesn't do it for me.I still like this show and I think it has a lot of potential, but it needs some new ideas!"
    },
    {
        "author": "liquidcelluloid-1",
        "review_date": "12 August 2007",
        "title": " MacFarlane's brilliant sitcom parody was once one of the funniest things on TV, but now it may suffer the same creative fate as the Simpsons",
        "rating": "4",
        "review": "Network: Fox; Genre: Animated Comedy, Satire, Parody; Content Rating: TV-14 (pervasive sexual content, scatological humor, strong language, violence, animated nudity); Perspective: Contemporary (star range: 1-5); Season Reviewed: 5 seasons After 5 seasons, two cancellations and a now militant army of fans the show has amassed, I don't quite know what to say about \"Family Guy\" anymore.When \"Family Guy\" debuted in 1999 it was a shotgun blast of comic brilliance that came out of nowhere and went unheard by an audience still enraptured by the antics of \"Friends\". At first it all appears relatively routine, even - as many have accused - a ripe-off of \"The Simpsons\". Fat, child-like, head of household Peter Griffin (voiced by creator Seth MacFarlane) screws things up while dotting wife Lois (Alex Borstein), put-upon daughter Meg (Mila Kunis) and genetic copy Chris (Seth Green) look on. Also in the mix is genius, homicidal infant Stewie (MacFarlene) - one of the most deserving break-out characters in TV history - and Brian, the family's talking dog.If the characters sound like clichés, that's the point. MacFarlane uses them simply as vessels and with the show regurgitates every pop culture childhood memory to create a full-length parody of 70s and 80s sitcoms. Even better than a parody, a satire. Just as Archie Bunker was a product of the 50s being imposed on by a changing 70s culture, \"Family Guy\" is about the new millennial values juxtaposed on sitcom camp of the last century. In MacFarlane's world there are child molesters on \"Lost in Space\" and \"Eight is Enough\" actually refers to disciplinary beatings.Yes, \"The Simpsons\" have covered similar ground, with a particular emphasis on random flashbacks and fantasy scenes. But with \"The Simpsons\" in a creative tailspin for the last decade, MacFarlane and crew swoop in to fill this gaping void. To out-Simpson \"The Simpsons\" if you will. What MacFarlane brings to the table is pitch-perfect comic timing - an ability to know how quick to cut or how long to drag out a particular bit to get the laugh. As well as utter fearlessness. From bits in which Jesus Christ turns water \"into funk\" or a TV parody \"Gumble 2 Gumble: Beach Justice\" staring Greg and Bryant Gumble as bicycle cops, \"Guy\" isn't just one of the funniest things to grace TV, it was freakin' brilliant. This breaks from are more often like an animated version of \"The Far Side\", then \"The Simpsons\".Then it was canceled only to be renewed at the 11th hour. And then it was canceled again, brought back supposedly by strong DVD sales. But given the networks ownership of the show and how Fox beat to death the equally strong \"Futurama\", it's hard to buy that. This constant shakeup has got to take a toll on a series' rhythm. When the show returned for a 3rd season it felt lacking of something. As if the network notes to \"slow the pace\", \"tone down the fantasy scenes\" and \"thicken the story lines\" were rigidly being followed when the breaking of these rules was what made the show great in the first place. Still it contained classics like \"Emission: Impossible\", \"The Thin White Line\", \"Road to Rhode Island\" and \"Brian Wallows, Peter's Swallows\" to keep us satisfied.Upon the 2nd return, giving us seasons 4, 5 and beyond, the show has completely lost it's footing. After a LONG agonizing wait, the 4th season premiere is a disappointing \"North by Northwest\"/\"Passion of the Christ\" parody. The rest of the season follows suit in which only \"PTV\", the show's satire of the TV ratings system, recaptures it's prior lunacy. MacFarlane makes the crucial mistake here, actually wanting us to care about them. Given that they where envisioned as clichés in the first place, putting the weight of a story on their backs only shows how lacking the show is for character depth. Even Stewie, once a source for huge laughs, is stripped down to a single latent homosexuality joke. The show gets story heavy where it shouldn't. Slows down when it should speed up. Goes broad when it should go cult. Gets political and angry when it should be mindless escapism. \"Family Guy\" was about velocity, randomness and obscure 1% gags.I won't go as far as to say that \"Family Guy\" beyond seasons 4 and 5 is proof that a dead show should probably remain dead. But it is proof that a show can't go through constant cancellations and reshuffling and remain intact. It also suffers from the same fate that has plagued \"The Simpsons\". It is full of itself. It has become lazy in a belief that it can do no wrong in the eyes of it's fans. \"Family Guy\", in many ways, has sold out. It isn't the acerbic TV rebel it used to be. It is now part of the system itself\"Guy's\" humor has a masterful ability to appeal to \"Star Trek\" nerds and drunken frat boys alike. And it is hard to deny the TV geek in my doesn't flip out when they do something half of either audience won't get like weave a \"Star Wars\" joke into a \"Curb Your Enthusiasm\" reference. But the show's die-hard legions of fans (some damn near sycophantic over the show's brilliance) have allowed it to be lazy and complacent and paved the way for MacFarlane's head to slide right up his own posterior. In some ways he deserves it, the show can still be very, very funny. But the true fans out there know that it can do much, much better. * * * ½ / 5"
    },
    {
        "author": "Ginger87",
        "review_date": "2 August 2004",
        "title": " Great Show!",
        "rating": "8",
        "review": "I started watching \"Family Guy\" right after it premiered after the Super Bowl back in 1999. I immediately fell in love with it and thought it was hilarious. \"Family Guy\" is about the Griffin family who live in Rhode Island. Peter Griffin is the father of the family and not very bright. He usually says wrong things in the wrong time. Lois is the mother of the family and smarter than Peter. Meg is the daughter of the family and she tries to avoid her family from making her look uncool and goes through teen problems. Chris is the son who loves to eat and is also not very bright. Stewie is the baby who tries to kill his family and take over the world. Brian, the dog, is the voice of reason in the family but also an alcoholic. \"Family Guy\" has many great episodes. My favorites include \"Road to Rhode Island\", \"Peter, Peter Cavier Eater\", and \"Mr. Saturday Knight\". I am glad new episodes are coming next year! This show deserves 10/10 stars!"
    },
    {
        "author": "jholman3081",
        "review_date": "19 February 2019",
        "title": " Hilarious, edgy ... brilliant",
        "rating": "9",
        "review": "One of my all time favorite shows.\nSure it's vulgar, sexist (giggity), discriminatory, all sorts of terrible things but hey, to varying degrees aren't we all? (Even if you only think it, it still counts). That's part of the fun of it ... no pc bs!\nStewie to Brian ... \"Why are you licking yourself down there?\"\nBrian \"I'm cleaning myself.\"\nStewie \"You were clean 15 minutes ago, now you're just on vacation!\"\nLove ya' Griffins ... except Meg of course ... greatest bunch of degenerates ever to grace our tv screens :D"
    },
    {
        "author": "hooleydavid",
        "review_date": "12 October 2018",
        "title": " One of my favourites",
        "rating": "5",
        "review": "I'm currently going through and watching from S1E1 right until the latest episode, currently 10, almost 11 seasons in and I do think the first 4 or 5 seasons were better, and the feature-length episodes do get a bit tedious, but overall I just think is comedy gold. It's not a classic comedy, it's more ridiculous, childish things that make this show funny - the low maturity level of Peter, the cutaways, the ongoing jokes with the chicken and THAT song. I watch an episode every day with my dinner, often two a day in fact. Whilst some episodes often pass me by without making me laugh and are forgettable, 9 times out of 10 there's a few moments in every Family Guy episode that make me crack up!Not one to watch with the family, but certainly one I'd recommend."
    },
    {
        "author": "DrWillHatch",
        "review_date": "24 March 2009",
        "title": " Addictive but lazy cartoon that's ultimately forgettable",
        "rating": "8",
        "review": "When Family Guy first premiered, I was not in a discriminating mood. With the 1990s containing a wealth of clever, surreal cartoons, why should I be? Nickelodeon produced Doug; Ren and Stimpy and Rockos Modern Life among other fine cartoons(Yes, this includes Spongebob).All had quirky, dreamlike animation and surprisingly sophisticated stories and dialog. The Simpsons became an outright phenomenon, perhaps not as brilliant as its biggest defenders claim it to be, but a very fine investment of your time and certainly dismisses the false axiom that all TV is junk. South Park started out as a crude but hilarious attack on everything with unique and intelligent satire underneath. It evolved to become a Monty Python- esquire show with outrageous concepts and brutally swift and sharp societal critiques(Such as their defense of the noble underpants gnomes) and eventually settled to be entirely self referential and \"meta\" like the Simpsons did, and has unfortunately jumped the shark. Family Guy is superficially like The Simpsons and South Park. It pushes buttons and is a favorite among college students and bestiality enthusiasts. However, what it has in loquacity it lacks in true wit.The show is famous for its use of gimmicks, especially for flashbacks. Many are references to bad TV sitcoms or commercials. Some are funny(Especially from the first two seasons), most are not. Are references inherently funny? I'm not sure, but they are mostly what the show stands on considering that its characters are painfully uninteresting. Where Homer and Bart have charm, and Cartman has an artillery of self awareness and pure outrageousness to back up his awful behavior, Peter Griffin has no excuse. He's just a loud, obnoxious pig. Anything funny coming from his character is only because the writers forget how to be unfunny that day. Lois is also very shallow and dull; Meg is a prop, only to be abused; Chris is borderline retarded and only occasionally funny, and the two main stars of the show(Stewie and Brian) are so inconsistent in their characterizations that it all really kind of pointless.Other gimmicks I can't stand are when a character points to something obviously and lingers on it for an uncomfortably long time. This happens a lot lately, and I can't bear it any longer. Not just the oft mentioned chicken that likes to beat Peter up, I'm talking about the painful moments where they talk about pop culture and prod it as if they are alien spectators. That's not wit or even ironic humor, it's totally boring and lifeless.Not that the show can't be funny, in fact some of the earlier episodes had me rolling. Highlights include the pilot episode, where Peter loses touch with reality after losing his precious television; when Peters religious zealot father shows up and wreaks havoc; When Peter becomes a narc at Megs school, and the \"pancake\" episode. I suspect these are the episodes that accidentally incorporated actual human traits in its characters, or merely were times the writers had actual comedic inspiration.One last thing, the show is not offensive. It's only offensive to those who wouldn't watch the show in the first place, so it's almost like a circle jerk to the choir of hipsters."
    },
    {
        "author": "Smells_Like_Cheese",
        "review_date": "24 November 2003",
        "title": " Not as memorable as The Simpsons, but Family Guy is a fresh new and funny look at adult comedies",
        "rating": "8",
        "review": "Family Guy is actually one of my favorite shows, the jokes are always a blast to hear and watch and it has one of my all time favorite cartoon characters: Stewie Griffin. A lot of hard core Simpsons fans do accuse this show of being a rip off, I agree, it's similar in some aspects, but still Family Guy is always worth the watch in my opinion. It's also a little more grown up than other cartoons, when it comes to the hard core jokes, Family Guy never disappoints, they will take the joke as far as they can go.The show is about the Griffin family: Peter, Lois, Chris, Meg, Stewie, and Brian. Peter is the head of the household, he's a bit on the slow side, loves beer, and is in love with TV. Lois is the wife and mother, she's always the one you'd want to go to with problems, but when you mess with her, she comes back with a punch! Chris is the son, very slow and stupid, but sometimes has those strange moments of very deep thoughts. Meg is the daughter who just can't be noticed and is finding herself in the harsh world of high school. Stewie, the baby, is a wanna be dictator, wants to kill Lois, will destroy broccoli, kill he man in white, and is always looking for victory to be his! Brian is a man stuck in a dog's body who loves Lois and is trying to figure out why he's with the Griffin Family.Family Guy has some extremely funny episodes, for me the most memorable are: Chitty Chitty Death Bang, Emission Impossible, A Very Special Family Guy Freakin' Christmas, and 8 Simple Rules for Buying My Teenage Daughter. Those are the episodes that just always can get a constant laugh from me. But I do recommend Family Guy, it's not for the faint of heart, but it's just a fun show if you want a few good laughs. The cast loves doing this show and they always pull in great and memorable characters. While I still prefer The Simpsons, Family Guy is also a show that I will always watch when I get the chance."
    },
    {
        "author": "SonicStuart",
        "review_date": "26 July 2004",
        "title": " Another Great 1999 TV-show!",
        "rating": "8",
        "review": "Family Guy is another of the best TV-shows that premiered in 1999! Family Guy kind of reminded me of The Simpsons a little bit but there both different. The way Family Guy is like The Simpsons is that they both have the same plot which is a sit-com about a dysfunctional family that lives in a medium sized town where anything can happen and plus the humor is slapstick. Peter Griffin (voiced by Seth MacFarlane) does his best to do what's right for the family, but along the way, he makes mistakes that are the stuff of legends and he is the not so bright one in the family, he speaks before he thinks which is hilarious. Then there's Lois (voiced by Alex Borstein) who is the most sane of the bunch. There is the two teenagers of the family Meg (Season 1 was voiced by Lacey Chabert and then Season 2 and beyond Mila Kunis did the voice of Meg) who is one of those kids who tries so hard to fit in but yet it doesn't work and I feel so sorry for her and then there's Chris (voiced by Seth Green) who is fat, not really that smart but yet spirited and kind of weird. Then there's Stewie (voiced by Seth MacFarlane, again), the evil baby who has an English accent and is this evil genius who wants to take over the world and then there is Brian the dog (voiced by Seth MacFarlane, again), who is the smartest in the family and likes to drink and smoke and doesn't really describe himself as a domestic animal and is trying to find his purpose. The show is so funny because it also makes fun of several movies and other TV-shows which is another thing Family Guy and The Simpsons are alike! The other characters in the show are Cleveland (voiced by Mike Henry) who is this all-around nice guy; Joe Swanson (voiced by Patrick Warburton) who is this tough guy who is in a wheel-chair because he paralyzed his legs and he mainly uses his upper-body strength and then there is Quagmire who is this sex-maniac who goes crazy for any woman that is sexy and I like the way Quagmire says \"Alright!\" and I say it the way he would said it now. Plus Adam West is in Family Guy playing the Mayor of Quahog, himself and Seth MacFarlane also worked with Adam West when MacFarlane was working in Hanna-Barbera! It premiered back in 1999 after the 1999 Super Bowl where the Denver Broncos won! Then in 2002 FOX canceled this series and then Cartoon Network's Adult Swim block came along and picked up the series for re-runs and then TBS and now it is going to make a return on FOX! You can get this series out on DVD too!User Rating: 9/10BOTTOM LINE: HILARIOUS AND A BIT LIKE THE SIMPSONS BUT DIFFERENT!"
    },
    {
        "author": "r-lythgoe",
        "review_date": "5 September 2014",
        "title": " Shouldn't have come back",
        "rating": "10",
        "review": "When Family Guy first debuted back in 1999, it was absolutely brilliant, and for three seasons was consistently excellent, with some of my personal favourite episodes being \"Chitty Chitty Death Bang\", \"Da Boom\", \"Holy Crap\", \"Road To Rhode Island\", \"There's Something About Paulie\", \"Road To Europe\" and \"Ready Willing And Disabled\".While the characters were pretty much all good in their own way (except Meg, who, let's face it, was an annoying brat), my favourite character was easily Stewie, who , despite being a baby, was also a homicidal evil genius obsessed with killing his own mother. BRILLIANT! Most of the side characters were hilarious as well, particularly Quagmire.After 3 excellent seasons, however, it was cancelled. This isn't exactly a bad thing, however, as many other sitcoms have lasted a short while and have been remembered as some of the greatest sitcoms of all time, the biggest example of that being Fawlty Towers. If FG had stayed cancelled it would be remembered as one of the greatest shows of all time.Unfortunately, it came back. BIG MISTAKE! Don't get me wrong. Season 4 was very good, with excellent episodes such as \"The Cleveland-Loretta-Quagmire\", \"Petarded\", \"Peter's Got Woods\", \"PTV\", \"The Fat Guy Strangler\", \"The Father, The Son And The Holy Fonz\" and the fantastic \"Stewie Griffin: The Untold Story\" trilogy. However, S4 wasn't exactly as consistent as the first 3 seasons.It was Season 5 were it really began to run out of steam, being merely an \"alright\" season with a very mixed quality of episodes. By this point, Seth Macfarlane had also started to change many of the good things about the show, transforming Stewie's character from an evil genius to a repressed homosexual, and making Peter more and more stupid. Despite this, there were still some good episodes such as \"Peter's Two Dads\" and \"Meet The Quagmires\". Season 6 was more or less the same. Despite containing the absolute masterpiece that was \"Stewie Kills Lois/Lois Kills Stewie\" (My two favourite Family Guy episodes by the way) the rest of the season was kind of meh. Season 7 was yet again underwhelming, with the only standout episodes being \"I Dream Of Jesus\" and \"We Love You, Conrad\".Then we got to Season 8, and this is when the show started to become a giant load of horses**t. Not one SINGLE episode in Season 8 was even funny in the slightest and the show became way too vulgar and offensive, with the biggest examples being \"Dial Meg For Murder\", \"Quagmire's Dad\", the RUBBISH Star Wars parodies and \"Peter-assment\". Season 9 was again terrible, despite containing two very good episodes (\"And Then There Were Fewer\" and \"Road To The North Pole\". Season 10 was again the same. Despite some really good episodes like the fantastic \"Back To The Pilot\" and \"Mr. And Mrs. Stewie\", they couldn't make up for the rest of the season, which contained such travesties as \"Seahorse Seashell Party\" and \"Screams Of Silence: The Story Of Brenda Q\". And Seasons 11 and 12 were both completely terrible all the way through, with ZERO redeeming qualities. So I have made the decision to stop watching.In conclusion, Family Guy was a once great show that, just like The Simpsons, has become a giant load of crap. But for once being a fantastic show, I'm going to give it an 8/10."
    },
    {
        "author": "aidenthegr",
        "review_date": "15 July 2018",
        "title": " Used to be great, now it's garbage.",
        "rating": "6",
        "review": "This show used to be amazing at everything, world building, comedy, characters, cut aways, and more, but now it's a washed up show that has most of the characters who used to be really funny confusing and hard to like. In my opinion the prime of this show was seasons 1-8 But it was still kinda going good till 9-12 But at season 13 was we're the episodes started to get boring. I'm still giving it a 9 though because of those golden episodes in seasons 1-8."
    }
]