[
    {
        "author": "jennyp-2",
        "review_date": "25 January 2006",
        "title": " A fun jewel thief romp",
        "rating": "8",
        "review": "When we left our gal Sophie in The Notorious Sophie Lang (1934), the bewitching jewel thief made a clean get-away - at least with her leading man, gentleman bandit Max Bernard, if not with the jewels. Lang and Bernard sail into the sunset on a luxury liner bound for London while her priceless purloined pearls are discovered where she had concealed them in the plumbing of Lang's hotel room. After faking her own death so she can go straight and begin a new life, we find Lang five years later living in London under the assumed name Ethel Thomas. Lang/Thomas is a paid companion to the elderly Mrs. Araminta Sedley (Elizabeth Patterson) who just happens to be a jewel collector. (Get thee behind me Satan!) The two board a liner for New York and Mrs. Sedley locks up her valuable Kruger diamond in the ship's safe. On board are Ray Milland as newspaper reporter Jimmy Lawson to provide the romantic interest and Sir Guy Standing as the infamous Max Bernard to provide the conflict. Naturally, the diamond gets stolen, Sophie gets blamed and she redeems her past by catching the culprit. (Remember  this sequel is POST-Code.) The character of Max Bernard, Sophie's beau, was played in the first film by the suave 39 year old Paul Cavanaugh. Curiously in the sequel, Max is portrayed by the much older Sir Guy Standing (63) and their past affair seems to have been forgotten. Likewise, the role of New York police inspector Parr went to a different actor, with Paul Harvey taking over the part from Arthur Byron. On board for directing duties is stalwart screen veteran George Archainbaud, in the middle of his 41 year career. Born in Paris, Archainbaud came to America in 1916 and began directing motion pictures soon after. He worked steadily through the next four decades, largely in television westerns such as Hopalong Cassidy and The Gene Autry Show in the 1950's. His best regarded film is The Lost Squadron, a bittersweet WW1 story. Gertrude Michael was likewise at the brightest point of her Hollywood fame, before succumbing to alcoholism and finding fewer film roles in the 1940's and 50's. She died in 1964. Contemporary reviews were complimentary. Frank Nugent of The New York Times concluded his admiring summation with \"we find ourselves thoroughly in favor of Miss Lang's return. May it be periodic.\" Alas, there was to be only one more episode in the series, Sophie Lang Goes West (1937)."
    },
    {
        "author": "gridoon2019",
        "review_date": "13 April 2014",
        "title": " Rather weak B-movie",
        "rating": "5",
        "review": "Just like the first \"Sophie Lang\" film, made two years earlier, this \"Return\" does not live up to its promise either. The one significant upgrade of the follow-up is the male lead: Ray Milland is, of course, more charismatic than Paul Cavanagh, even though he and Sophie Lang fall in love a little too quickly. But Cavanagh's character returns as well, in a somewhat confusing manner: this time he is played by a much older actor, so the implied, at the end of the first film, love affair between him and Sophie is completely ignored. Sophie's character, most likely due to the enforcement of the Production Code, has also changed from a jewel thief who loves her work to a reformed good girl who has (literally) buried her criminal past. Gertrude Michael has some good moments, particularly when she's mimicking Elizabeth Patterson's voice patterns, but overall this film is pretty weak. ** out of 4."
    },
    {
        "author": "mark.waltz",
        "review_date": "25 October 2017",
        "title": " She may not really be dead, but the code and bad writing have killed her spirit and any consistency.",
        "rating": "3",
        "review": "When the first film of the three part \"Sophie Lang\" series ended, we saw Gertrude Michael and Paul Cavanaugh dancing on a cruise ship, unaware that their stash of stolen jewelry has been found by bumbling detective Leon Errol, not in the fish bowl being carried by Michael's aunt, Alison Skipworth. For some reason, five years have passed by, Skipworth is nowhere in sight, and Michael is now working for a rich American (Elizabeth Patterson) in London, having given up her life as \"Lady Raffles\". Cavanaugh's character (inexplicably now played by the much older Sir Guy Standing) wants to get his hands on a valuable piece of jewelry owned by Patterson and utilizes handsome Ray Milland to romance Michael so he can switch it with fakes. For some reason, Michael has made herself believed to be dead, simply buying a huge gravestone marking her resting place, yep, just like that. It's as if there are two Sophie Lang's living in parallel universes who look almost exactly alike, or at least one universe that the Hays code approves of.After the success of the first one, an above average B picture, the change in Hollywood morals thanks to the boring code has all but taken the life out of Michael's character. She only comes to life when she must pose as Patterson, wearing a veil and speaking exactly like her. Whether or not Michael imitated Patterson or was simply dubbed by her is unknown, but it's the one clever aspect about this disappointing sequel. Gone, too, is the glamour of the first film, looking cheap and gaudy. Patterson is always a commanding screen presence, and while her character is more ladylike than the majority of her roles, you can't take your eyes off of her. But this is a pale follow-up to the original and flops big. Sophie Lang's return is a missed opportunity that becomes obvious when watching the two films back to back."
    }
]