[
    {
        "author": "amber-57438",
        "review_date": "29 December 2018",
        "title": " Seriously?",
        "rating": "1",
        "review": "Who thought this would make a good film? None of the people working on the film ever had this thought? I had to walk out during the second half because of how absurd it was"
    },
    {
        "author": "srilucky-75653",
        "review_date": "25 December 2018",
        "title": " Unexpectedly better movie then what's being said",
        "rating": "8",
        "review": "Good entertaining, time pass movie... slightly different then they the usual...worth watching for sure"
    },
    {
        "author": "Deepakkaushik143",
        "review_date": "22 December 2018",
        "title": " Feel good film",
        "rating": "8",
        "review": "Don't compare it with epic films like chak de ..Swades.. but it is definitely much much better than dilwale .. happy new year and all..it is an entertaining film but not for those who like slapstick comedy..item numbers..if you are among the few who liked fan(I did) then go and watch it ..films like these don't come so often"
    },
    {
        "author": "sportynisar",
        "review_date": "21 December 2018",
        "title": " Mind blowing.",
        "rating": "8",
        "review": "Excellent first half,\nSecond half started slow but you'll enjoy and get emotional with some scenes, bauua will make you fall in love with him.\nClimax is brilliant.\nSRK is jaan.\nAnushka is brilliant\nKatrina Kaif is superb."
    },
    {
        "author": "kforkandarp",
        "review_date": "21 December 2018",
        "title": " The Amazing Zero",
        "rating": "9",
        "review": "Its a complete entertainer,a must watch movie,great work by Shah Rukh Khan,Anushka Sharma,Katrina Kaif,and a great direction again by Anand L Rai,also Good Music"
    },
    {
        "author": "hasto-15199",
        "review_date": "21 December 2018",
        "title": " Forget the Critic - \"A Movie You Must Watch\"",
        "rating": "10",
        "review": "Forget what the critic is saying , this might be a movie the critics will not like but the fan they will definitely like it. It's a different approach taken by Anand L rai and charismatic srk. With the combination of anushka and katrina , the movie gets back on the line. When the trailer came out we all thought it will be a huge comedy, but it's not just a comedy it's a very very emotional movie.I would like to urge people go to cinema and watch this beautiful film."
    },
    {
        "author": "kforkandarp",
        "review_date": "21 December 2018",
        "title": " Amazing Zero",
        "rating": "9",
        "review": "Its so wonderful movie to watch,a complete entertainer,great work by Shah Rukh Khan,Anushka Sharma,Katrina Kaif and great direction again by Anand L Rai,Music also superb and a new story to watch"
    },
    {
        "author": "jaydeepthakur",
        "review_date": "21 December 2018",
        "title": " Half-man is double man in attitude and wit!!!",
        "rating": "10",
        "review": "First half and initial part of second half is so awwwwwsome 10/10. Haven't laughed this much during a movie in years. Second half is stretched and feels less relevant and less funny. Such good graphics is rare for a bollywood movie. Acting is top notch 10 for Srk, 11 for Anushka and 8 for Katrina. Songs are adequate and well adapted. Story is average because of second half. It's a good one-time watch. A must watch for SRK fans."
    },
    {
        "author": "imamudafukinstarboy",
        "review_date": "14 January 2019",
        "title": " Deserves a watch",
        "rating": "8",
        "review": "Excellent in the first half however in the second half it's stretched a little bit but the performances of actors is outstanding.\nSo much of hard work on the VFX to make a guy that's 5'8 to look like 4'6.\nSuperb movie and a must watch"
    },
    {
        "author": "sagrawal-1802",
        "review_date": "22 December 2018",
        "title": " Superb blend of Romance, Comedy and Emotions",
        "rating": "9",
        "review": "Zero is Unique story of Bauaa that takes on roller coaster hilarious ride in 1st half and emotional ride in 2nd half...Those emotion are not for Bauaa but for Anushka who has given her Career Best performance...Katrina role is very limited but she is damn good.Though there are many Cameos but it was joy to see Salman and SRK together on celluloid....\nNot a single moment in movie where boredom creeps in, though editing wud have been little better..Background score of \"Mere Naam Tu\" is soo pleasant to earsAnand L Rai and SRK has surely delivered winner at box office and it more than expectations......Full on Paisa Vasool..Out and Out entertainer...."
    },
    {
        "author": "harshitguptaaryaa",
        "review_date": "22 December 2018",
        "title": " Srk acting was awesome",
        "rating": "10",
        "review": "Enjoyable movie with excellent comic timming. Best christmas gift for srk fans."
    },
    {
        "author": "bitturaj337",
        "review_date": "21 December 2018",
        "title": " Fantastic",
        "rating": "10",
        "review": "Fantastic this is only word I can say.\nThe acting of Shah Rukh Khan was awesome."
    },
    {
        "author": "gunnukhandelwal",
        "review_date": "21 December 2018",
        "title": " Mind-blowing zero",
        "rating": "9",
        "review": "Acting of Anushka Sharma so much good..\nShahrukh playing his best roll...\nFull on comedy 😂\nThe one word for Shahrukh Khan is\n\"OLD IS GOLD\""
    },
    {
        "author": "tapanajmera01",
        "review_date": "21 December 2018",
        "title": " Wow just wow",
        "rating": "10",
        "review": "Those who gives 1/2 stars give 10 stars to race 3 and TOH kyu bhai logo tumhari jali na..😂\nMust watch movie"
    },
    {
        "author": "nagesh-jadhav2",
        "review_date": "21 December 2018",
        "title": " Finally an srk film everyone is waiting for",
        "rating": "10",
        "review": "Its really nice,family would love this film even more.\nThe characters are strong ,great writing.."
    },
    {
        "author": "shyam-41877",
        "review_date": "21 December 2018",
        "title": " JUST ONE WORD BLOCKBUSTER",
        "rating": "10",
        "review": "The movie is just the best of 2018,Srk takes u to a wonderful ride with lots of humour and a great climax..."
    },
    {
        "author": "asokandanny",
        "review_date": "24 December 2018",
        "title": " A weird, disastrous film",
        "rating": "4",
        "review": "Zero was a weird film. Like REALLY WEIRD. It's not as bad as Race 3 (which made me stop watching Hindi movies for 6 months), but it's not groundbreaking either. Which is a shame really, because Shah Rukh Khan can do better films than this.Shah Rukh Khan really had energy in his performance. Even though he's 53, he still has the energy that makes me smile. 😃 Surprisingly, Katrina Kaif was far better than Anushka Sharma. In my opinion, Anushka's acting was a bit over-the top. Others were fine I guess. (SRK's friend, played by Mohammad Zeeshan Ayyub was a laugh riot! Perfect comic timing and the brightest spot of the film.)Story was a letdown. It was an old-people romance, The Martian copy and Bollywood Insider unevenly mashed up into one. SRK, I know you're the king of romance. But why go back to garbage lover-boy films that don't work anymore? Find a new niche. You can easily play a romance mentor (like in Dear Zindagi), or even something innovative that doesn't involve romance. Zero may have been innovative, but it wasn't a good risk at all. If you wanted to do an astronaut film, you should have just stuck to that rather than mix it with small-town romance and B-town scandal.The only saving grace of the film is its soundtrack, which easily contains the best songs of the year. \"Mere Naam Tu\", \"Issaqbaazi\" and \"Husn Parcham\" are songs that will really give you earworms and stick with you long after the film ends. However, the film is disastrous as a whole. It's better to stream it instead of paying for a ticket."
    },
    {
        "author": "iamkingforever",
        "review_date": "21 December 2018",
        "title": " Wonderful",
        "rating": "10",
        "review": "God of acting srk...anushka sharma is perfect...katrina outsanding"
    },
    {
        "author": "piyushpradhan-60662",
        "review_date": "21 December 2018",
        "title": " Best movie",
        "rating": "10",
        "review": "This is the best movie to watch which contains all the various expressions like comedy-drama love and every single thing in Bollywood from my point of view this is one of the best movie of 2018."
    },
    {
        "author": "iamsa-16120",
        "review_date": "21 December 2018",
        "title": " Awesome movie thanks SRK 😎",
        "rating": "10",
        "review": "Watch with your Family\nfriends i loved it movie 😍...\nWatched it everyone 😎"
    },
    {
        "author": "chiragjan",
        "review_date": "21 December 2018",
        "title": " One word - Amazing",
        "rating": "10",
        "review": "The movie plot is clear. Its an love story packed with comedy, emotions, strong acting, new concept. It is a must watch for every bollywood fan."
    },
    {
        "author": "nalinsharma-03422",
        "review_date": "21 December 2018",
        "title": " great movie by Anand l rai",
        "rating": "10",
        "review": "Nice direction. shahrukh,katrina,anukska,tigmanshu all actors done a wonderful l job"
    },
    {
        "author": "shrey-kansal",
        "review_date": "21 December 2018",
        "title": " Shahrukh Khan's career best performance",
        "rating": "10",
        "review": "Not a Shahrukh Khan fan but this was one dreamy ride. First half is very entertaining, everyone will like it but second half of very unique. If you think you will be intrigued by space travel sequences and intervened fantasy involved, then you will definitely love the film. Take the risk."
    },
    {
        "author": "mustafazoeb",
        "review_date": "23 December 2018",
        "title": " Okay okay",
        "rating": "6",
        "review": "Not worth a busy schedule. Go only if you have nothing to do."
    },
    {
        "author": "nalinsharma-03422",
        "review_date": "21 December 2018",
        "title": " great movie",
        "rating": "10",
        "review": "Shahrukh you are lovely watching. my 175 rupee is worth watching you and my fav kat"
    }
]